gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
 Based on CPU DB MC9S12XD256_144, version 2.87.166 (RegistersPrg V2.09) 

 ###################################################################
     Filename   mc9s12xd256.h
     Processor  MC9S12XD256BCFV
     FileFormat V2.09
     DataSheet  MC9S12XDP512 Rev. 2.15 July 2006
     Compiler   CodeWarrior compiler
     DateTime  14.09.2006, 1959
     Abstract  
         This header implements the mapping of IO devices.

     (c) Copyright UNIS, spol. s r.o. 1997-2006
     UNIS, spol. s r.o.
     Jundrovska 33
     624 00 Brno
     Czech Republic
     http       www.processorexpert.com
     mail       info@processorexpert.com

     File-Format-Revisions
      - 14.11.2005, V2.00 
               - Deprecated symbols added for backward compatibility (section at the end of this file)
      - 15.11.2005, V2.01 
               - Fixed invalid instruction in macro __RESET_WATCHDOG for HCS12 family.
      - 17.12.2005, V2.02 
               - Arrays (symbols xx_ARR) are defined as pointer to volatile, see issue #2778
      - 16.01.2006, V2.03 
               - Fixed declaration of non volatile registers. Now it does not require (but allows) their initialization, see issue #2920.
               - volatile modifier removed from declaration of non volatile registers (that contain modifier const)
      - 08.03.2006, V2.04 
               - Support for bit(s) names duplicated with any register name in .h header files
      - 24.03.2006, V2.05 
               - Fixed macro __RESET_WATCHDOG for HCS12 family - address and correct write order.
      - 26.04.2006, V2.06 
               - Revision is not related to this file (CPU family)
      - 27.04.2006, V2.07 
               - Fixed macro __RESET_WATCHDOG for HCS12, HCS12X ,HCS08 DZ and HCS08 EN derivatives (write 0x55,0xAA).
      - 07.06.2006, V2.08 
               - Revision is not related to this file (CPU family)
      - 03.07.2006, V2.09 
               - Revision is not related to this file (CPU family)

     CPU Registers Revisions
      - 23.05.2006, V2.87.111
              - Added register ATD1TEST1. REASON Bug in data sheet (Rev. 2.12)
      - 24.05.2006, V2.87.112
              - Removed bits MCCNTlo_BIT0..MCCNTlo_BIT7 and MCCNThi_BIT8.. MCCNThi_BIT15. REASON Bug-fix (#3166 from UNIS issue manager)
      - 09.08.2006, V2.87.159
              - Added SPI2 device. REASON Changes in data sheet (from rev 2.12 to rev 2.15)
 ###################################################################


#ifndef _MC9S12XD256_H
#define _MC9S12XD256_H

 Types definition 
typedef unsigned char byte;
typedef unsigned int word;
typedef unsigned long dword;
typedef unsigned long dlong[2];

#define REG_BASE 0x0000                 Base address for the IO register block 


#pragma MESSAGE DISABLE C1106  WARNING C1106 Non-standard bitfield type 
#pragma OPTION ADD V30toV31Compatible -BfaGapLimitBits4294967295 this guarantee correct bitfield positions

 interrupt vector table 
#define Vsi                     0x0000FF10
#define Reserved119             0x0000FF12
#define Reserved118             0x0000FF14
#define Reserved117             0x0000FF16
#define Reserved116             0x0000FF18
#define Reserved115             0x0000FF1A
#define Reserved114             0x0000FF1C
#define Reserved113             0x0000FF1E
#define Reserved112             0x0000FF20
#define Reserved111             0x0000FF22
#define Reserved110             0x0000FF24
#define Reserved109             0x0000FF26
#define Reserved108             0x0000FF28
#define Reserved107             0x0000FF2A
#define Reserved106             0x0000FF2C
#define Reserved105             0x0000FF2E
#define Reserved104             0x0000FF30
#define Reserved103             0x0000FF32
#define Reserved102             0x0000FF34
#define Reserved101             0x0000FF36
#define Reserved100             0x0000FF38
#define Reserved99              0x0000FF3A
#define Reserved98              0x0000FF3C
#define Reserved97              0x0000FF3E
#define Reserved96              0x0000FF40
#define Reserved95              0x0000FF42
#define Reserved94              0x0000FF44
#define Reserved93              0x0000FF46
#define Reserved92              0x0000FF48
#define Reserved91              0x0000FF4A
#define Reserved90              0x0000FF4C
#define Reserved89              0x0000FF4E
#define Reserved88              0x0000FF50
#define Reserved87              0x0000FF52
#define Reserved86              0x0000FF54
#define Reserved85              0x0000FF56
#define Reserved84              0x0000FF58
#define Reserved83              0x0000FF5A
#define Reserved82              0x0000FF5C
#define Reserved81              0x0000FF5E
#define Vxsramav                0x0000FF60
#define Vxsei                   0x0000FF62
#define Vxst7                   0x0000FF64
#define Vxst6                   0x0000FF66
#define Vxst5                   0x0000FF68
#define Vxst4                   0x0000FF6A
#define Vxst3                   0x0000FF6C
#define Vxst2                   0x0000FF6E
#define Vxst1                   0x0000FF70
#define Vxst0                   0x0000FF72
#define Vpit3                   0x0000FF74
#define Vpit2                   0x0000FF76
#define Vpit1                   0x0000FF78
#define Vpit0                   0x0000FF7A
#define VReserved65             0x0000FF7C
#define Vapi                    0x0000FF7E
#define Vlvi                    0x0000FF80
#define VReserved62             0x0000FF82
#define VReserved61             0x0000FF84
#define Vsci4                   0x0000FF86
#define VReserved59             0x0000FF88
#define Vsci2                   0x0000FF8A
#define Vpwmesdn                0x0000FF8C
#define Vportp                  0x0000FF8E
#define VReserved55             0x0000FF90
#define VReserved54             0x0000FF92
#define VReserved53             0x0000FF94
#define VReserved52             0x0000FF96
#define VReserved51             0x0000FF98
#define VReserved50             0x0000FF9A
#define VReserved49             0x0000FF9C
#define VReserved48             0x0000FF9E
#define VReserved47             0x0000FFA0
#define VReserved46             0x0000FFA2
#define VReserved45             0x0000FFA4
#define VReserved44             0x0000FFA6
#define VReserved43             0x0000FFA8
#define VReserved42             0x0000FFAA
#define VReserved41             0x0000FFAC
#define VReserved40             0x0000FFAE
#define Vcan0tx                 0x0000FFB0
#define Vcan0rx                 0x0000FFB2
#define Vcan0err                0x0000FFB4
#define Vcan0wkup               0x0000FFB6
#define Vflash                  0x0000FFB8
#define Veeprom                 0x0000FFBA
#define Vspi2                   0x0000FFBC
#define Vspi1                   0x0000FFBE
#define Viic0                   0x0000FFC0
#define VReserved30             0x0000FFC2
#define Vcrgscm                 0x0000FFC4
#define Vcrgplllck              0x0000FFC6
#define Vtimpabovf              0x0000FFC8
#define Vtimmdcu                0x0000FFCA
#define Vporth                  0x0000FFCC
#define Vportj                  0x0000FFCE
#define Vatd1                   0x0000FFD0
#define Vatd0                   0x0000FFD2
#define Vsci1                   0x0000FFD4
#define Vsci0                   0x0000FFD6
#define Vspi0                   0x0000FFD8
#define Vtimpaie                0x0000FFDA
#define Vtimpaaovf              0x0000FFDC
#define Vtimovf                 0x0000FFDE
#define Vtimch7                 0x0000FFE0
#define Vtimch6                 0x0000FFE2
#define Vtimch5                 0x0000FFE4
#define Vtimch4                 0x0000FFE6
#define Vtimch3                 0x0000FFE8
#define Vtimch2                 0x0000FFEA
#define Vtimch1                 0x0000FFEC
#define Vtimch0                 0x0000FFEE
#define Vrti                    0x0000FFF0
#define Virq                    0x0000FFF2
#define Vxirq                   0x0000FFF4
#define Vswi                    0x0000FFF6
#define Vtrap                   0x0000FFF8
#define Vcop                    0x0000FFFA
#define Vclkmon                 0x0000FFFC
#define Vreset                  0x0000FFFE

 registers IO map 

 PORTAB - Port AB; 0x00000000 
typedef union {
  word Word;
    Overlapped registers 
  struct {
     PORTA - Port A Register; 0x00000000 
    union {
      byte Byte;
      struct {
        byte PA0         1;                                        Port A Bit 0 
        byte PA1         1;                                        Port A Bit 1 
        byte PA2         1;                                        Port A Bit 2 
        byte PA3         1;                                        Port A Bit 3 
        byte PA4         1;                                        Port A Bit 4 
        byte PA5         1;                                        Port A Bit 5 
        byte PA6         1;                                        Port A Bit 6 
        byte PA7         1;                                        Port A Bit 7 
      } Bits;
    } PORTASTR;
    #define PORTA                       _PORTAB.Overlap_STR.PORTASTR.Byte
    #define PORTA_PA0                   _PORTAB.Overlap_STR.PORTASTR.Bits.PA0
    #define PORTA_PA1                   _PORTAB.Overlap_STR.PORTASTR.Bits.PA1
    #define PORTA_PA2                   _PORTAB.Overlap_STR.PORTASTR.Bits.PA2
    #define PORTA_PA3                   _PORTAB.Overlap_STR.PORTASTR.Bits.PA3
    #define PORTA_PA4                   _PORTAB.Overlap_STR.PORTASTR.Bits.PA4
    #define PORTA_PA5                   _PORTAB.Overlap_STR.PORTASTR.Bits.PA5
    #define PORTA_PA6                   _PORTAB.Overlap_STR.PORTASTR.Bits.PA6
    #define PORTA_PA7                   _PORTAB.Overlap_STR.PORTASTR.Bits.PA7
    
    
    #define PORTA_PA0_MASK              1
    #define PORTA_PA1_MASK              2
    #define PORTA_PA2_MASK              4
    #define PORTA_PA3_MASK              8
    #define PORTA_PA4_MASK              16
    #define PORTA_PA5_MASK              32
    #define PORTA_PA6_MASK              64
    #define PORTA_PA7_MASK              128


     PORTB - Port B Register; 0x00000001 
    union {
      byte Byte;
      struct {
        byte PB0         1;                                        Port B Bit 0 
        byte PB1         1;                                        Port B Bit 1 
        byte PB2         1;                                        Port B Bit 2 
        byte PB3         1;                                        Port B Bit 3 
        byte PB4         1;                                        Port B Bit 4 
        byte PB5         1;                                        Port B Bit 5 
        byte PB6         1;                                        Port B Bit 6 
        byte PB7         1;                                        Port B Bit 7 
      } Bits;
    } PORTBSTR;
    #define PORTB                       _PORTAB.Overlap_STR.PORTBSTR.Byte
    #define PORTB_PB0                   _PORTAB.Overlap_STR.PORTBSTR.Bits.PB0
    #define PORTB_PB1                   _PORTAB.Overlap_STR.PORTBSTR.Bits.PB1
    #define PORTB_PB2                   _PORTAB.Overlap_STR.PORTBSTR.Bits.PB2
    #define PORTB_PB3                   _PORTAB.Overlap_STR.PORTBSTR.Bits.PB3
    #define PORTB_PB4                   _PORTAB.Overlap_STR.PORTBSTR.Bits.PB4
    #define PORTB_PB5                   _PORTAB.Overlap_STR.PORTBSTR.Bits.PB5
    #define PORTB_PB6                   _PORTAB.Overlap_STR.PORTBSTR.Bits.PB6
    #define PORTB_PB7                   _PORTAB.Overlap_STR.PORTBSTR.Bits.PB7
    
    
