gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
 MMCCTL0 - S12X_MMC Control Register 0; 0x0000000A 
typedef union {
  byte Byte;
  struct {
    byte CS0E        1;                                        Chip Select Enable 0 
    byte CS1E        1;                                        Chip Select Enable 1 
    byte CS2E        1;                                        Chip Select Enable 2 
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
  } Bits;
} MMCCTL0STR;
extern volatile MMCCTL0STR _MMCCTL0 @(REG_BASE + 0x0000000A);
#define MMCCTL0                         _MMCCTL0.Byte
#define MMCCTL0_CS0E                    _MMCCTL0.Bits.CS0E
#define MMCCTL0_CS1E                    _MMCCTL0.Bits.CS1E
#define MMCCTL0_CS2E                    _MMCCTL0.Bits.CS2E

#define MMCCTL0_CS0E_MASK               1
#define MMCCTL0_CS1E_MASK               2
#define MMCCTL0_CS2E_MASK               4


 MODE - Mode Register; 0x0000000B 
typedef union {
  byte Byte;
  struct {
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
    byte MODA        1;                                        Mode Select Bit A 
    byte MODB        1;                                        Mode Select Bit B 
    byte MODC        1;                                        Mode Select Bit C 
  } Bits;
  struct {
    byte         1;
    byte         1;
    byte         1;
    byte         1;
    byte         1;
    byte grpMODx 3;
  } MergedBits;
} MODESTR;
extern volatile MODESTR _MODE @(REG_BASE + 0x0000000B);
#define MODE                            _MODE.Byte
#define MODE_MODA                       _MODE.Bits.MODA
#define MODE_MODB                       _MODE.Bits.MODB
#define MODE_MODC                       _MODE.Bits.MODC
#define MODE_MODx                       _MODE.MergedBits.grpMODx

#define MODE_MODA_MASK                  32
#define MODE_MODB_MASK                  64
#define MODE_MODC_MASK                  128
#define MODE_MODx_MASK                  224
#define MODE_MODx_BITNUM                5


 PUCR - Pull-Up Control Register; 0x0000000C 
typedef union {
  byte Byte;
  struct {
    byte PUPAE       1;                                        Pull-Up Port A Enable 
    byte PUPBE       1;                                        Pull-Up Port B Enable 
    byte PUPCE       1;                                        Pull-Up Port C Enable 
    byte PUPDE       1;                                        Pull-Up Port D Enable 
    byte PUPEE       1;                                        Pull-Up Port E Enable 
    byte             1; 
    byte BKPUE       1;                                        BKGD and VREGEN Pin Pull-up Enable 
    byte PUPKE       1;                                        Pull-Up Port K Enable 
  } Bits;
} PUCRSTR;
extern volatile PUCRSTR _PUCR @(REG_BASE + 0x0000000C);
#define PUCR                            _PUCR.Byte
#define PUCR_PUPAE                      _PUCR.Bits.PUPAE
#define PUCR_PUPBE                      _PUCR.Bits.PUPBE
#define PUCR_PUPCE                      _PUCR.Bits.PUPCE
#define PUCR_PUPDE                      _PUCR.Bits.PUPDE
#define PUCR_PUPEE                      _PUCR.Bits.PUPEE
#define PUCR_BKPUE                      _PUCR.Bits.BKPUE
#define PUCR_PUPKE                      _PUCR.Bits.PUPKE

#define PUCR_PUPAE_MASK                 1
#define PUCR_PUPBE_MASK                 2
#define PUCR_PUPCE_MASK                 4
#define PUCR_PUPDE_MASK                 8
#define PUCR_PUPEE_MASK                 16
#define PUCR_BKPUE_MASK                 64
#define PUCR_PUPKE_MASK                 128


 RDRIV - Reduced Drive of IO Lines; 0x0000000D 
typedef union {
  byte Byte;
  struct {
    byte RDPA        1;                                        Reduced Drive of Port A 
    byte RDPB        1;                                        Reduced Drive of Port B 
    byte RDPC        1;                                        Reduced Drive of Port C 
    byte RDPD        1;                                        Reduced Drive of Port D 
    byte RDPE        1;                                        Reduced Drive of Port E 
    byte             1; 
    byte             1; 
    byte RDPK        1;                                        Reduced Drive of Port K 
  } Bits;
  struct {
    byte grpRDPx 5;
    byte         1;
    byte         1;
    byte         1;
  } MergedBits;
} RDRIVSTR;
extern volatile RDRIVSTR _RDRIV @(REG_BASE + 0x0000000D);
#define RDRIV                           _RDRIV.Byte
#define RDRIV_RDPA                      _RDRIV.Bits.RDPA
#define RDRIV_RDPB                      _RDRIV.Bits.RDPB
#define RDRIV_RDPC                      _RDRIV.Bits.RDPC
#define RDRIV_RDPD                      _RDRIV.Bits.RDPD
#define RDRIV_RDPE                      _RDRIV.Bits.RDPE
#define RDRIV_RDPK                      _RDRIV.Bits.RDPK
#define RDRIV_RDPx                      _RDRIV.MergedBits.grpRDPx

#define RDRIV_RDPA_MASK                 1
#define RDRIV_RDPB_MASK                 2
#define RDRIV_RDPC_MASK                 4
#define RDRIV_RDPD_MASK                 8
#define RDRIV_RDPE_MASK                 16
#define RDRIV_RDPK_MASK                 128
#define RDRIV_RDPx_MASK                 31
#define RDRIV_RDPx_BITNUM               0


 EBICTL0 - External Bus Interface Control Register 0; 0x0000000E 
typedef union {
  byte Byte;
  struct {
    byte ASIZ0       1;                                        External Address Bus Size Bit 0 
    byte ASIZ1       1;                                        External Address Bus Size Bit 1 
    byte ASIZ2       1;                                        External Address Bus Size Bit 2 
    byte ASIZ3       1;                                        External Address Bus Size Bit 3 
    byte ASIZ4       1;                                        External Address Bus Size Bit 4 
    byte HDBE        1;                                        High Data Byte Enable 
    byte             1; 
    byte ITHRS       1;                                        Reduced Input Threshold 
  } Bits;
  struct {
    byte grpASIZ 5;
    byte         1;
    byte         1;
    byte         1;
  } MergedBits;
} EBICTL0STR;
extern volatile EBICTL0STR _EBICTL0 @(REG_BASE + 0x0000000E);
#define EBICTL0                         _EBICTL0.Byte
#define EBICTL0_ASIZ0                   _EBICTL0.Bits.ASIZ0
#define EBICTL0_ASIZ1                   _EBICTL0.Bits.ASIZ1
#define EBICTL0_ASIZ2                   _EBICTL0.Bits.ASIZ2
#define EBICTL0_ASIZ3                   _EBICTL0.Bits.ASIZ3
#define EBICTL0_ASIZ4                   _EBICTL0.Bits.ASIZ4
#define EBICTL0_HDBE                    _EBICTL0.Bits.HDBE
#define EBICTL0_ITHRS                   _EBICTL0.Bits.ITHRS
 EBICTL_ARR Access 2 EBICTLx registers in an array 
#define EBICTL_ARR                      ((volatile byte ) &EBICTL0)
#define EBICTL0_ASIZ                    _EBICTL0.MergedBits.grpASIZ

#define EBICTL0_ASIZ0_MASK              1
#define EBICTL0_ASIZ1_MASK              2
#define EBICTL0_ASIZ2_MASK              4
#define EBICTL0_ASIZ3_MASK              8
#define EBICTL0_ASIZ4_MASK              16
#define EBICTL0_HDBE_MASK               32
#define EBICTL0_ITHRS_MASK              128
#define EBICTL0_ASIZ_MASK               31
#define EBICTL0_ASIZ_BITNUM             0


 EBICTL1 - External Bus Interface Control Register 1; 0x0000000F 
typedef union {
  byte Byte;
  struct {
    byte EXSTR0      1;                                        External Access Stretch Bit 0 
    byte EXSTR1      1;                                        External Access Stretch Bit 1 
    byte EXSTR2      1;                                        External Access Stretch Bit 2 
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
    byte EWAITE      1;                                        External Wait Enable 
  } Bits;
  struct {
    byte grpEXSTR 3;
    byte         1;
    byte         1;
    byte         1;
    byte         1;
    byte         1;
  } MergedBits;
} EBICTL1STR;
