gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
extern volatile EBICTL1STR _EBICTL1 @(REG_BASE + 0x0000000F);
#define EBICTL1                         _EBICTL1.Byte
#define EBICTL1_EXSTR0                  _EBICTL1.Bits.EXSTR0
#define EBICTL1_EXSTR1                  _EBICTL1.Bits.EXSTR1
#define EBICTL1_EXSTR2                  _EBICTL1.Bits.EXSTR2
#define EBICTL1_EWAITE                  _EBICTL1.Bits.EWAITE
#define EBICTL1_EXSTR                   _EBICTL1.MergedBits.grpEXSTR

#define EBICTL1_EXSTR0_MASK             1
#define EBICTL1_EXSTR1_MASK             2
#define EBICTL1_EXSTR2_MASK             4
#define EBICTL1_EWAITE_MASK             128
#define EBICTL1_EXSTR_MASK              7
#define EBICTL1_EXSTR_BITNUM            0


 GPAGE - Global Page Index Register; 0x00000010 
typedef union {
  byte Byte;
  struct {
    byte GP0         1;                                        Global Page Index Bit 0 
    byte GP1         1;                                        Global Page Index Bit 1 
    byte GP2         1;                                        Global Page Index Bit 2 
    byte GP3         1;                                        Global Page Index Bit 3 
    byte GP4         1;                                        Global Page Index Bit 4 
    byte GP5         1;                                        Global Page Index Bit 5 
    byte GP6         1;                                        Global Page Index Bit 6 
    byte             1; 
  } Bits;
  struct {
    byte grpGP   7;
    byte         1;
  } MergedBits;
} GPAGESTR;
extern volatile GPAGESTR _GPAGE @(REG_BASE + 0x00000010);
#define GPAGE                           _GPAGE.Byte
#define GPAGE_GP0                       _GPAGE.Bits.GP0
#define GPAGE_GP1                       _GPAGE.Bits.GP1
#define GPAGE_GP2                       _GPAGE.Bits.GP2
#define GPAGE_GP3                       _GPAGE.Bits.GP3
#define GPAGE_GP4                       _GPAGE.Bits.GP4
#define GPAGE_GP5                       _GPAGE.Bits.GP5
#define GPAGE_GP6                       _GPAGE.Bits.GP6
#define GPAGE_GP                        _GPAGE.MergedBits.grpGP

#define GPAGE_GP0_MASK                  1
#define GPAGE_GP1_MASK                  2
#define GPAGE_GP2_MASK                  4
#define GPAGE_GP3_MASK                  8
#define GPAGE_GP4_MASK                  16
#define GPAGE_GP5_MASK                  32
#define GPAGE_GP6_MASK                  64
#define GPAGE_GP_MASK                   127
#define GPAGE_GP_BITNUM                 0


 DIRECT - Direct Page Register; 0x00000011 
typedef union {
  byte Byte;
  struct {
    byte DP8         1;                                        Direct Page Bit 8 
    byte DP9         1;                                        Direct Page Bit 9 
    byte DP10        1;                                        Direct Page Bit 10 
    byte DP11        1;                                        Direct Page Bit 11 
    byte DP12        1;                                        Direct Page Bit 12 
    byte DP13        1;                                        Direct Page Bit 13 
    byte DP14        1;                                        Direct Page Bit 14 
    byte DP15        1;                                        Direct Page Bit 15 
  } Bits;
} DIRECTSTR;
extern volatile DIRECTSTR _DIRECT @(REG_BASE + 0x00000011);
#define DIRECT                          _DIRECT.Byte
#define DIRECT_DP8                      _DIRECT.Bits.DP8
#define DIRECT_DP9                      _DIRECT.Bits.DP9
#define DIRECT_DP10                     _DIRECT.Bits.DP10
#define DIRECT_DP11                     _DIRECT.Bits.DP11
#define DIRECT_DP12                     _DIRECT.Bits.DP12
#define DIRECT_DP13                     _DIRECT.Bits.DP13
#define DIRECT_DP14                     _DIRECT.Bits.DP14
#define DIRECT_DP15                     _DIRECT.Bits.DP15

#define DIRECT_DP8_MASK                 1
#define DIRECT_DP9_MASK                 2
#define DIRECT_DP10_MASK                4
#define DIRECT_DP11_MASK                8
#define DIRECT_DP12_MASK                16
#define DIRECT_DP13_MASK                32
#define DIRECT_DP14_MASK                64
#define DIRECT_DP15_MASK                128


 MMCCTL1 - S12X_MMC Control Register 1; 0x00000013 
typedef union {
  byte Byte;
  struct {
    byte ROMON       1;                                        Enable FLASH or ROM in the memory map 
    byte ROMHM       1;                                        FLASH or ROM only in higher Half of Memory Map 
    byte EROMON      1;                                        Enables emulated FLASH or ROM memory in the memory map. 
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
  } Bits;
} MMCCTL1STR;
extern volatile MMCCTL1STR _MMCCTL1 @(REG_BASE + 0x00000013);
#define MMCCTL1                         _MMCCTL1.Byte
#define MMCCTL1_ROMON                   _MMCCTL1.Bits.ROMON
#define MMCCTL1_ROMHM                   _MMCCTL1.Bits.ROMHM
#define MMCCTL1_EROMON                  _MMCCTL1.Bits.EROMON

#define MMCCTL1_ROMON_MASK              1
#define MMCCTL1_ROMHM_MASK              2
#define MMCCTL1_EROMON_MASK             4


 RPAGE - RAM Page Index Register; 0x00000016 
typedef union {
  byte Byte;
  struct {
    byte RP0         1;                                        RAM Page Index Bit 0 
    byte RP1         1;                                        RAM Page Index Bit 1 
    byte RP2         1;                                        RAM Page Index Bit 2 
    byte RP3         1;                                        RAM Page Index Bit 3 
    byte RP4         1;                                        RAM Page Index Bit 4 
    byte RP5         1;                                        RAM Page Index Bit 5 
    byte RP6         1;                                        RAM Page Index Bit 6 
    byte RP7         1;                                        RAM Page Index Bit 7 
  } Bits;
} RPAGESTR;
extern volatile RPAGESTR _RPAGE @(REG_BASE + 0x00000016);
#define RPAGE                           _RPAGE.Byte
#define RPAGE_RP0                       _RPAGE.Bits.RP0
#define RPAGE_RP1                       _RPAGE.Bits.RP1
#define RPAGE_RP2                       _RPAGE.Bits.RP2
#define RPAGE_RP3                       _RPAGE.Bits.RP3
#define RPAGE_RP4                       _RPAGE.Bits.RP4
#define RPAGE_RP5                       _RPAGE.Bits.RP5
#define RPAGE_RP6                       _RPAGE.Bits.RP6
#define RPAGE_RP7                       _RPAGE.Bits.RP7

