gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
#define RPAGE_RP0_MASK                  1
#define RPAGE_RP1_MASK                  2
#define RPAGE_RP2_MASK                  4
#define RPAGE_RP3_MASK                  8
#define RPAGE_RP4_MASK                  16
#define RPAGE_RP5_MASK                  32
#define RPAGE_RP6_MASK                  64
#define RPAGE_RP7_MASK                  128


 EPAGE - EEPROM Page Index Register; 0x00000017 
typedef union {
  byte Byte;
  struct {
    byte EP0         1;                                        EEPROM Page Index Bit 0 
    byte EP1         1;                                        EEPROM Page Index Bit 1 
    byte EP2         1;                                        EEPROM Page Index Bit 2 
    byte EP3         1;                                        EEPROM Page Index Bit 3 
    byte EP4         1;                                        EEPROM Page Index Bit 4 
    byte EP5         1;                                        EEPROM Page Index Bit 5 
    byte EP6         1;                                        EEPROM Page Index Bit 6 
    byte EP7         1;                                        EEPROM Page Index Bit 7 
  } Bits;
} EPAGESTR;
extern volatile EPAGESTR _EPAGE @(REG_BASE + 0x00000017);
#define EPAGE                           _EPAGE.Byte
#define EPAGE_EP0                       _EPAGE.Bits.EP0
#define EPAGE_EP1                       _EPAGE.Bits.EP1
#define EPAGE_EP2                       _EPAGE.Bits.EP2
#define EPAGE_EP3                       _EPAGE.Bits.EP3
#define EPAGE_EP4                       _EPAGE.Bits.EP4
#define EPAGE_EP5                       _EPAGE.Bits.EP5
#define EPAGE_EP6                       _EPAGE.Bits.EP6
#define EPAGE_EP7                       _EPAGE.Bits.EP7

#define EPAGE_EP0_MASK                  1
#define EPAGE_EP1_MASK                  2
#define EPAGE_EP2_MASK                  4
#define EPAGE_EP3_MASK                  8
#define EPAGE_EP4_MASK                  16
#define EPAGE_EP5_MASK                  32
#define EPAGE_EP6_MASK                  64
#define EPAGE_EP7_MASK                  128


 PARTID - Part ID Register; 0x0000001A 
typedef union {
  word Word;
    Overlapped registers 
  struct {
     PARTIDH - Part ID Register High; 0x0000001A 
    union {
      byte Byte;
      struct {
        byte ID8         1;                                        Part ID Register Bit 8 
        byte ID9         1;                                        Part ID Register Bit 9 
        byte ID10        1;                                        Part ID Register Bit 10 
        byte ID11        1;                                        Part ID Register Bit 11 
        byte ID12        1;                                        Part ID Register Bit 12 
        byte ID13        1;                                        Part ID Register Bit 13 
        byte ID14        1;                                        Part ID Register Bit 14 
        byte ID15        1;                                        Part ID Register Bit 15 
      } Bits;
    } PARTIDHSTR;
    #define PARTIDH                     _PARTID.Overlap_STR.PARTIDHSTR.Byte
    #define PARTIDH_ID8                 _PARTID.Overlap_STR.PARTIDHSTR.Bits.ID8
    #define PARTIDH_ID9                 _PARTID.Overlap_STR.PARTIDHSTR.Bits.ID9
    #define PARTIDH_ID10                _PARTID.Overlap_STR.PARTIDHSTR.Bits.ID10
    #define PARTIDH_ID11                _PARTID.Overlap_STR.PARTIDHSTR.Bits.ID11
    #define PARTIDH_ID12                _PARTID.Overlap_STR.PARTIDHSTR.Bits.ID12
    #define PARTIDH_ID13                _PARTID.Overlap_STR.PARTIDHSTR.Bits.ID13
    #define PARTIDH_ID14                _PARTID.Overlap_STR.PARTIDHSTR.Bits.ID14
    #define PARTIDH_ID15                _PARTID.Overlap_STR.PARTIDHSTR.Bits.ID15
    
    
    #define PARTIDH_ID8_MASK            1
    #define PARTIDH_ID9_MASK            2
    #define PARTIDH_ID10_MASK           4
    #define PARTIDH_ID11_MASK           8
    #define PARTIDH_ID12_MASK           16
    #define PARTIDH_ID13_MASK           32
    #define PARTIDH_ID14_MASK           64
    #define PARTIDH_ID15_MASK           128


     PARTIDL - Part ID Register Low; 0x0000001B 
    union {
      byte Byte;
      struct {
        byte ID0         1;                                        Part ID Register Bit 0 
        byte ID1         1;                                        Part ID Register Bit 1 
        byte ID2         1;                                        Part ID Register Bit 2 
        byte ID3         1;                                        Part ID Register Bit 3 
        byte ID4         1;                                        Part ID Register Bit 4 
        byte ID5         1;                                        Part ID Register Bit 5 
        byte ID6         1;                                        Part ID Register Bit 6 
        byte ID7         1;                                        Part ID Register Bit 7 
      } Bits;
    } PARTIDLSTR;
    #define PARTIDL                     _PARTID.Overlap_STR.PARTIDLSTR.Byte
    #define PARTIDL_ID0                 _PARTID.Overlap_STR.PARTIDLSTR.Bits.ID0
    #define PARTIDL_ID1                 _PARTID.Overlap_STR.PARTIDLSTR.Bits.ID1
    #define PARTIDL_ID2                 _PARTID.Overlap_STR.PARTIDLSTR.Bits.ID2
    #define PARTIDL_ID3                 _PARTID.Overlap_STR.PARTIDLSTR.Bits.ID3
    #define PARTIDL_ID4                 _PARTID.Overlap_STR.PARTIDLSTR.Bits.ID4
    #define PARTIDL_ID5                 _PARTID.Overlap_STR.PARTIDLSTR.Bits.ID5
    #define PARTIDL_ID6                 _PARTID.Overlap_STR.PARTIDLSTR.Bits.ID6
    #define PARTIDL_ID7                 _PARTID.Overlap_STR.PARTIDLSTR.Bits.ID7
    
    
    #define PARTIDL_ID0_MASK            1
    #define PARTIDL_ID1_MASK            2
    #define PARTIDL_ID2_MASK            4
    #define PARTIDL_ID3_MASK            8
    #define PARTIDL_ID4_MASK            16
    #define PARTIDL_ID5_MASK            32
    #define PARTIDL_ID6_MASK            64
    #define PARTIDL_ID7_MASK            128

  } Overlap_STR;

