gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
  struct {
    word ID0         1;                                        Part ID Register Bit 0 
    word ID1         1;                                        Part ID Register Bit 1 
    word ID2         1;                                        Part ID Register Bit 2 
    word ID3         1;                                        Part ID Register Bit 3 
    word ID4         1;                                        Part ID Register Bit 4 
    word ID5         1;                                        Part ID Register Bit 5 
    word ID6         1;                                        Part ID Register Bit 6 
    word ID7         1;                                        Part ID Register Bit 7 
    word ID8         1;                                        Part ID Register Bit 8 
    word ID9         1;                                        Part ID Register Bit 9 
    word ID10        1;                                        Part ID Register Bit 10 
    word ID11        1;                                        Part ID Register Bit 11 
    word ID12        1;                                        Part ID Register Bit 12 
    word ID13        1;                                        Part ID Register Bit 13 
    word ID14        1;                                        Part ID Register Bit 14 
    word ID15        1;                                        Part ID Register Bit 15 
  } Bits;
} PARTIDSTR;
extern volatile PARTIDSTR _PARTID @(REG_BASE + 0x0000001A);
#define PARTID                          _PARTID.Word
#define PARTID_ID0                      _PARTID.Bits.ID0
#define PARTID_ID1                      _PARTID.Bits.ID1
#define PARTID_ID2                      _PARTID.Bits.ID2
#define PARTID_ID3                      _PARTID.Bits.ID3
#define PARTID_ID4                      _PARTID.Bits.ID4
#define PARTID_ID5                      _PARTID.Bits.ID5
#define PARTID_ID6                      _PARTID.Bits.ID6
#define PARTID_ID7                      _PARTID.Bits.ID7
#define PARTID_ID8                      _PARTID.Bits.ID8
#define PARTID_ID9                      _PARTID.Bits.ID9
#define PARTID_ID10                     _PARTID.Bits.ID10
#define PARTID_ID11                     _PARTID.Bits.ID11
#define PARTID_ID12                     _PARTID.Bits.ID12
#define PARTID_ID13                     _PARTID.Bits.ID13
#define PARTID_ID14                     _PARTID.Bits.ID14
#define PARTID_ID15                     _PARTID.Bits.ID15

#define PARTID_ID0_MASK                 1
#define PARTID_ID1_MASK                 2
#define PARTID_ID2_MASK                 4
#define PARTID_ID3_MASK                 8
#define PARTID_ID4_MASK                 16
#define PARTID_ID5_MASK                 32
#define PARTID_ID6_MASK                 64
#define PARTID_ID7_MASK                 128
#define PARTID_ID8_MASK                 256
#define PARTID_ID9_MASK                 512
#define PARTID_ID10_MASK                1024
#define PARTID_ID11_MASK                2048
#define PARTID_ID12_MASK                4096
#define PARTID_ID13_MASK                8192
#define PARTID_ID14_MASK                16384
#define PARTID_ID15_MASK                32768


 ECLKCTL - ECLK Control Register; 0x0000001C 
typedef union {
  byte Byte;
  struct {
    byte EDIV0       1;                                        Free-running ECLK Divider Bit 0 
    byte EDIV1       1;                                        Free-running ECLK Divider Bit 1 
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
    byte NCLKX2      1;                                        No ECLKX2 
    byte NECLK       1;                                        No ECLK 
  } Bits;
  struct {
    byte grpEDIV 2;
    byte         1;
    byte         1;
    byte         1;
    byte         1;
    byte grpNCLKX_2 1;
    byte         1;
  } MergedBits;
} ECLKCTLSTR;
extern volatile ECLKCTLSTR _ECLKCTL @(REG_BASE + 0x0000001C);
#define ECLKCTL                         _ECLKCTL.Byte
#define ECLKCTL_EDIV0                   _ECLKCTL.Bits.EDIV0
#define ECLKCTL_EDIV1                   _ECLKCTL.Bits.EDIV1
#define ECLKCTL_NCLKX2                  _ECLKCTL.Bits.NCLKX2
#define ECLKCTL_NECLK                   _ECLKCTL.Bits.NECLK
#define ECLKCTL_EDIV                    _ECLKCTL.MergedBits.grpEDIV

#define ECLKCTL_EDIV0_MASK              1
#define ECLKCTL_EDIV1_MASK              2
#define ECLKCTL_NCLKX2_MASK             64
#define ECLKCTL_NECLK_MASK              128
#define ECLKCTL_EDIV_MASK               3
#define ECLKCTL_EDIV_BITNUM             0


 IRQCR - Interrupt Control Register; 0x0000001E 
typedef union {
  byte Byte;
  struct {
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
    byte IRQEN       1;                                        External IRQ Enable 
    byte IRQE        1;                                        IRQ Select Edge Sensitive Only 
  } Bits;
} IRQCRSTR;
extern volatile IRQCRSTR _IRQCR @(REG_BASE + 0x0000001E);
#define IRQCR                           _IRQCR.Byte
#define IRQCR_IRQEN                     _IRQCR.Bits.IRQEN
#define IRQCR_IRQE                      _IRQCR.Bits.IRQE

#define IRQCR_IRQEN_MASK                64
#define IRQCR_IRQE_MASK                 128


 DBGC1 - Debug Control Register 1; 0x00000020 
typedef union {
  byte Byte;
  struct {
    byte COMRV       2;                                        Comparator Register Visibility Bits 
    byte DBGBRK      2;                                        S12X_DBG Breakpoint Enable Bits 
    byte BDM         1;                                        Background Debug Mode Enable 
    byte XGSBPE      1;                                        XGATE SW Breakpoint Enable 
    byte TRIG        1;                                        Immediate Trigger Request Bit 
    byte ARM         1;                                        Arm Bit 
  } Bits;
} DBGC1STR;
extern volatile DBGC1STR _DBGC1 @(REG_BASE + 0x00000020);
#define DBGC1                           _DBGC1.Byte
#define DBGC1_COMRV                     _DBGC1.Bits.COMRV
#define DBGC1_DBGBRK                    _DBGC1.Bits.DBGBRK
#define DBGC1_BDM                       _DBGC1.Bits.BDM
#define DBGC1_XGSBPE                    _DBGC1.Bits.XGSBPE
#define DBGC1_TRIG                      _DBGC1.Bits.TRIG
#define DBGC1_ARM                       _DBGC1.Bits.ARM

#define DBGC1_COMRV_MASK                3
#define DBGC1_COMRV_BITNUM              0
#define DBGC1_DBGBRK_MASK               12
#define DBGC1_DBGBRK_BITNUM             2
#define DBGC1_BDM_MASK                  16
#define DBGC1_XGSBPE_MASK               32
#define DBGC1_TRIG_MASK                 64
#define DBGC1_ARM_MASK                  128


 DBGSR - Debug Status Register; 0x00000021 
typedef union {
  byte Byte;
  struct {
    byte SSF0        1;                                        State Sequencer Flag Bit 0 
    byte SSF1        1;                                        State Sequencer Flag Bit 1 
    byte SSF2        1;                                        State Sequencer Flag Bit 2 
    byte             1; 
    byte             1; 
    byte             1; 
    byte EXTF        1;                                        External Tag Hit Flag 
    byte TBF         1;                                        Trace Buffer Full 
  } Bits;
  struct {
    byte grpSSF  3;
    byte         1;
    byte         1;
    byte         1;
    byte         1;
    byte         1;
  } MergedBits;
} DBGSRSTR;
extern volatile DBGSRSTR _DBGSR @(REG_BASE + 0x00000021);
#define DBGSR                           _DBGSR.Byte
#define DBGSR_SSF0                      _DBGSR.Bits.SSF0
#define DBGSR_SSF1                      _DBGSR.Bits.SSF1
#define DBGSR_SSF2                      _DBGSR.Bits.SSF2
#define DBGSR_EXTF                      _DBGSR.Bits.EXTF
#define DBGSR_TBF                       _DBGSR.Bits.TBF
#define DBGSR_SSF                       _DBGSR.MergedBits.grpSSF

#define DBGSR_SSF0_MASK                 1
#define DBGSR_SSF1_MASK                 2
#define DBGSR_SSF2_MASK                 4
#define DBGSR_EXTF_MASK                 64
#define DBGSR_TBF_MASK                  128
#define DBGSR_SSF_MASK                  7
#define DBGSR_SSF_BITNUM                0


