gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
 DBGTCR - Debug Trace Control Register; 0x00000022 
typedef union {
  byte Byte;
  struct {
    byte TALIGN      2;                                        Trigger Align Bits 
    byte TRCMOD      2;                                        Trace Mode Bits 
    byte TRANGE      2;                                        Trace Range Bits 
    byte TSOURCE     2;                                        Trace Source Control Bits 
  } Bits;
} DBGTCRSTR;
extern volatile DBGTCRSTR _DBGTCR @(REG_BASE + 0x00000022);
#define DBGTCR                          _DBGTCR.Byte
#define DBGTCR_TALIGN                   _DBGTCR.Bits.TALIGN
#define DBGTCR_TRCMOD                   _DBGTCR.Bits.TRCMOD
#define DBGTCR_TRANGE                   _DBGTCR.Bits.TRANGE
#define DBGTCR_TSOURCE                  _DBGTCR.Bits.TSOURCE

#define DBGTCR_TALIGN_MASK              3
#define DBGTCR_TALIGN_BITNUM            0
#define DBGTCR_TRCMOD_MASK              12
#define DBGTCR_TRCMOD_BITNUM            2
#define DBGTCR_TRANGE_MASK              48
#define DBGTCR_TRANGE_BITNUM            4
#define DBGTCR_TSOURCE_MASK             192
#define DBGTCR_TSOURCE_BITNUM           6


 DBGC2 - Debug Control Register 2; 0x00000023 
typedef union {
  byte Byte;
  struct {
    byte ABCM        2;                                        A and B Comparator Match Control 
    byte CDCM        2;                                        C and D Comparator Match Control 
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
  } Bits;
} DBGC2STR;
extern volatile DBGC2STR _DBGC2 @(REG_BASE + 0x00000023);
#define DBGC2                           _DBGC2.Byte
#define DBGC2_ABCM                      _DBGC2.Bits.ABCM
#define DBGC2_CDCM                      _DBGC2.Bits.CDCM

#define DBGC2_ABCM_MASK                 3
#define DBGC2_ABCM_BITNUM               0
#define DBGC2_CDCM_MASK                 12
#define DBGC2_CDCM_BITNUM               2


 DBGTB - Debug Trace Buffer Register; 0x00000024 
typedef union {
  word Word;
    Overlapped registers 
  struct {
     DBGTBH - Debug Trace Buffer Register High; 0x00000024 
    union {
      byte Byte;
      struct {
        byte BIT8        1;                                        Debug Trace Buffer Bit 8 
        byte BIT9        1;                                        Debug Trace Buffer Bit 9 
        byte BIT10       1;                                        Debug Trace Buffer Bit 10 
        byte BIT11       1;                                        Debug Trace Buffer Bit 11 
        byte BIT12       1;                                        Debug Trace Buffer Bit 12 
        byte BIT13       1;                                        Debug Trace Buffer Bit 13 
        byte BIT14       1;                                        Debug Trace Buffer Bit 14 
        byte BIT15       1;                                        Debug Trace Buffer Bit 15 
      } Bits;
    } DBGTBHSTR;
    #define DBGTBH                      _DBGTB.Overlap_STR.DBGTBHSTR.Byte
    #define DBGTBH_BIT8                 _DBGTB.Overlap_STR.DBGTBHSTR.Bits.BIT8
    #define DBGTBH_BIT9                 _DBGTB.Overlap_STR.DBGTBHSTR.Bits.BIT9
    #define DBGTBH_BIT10                _DBGTB.Overlap_STR.DBGTBHSTR.Bits.BIT10
    #define DBGTBH_BIT11                _DBGTB.Overlap_STR.DBGTBHSTR.Bits.BIT11
    #define DBGTBH_BIT12                _DBGTB.Overlap_STR.DBGTBHSTR.Bits.BIT12
    #define DBGTBH_BIT13                _DBGTB.Overlap_STR.DBGTBHSTR.Bits.BIT13
    #define DBGTBH_BIT14                _DBGTB.Overlap_STR.DBGTBHSTR.Bits.BIT14
    #define DBGTBH_BIT15                _DBGTB.Overlap_STR.DBGTBHSTR.Bits.BIT15
    
    
    #define DBGTBH_BIT8_MASK            1
    #define DBGTBH_BIT9_MASK            2
    #define DBGTBH_BIT10_MASK           4
    #define DBGTBH_BIT11_MASK           8
    #define DBGTBH_BIT12_MASK           16
    #define DBGTBH_BIT13_MASK           32
    #define DBGTBH_BIT14_MASK           64
    #define DBGTBH_BIT15_MASK           128


     DBGTBL - Debug Trace Buffer Register Low; 0x00000025 
    union {
      byte Byte;
      struct {
        byte BIT0        1;                                        Debug Trace Buffer Bit 0 
        byte BIT1        1;                                        Debug Trace Buffer Bit 1 
        byte BIT2        1;                                        Debug Trace Buffer Bit 2 
        byte BIT3        1;                                        Debug Trace Buffer Bit 3 
        byte BIT4        1;                                        Debug Trace Buffer Bit 4 
        byte BIT5        1;                                        Debug Trace Buffer Bit 5 
        byte BIT6        1;                                        Debug Trace Buffer Bit 6 
        byte BIT7        1;                                        Debug Trace Buffer Bit 7 
      } Bits;
    } DBGTBLSTR;
    #define DBGTBL                      _DBGTB.Overlap_STR.DBGTBLSTR.Byte
    #define DBGTBL_BIT0                 _DBGTB.Overlap_STR.DBGTBLSTR.Bits.BIT0
    #define DBGTBL_BIT1                 _DBGTB.Overlap_STR.DBGTBLSTR.Bits.BIT1
    #define DBGTBL_BIT2                 _DBGTB.Overlap_STR.DBGTBLSTR.Bits.BIT2
    #define DBGTBL_BIT3                 _DBGTB.Overlap_STR.DBGTBLSTR.Bits.BIT3
    #define DBGTBL_BIT4                 _DBGTB.Overlap_STR.DBGTBLSTR.Bits.BIT4
    #define DBGTBL_BIT5                 _DBGTB.Overlap_STR.DBGTBLSTR.Bits.BIT5
    #define DBGTBL_BIT6                 _DBGTB.Overlap_STR.DBGTBLSTR.Bits.BIT6
    #define DBGTBL_BIT7                 _DBGTB.Overlap_STR.DBGTBLSTR.Bits.BIT7
    
    
    #define DBGTBL_BIT0_MASK            1
    #define DBGTBL_BIT1_MASK            2
    #define DBGTBL_BIT2_MASK            4
    #define DBGTBL_BIT3_MASK            8
    #define DBGTBL_BIT4_MASK            16
    #define DBGTBL_BIT5_MASK            32
    #define DBGTBL_BIT6_MASK            64
    #define DBGTBL_BIT7_MASK            128

  } Overlap_STR;

  struct {
    word BIT0        1;                                        Debug Trace Buffer Bit 0 
    word BIT1        1;                                        Debug Trace Buffer Bit 1 
    word BIT2        1;                                        Debug Trace Buffer Bit 2 
    word BIT3        1;                                        Debug Trace Buffer Bit 3 
    word BIT4        1;                                        Debug Trace Buffer Bit 4 
    word BIT5        1;                                        Debug Trace Buffer Bit 5 
    word BIT6        1;                                        Debug Trace Buffer Bit 6 
    word BIT7        1;                                        Debug Trace Buffer Bit 7 
    word BIT8        1;                                        Debug Trace Buffer Bit 8 
    word BIT9        1;                                        Debug Trace Buffer Bit 9 
    word BIT10       1;                                        Debug Trace Buffer Bit 10 
    word BIT11       1;                                        Debug Trace Buffer Bit 11 
    word BIT12       1;                                        Debug Trace Buffer Bit 12 
    word BIT13       1;                                        Debug Trace Buffer Bit 13 
    word BIT14       1;                                        Debug Trace Buffer Bit 14 
    word BIT15       1;                                        Debug Trace Buffer Bit 15 
  } Bits;
} DBGTBSTR;
extern volatile DBGTBSTR _DBGTB @(REG_BASE + 0x00000024);
#define DBGTB                           _DBGTB.Word
#define DBGTB_BIT0                      _DBGTB.Bits.BIT0
#define DBGTB_BIT1                      _DBGTB.Bits.BIT1
#define DBGTB_BIT2                      _DBGTB.Bits.BIT2
#define DBGTB_BIT3                      _DBGTB.Bits.BIT3
#define DBGTB_BIT4                      _DBGTB.Bits.BIT4
#define DBGTB_BIT5                      _DBGTB.Bits.BIT5
#define DBGTB_BIT6                      _DBGTB.Bits.BIT6
#define DBGTB_BIT7                      _DBGTB.Bits.BIT7
#define DBGTB_BIT8                      _DBGTB.Bits.BIT8
#define DBGTB_BIT9                      _DBGTB.Bits.BIT9
#define DBGTB_BIT10                     _DBGTB.Bits.BIT10
#define DBGTB_BIT11                     _DBGTB.Bits.BIT11
#define DBGTB_BIT12                     _DBGTB.Bits.BIT12
#define DBGTB_BIT13                     _DBGTB.Bits.BIT13
#define DBGTB_BIT14                     _DBGTB.Bits.BIT14
#define DBGTB_BIT15                     _DBGTB.Bits.BIT15

