gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
#define DBGTB_BIT0_MASK                 1
#define DBGTB_BIT1_MASK                 2
#define DBGTB_BIT2_MASK                 4
#define DBGTB_BIT3_MASK                 8
#define DBGTB_BIT4_MASK                 16
#define DBGTB_BIT5_MASK                 32
#define DBGTB_BIT6_MASK                 64
#define DBGTB_BIT7_MASK                 128
#define DBGTB_BIT8_MASK                 256
#define DBGTB_BIT9_MASK                 512
#define DBGTB_BIT10_MASK                1024
#define DBGTB_BIT11_MASK                2048
#define DBGTB_BIT12_MASK                4096
#define DBGTB_BIT13_MASK                8192
#define DBGTB_BIT14_MASK                16384
#define DBGTB_BIT15_MASK                32768


 DBGCNT - Debug Count Register; 0x00000026 
typedef union {
  byte Byte;
  struct {
    byte CNT         7;                                        Count value 
    byte             1; 
  } Bits;
} DBGCNTSTR;
extern volatile DBGCNTSTR _DBGCNT @(REG_BASE + 0x00000026);
#define DBGCNT                          _DBGCNT.Byte
#define DBGCNT_CNT                      _DBGCNT.Bits.CNT

#define DBGCNT_CNT_MASK                 127
#define DBGCNT_CNT_BITNUM               0


 DBGSCRX - Debug State Control Register 0; 0x00000027 
typedef union {
  byte Byte;
  struct {
    byte SC0         1;                                        These bit (0) select the targeted next state whilst in StateX, based upon the match event 
    byte SC1         1;                                        These bit (1) select the targeted next state whilst in StateX, based upon the match event 
    byte SC2         1;                                        These bit (2) select the targeted next state whilst in StateX, based upon the match event 
    byte SC3         1;                                        These bit (3) select the targeted next state whilst in StateX, based upon the match event 
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
  } Bits;
  struct {
    byte grpSC   4;
    byte         1;
    byte         1;
    byte         1;
    byte         1;
  } MergedBits;
} DBGSCRXSTR;
extern volatile DBGSCRXSTR _DBGSCRX @(REG_BASE + 0x00000027);
#define DBGSCRX                         _DBGSCRX.Byte
#define DBGSCRX_SC0                     _DBGSCRX.Bits.SC0
#define DBGSCRX_SC1                     _DBGSCRX.Bits.SC1
#define DBGSCRX_SC2                     _DBGSCRX.Bits.SC2
#define DBGSCRX_SC3                     _DBGSCRX.Bits.SC3
#define DBGSCRX_SC                      _DBGSCRX.MergedBits.grpSC

#define DBGSCRX_SC0_MASK                1
#define DBGSCRX_SC1_MASK                2
#define DBGSCRX_SC2_MASK                4
#define DBGSCRX_SC3_MASK                8
#define DBGSCRX_SC_MASK                 15
#define DBGSCRX_SC_BITNUM               0


 DBGXCTL - Debug Comparator Control Register; 0x00000028 
typedef union {
  byte Byte;
  struct {
    byte COMPE       1;                                        Determines if comparator is enabled 
    byte SRC         1;                                        Determines mapping of comparator to S12X_CPU or XGATE 
    byte RWE         1;                                        ReadWrite Enable Bit 
    byte RW          1;                                        ReadWrite Comparator Value Bit 
    byte             1; 
    byte TAG         1;                                        Tag select 
    byte NDB_SZ      1;                                        Not Data Bus Compare (for comparators A and C), Size Comparator Value Bit (for comparators B and D) 
    byte SZE         1;                                        Size Comparator Enable Bit (for comparators B and D) 
  } Bits;
} DBGXCTLSTR;
extern volatile DBGXCTLSTR _DBGXCTL @(REG_BASE + 0x00000028);
#define DBGXCTL                         _DBGXCTL.Byte
#define DBGXCTL_COMPE                   _DBGXCTL.Bits.COMPE
#define DBGXCTL_SRC                     _DBGXCTL.Bits.SRC
#define DBGXCTL_RWE                     _DBGXCTL.Bits.RWE
#define DBGXCTL_RW                      _DBGXCTL.Bits.RW
#define DBGXCTL_TAG                     _DBGXCTL.Bits.TAG
#define DBGXCTL_NDB_SZ                  _DBGXCTL.Bits.NDB_SZ
#define DBGXCTL_SZE                     _DBGXCTL.Bits.SZE

#define DBGXCTL_COMPE_MASK              1
#define DBGXCTL_SRC_MASK                2
#define DBGXCTL_RWE_MASK                4
#define DBGXCTL_RW_MASK                 8
#define DBGXCTL_TAG_MASK                32
#define DBGXCTL_NDB_SZ_MASK             64
#define DBGXCTL_SZE_MASK                128


 DBGXAH - Debug Comparator Address High Register; 0x00000029 
typedef union {
  byte Byte;
  struct {
    byte BIT16       1;                                        Comparator Address High Compare Bit 16 
    byte BIT17       1;                                        Comparator Address High Compare Bit 17 
    byte BIT18       1;                                        Comparator Address High Compare Bit 18 
    byte BIT19       1;                                        Comparator Address High Compare Bit 19 
    byte BIT20       1;                                        Comparator Address High Compare Bit 20 
    byte BIT21       1;                                        Comparator Address High Compare Bit 21 
    byte BIT22       1;                                        Comparator Address High Compare Bit 22 
    byte             1; 
  } Bits;
  struct {
    byte grpBIT_16 7;
    byte         1;
  } MergedBits;
} DBGXAHSTR;
extern volatile DBGXAHSTR _DBGXAH @(REG_BASE + 0x00000029);
#define DBGXAH                          _DBGXAH.Byte
#define DBGXAH_BIT16                    _DBGXAH.Bits.BIT16
#define DBGXAH_BIT17                    _DBGXAH.Bits.BIT17
#define DBGXAH_BIT18                    _DBGXAH.Bits.BIT18
#define DBGXAH_BIT19                    _DBGXAH.Bits.BIT19
#define DBGXAH_BIT20                    _DBGXAH.Bits.BIT20
#define DBGXAH_BIT21                    _DBGXAH.Bits.BIT21
#define DBGXAH_BIT22                    _DBGXAH.Bits.BIT22
#define DBGXAH_BIT_16                   _DBGXAH.MergedBits.grpBIT_16
#define DBGXAH_BIT                      DBGXAH_BIT_16

