gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
#define DBGXAH_BIT16_MASK               1
#define DBGXAH_BIT17_MASK               2
#define DBGXAH_BIT18_MASK               4
#define DBGXAH_BIT19_MASK               8
#define DBGXAH_BIT20_MASK               16
#define DBGXAH_BIT21_MASK               32
#define DBGXAH_BIT22_MASK               64
#define DBGXAH_BIT_16_MASK              127
#define DBGXAH_BIT_16_BITNUM            0


 DBGXAM - Debug Comparator Address Mid Register; 0x0000002A 
typedef union {
  byte Byte;
  struct {
    byte BIT8        1;                                        Comparator Address Mid Compare Bit 8 
    byte BIT9        1;                                        Comparator Address Mid Compare Bit 9 
    byte BIT10       1;                                        Comparator Address Mid Compare Bit 10 
    byte BIT11       1;                                        Comparator Address Mid Compare Bit 11 
    byte BIT12       1;                                        Comparator Address Mid Compare Bit 12 
    byte BIT13       1;                                        Comparator Address Mid Compare Bit 13 
    byte BIT14       1;                                        Comparator Address Mid Compare Bit 14 
    byte BIT15       1;                                        Comparator Address Mid Compare Bit 15 
  } Bits;
} DBGXAMSTR;
extern volatile DBGXAMSTR _DBGXAM @(REG_BASE + 0x0000002A);
#define DBGXAM                          _DBGXAM.Byte
#define DBGXAM_BIT8                     _DBGXAM.Bits.BIT8
#define DBGXAM_BIT9                     _DBGXAM.Bits.BIT9
#define DBGXAM_BIT10                    _DBGXAM.Bits.BIT10
#define DBGXAM_BIT11                    _DBGXAM.Bits.BIT11
#define DBGXAM_BIT12                    _DBGXAM.Bits.BIT12
#define DBGXAM_BIT13                    _DBGXAM.Bits.BIT13
#define DBGXAM_BIT14                    _DBGXAM.Bits.BIT14
#define DBGXAM_BIT15                    _DBGXAM.Bits.BIT15

#define DBGXAM_BIT8_MASK                1
#define DBGXAM_BIT9_MASK                2
#define DBGXAM_BIT10_MASK               4
#define DBGXAM_BIT11_MASK               8
#define DBGXAM_BIT12_MASK               16
#define DBGXAM_BIT13_MASK               32
#define DBGXAM_BIT14_MASK               64
#define DBGXAM_BIT15_MASK               128


 DBGXAL - Debug Comparator Address Low Register; 0x0000002B 
typedef union {
  byte Byte;
  struct {
    byte BIT0        1;                                        Comparator Address Low Compare Bit 0 
    byte BIT1        1;                                        Comparator Address Low Compare Bit 1 
    byte BIT2        1;                                        Comparator Address Low Compare Bit 2 
    byte BIT3        1;                                        Comparator Address Low Compare Bit 3 
    byte BIT4        1;                                        Comparator Address Low Compare Bit 4 
    byte BIT5        1;                                        Comparator Address Low Compare Bit 5 
    byte BIT6        1;                                        Comparator Address Low Compare Bit 6 
    byte BIT7        1;                                        Comparator Address Low Compare Bit 7 
  } Bits;
} DBGXALSTR;
extern volatile DBGXALSTR _DBGXAL @(REG_BASE + 0x0000002B);
#define DBGXAL                          _DBGXAL.Byte
#define DBGXAL_BIT0                     _DBGXAL.Bits.BIT0
#define DBGXAL_BIT1                     _DBGXAL.Bits.BIT1
#define DBGXAL_BIT2                     _DBGXAL.Bits.BIT2
#define DBGXAL_BIT3                     _DBGXAL.Bits.BIT3
#define DBGXAL_BIT4                     _DBGXAL.Bits.BIT4
#define DBGXAL_BIT5                     _DBGXAL.Bits.BIT5
#define DBGXAL_BIT6                     _DBGXAL.Bits.BIT6
#define DBGXAL_BIT7                     _DBGXAL.Bits.BIT7

#define DBGXAL_BIT0_MASK                1
#define DBGXAL_BIT1_MASK                2
#define DBGXAL_BIT2_MASK                4
#define DBGXAL_BIT3_MASK                8
#define DBGXAL_BIT4_MASK                16
#define DBGXAL_BIT5_MASK                32
#define DBGXAL_BIT6_MASK                64
#define DBGXAL_BIT7_MASK                128


 DBGXDH - Debug Comparator Data High Register; 0x0000002C 
typedef union {
  byte Byte;
  struct {
    byte BIT0        1;                                        Comparator A Compare Bit 0 
    byte BIT1        1;                                        Comparator A Compare Bit 1 
    byte BIT2        1;                                        Comparator A Compare Bit 2 
    byte BIT3        1;                                        Comparator A Compare Bit 3 
    byte BIT4        1;                                        Comparator A Compare Bit 4 
    byte BIT5        1;                                        Comparator A Compare Bit 5 
    byte BIT6        1;                                        Comparator A Compare Bit 6 
    byte BIT7        1;                                        Comparator A Compare Bit 7 
  } Bits;
} DBGXDHSTR;
extern volatile DBGXDHSTR _DBGXDH @(REG_BASE + 0x0000002C);
#define DBGXDH                          _DBGXDH.Byte
#define DBGXDH_BIT0                     _DBGXDH.Bits.BIT0
#define DBGXDH_BIT1                     _DBGXDH.Bits.BIT1
#define DBGXDH_BIT2                     _DBGXDH.Bits.BIT2
#define DBGXDH_BIT3                     _DBGXDH.Bits.BIT3
#define DBGXDH_BIT4                     _DBGXDH.Bits.BIT4
#define DBGXDH_BIT5                     _DBGXDH.Bits.BIT5
#define DBGXDH_BIT6                     _DBGXDH.Bits.BIT6
#define DBGXDH_BIT7                     _DBGXDH.Bits.BIT7

#define DBGXDH_BIT0_MASK                1
#define DBGXDH_BIT1_MASK                2
#define DBGXDH_BIT2_MASK                4
#define DBGXDH_BIT3_MASK                8
#define DBGXDH_BIT4_MASK                16
#define DBGXDH_BIT5_MASK                32
#define DBGXDH_BIT6_MASK                64
#define DBGXDH_BIT7_MASK                128


 DBGXDL - Debug Comparator Data Low Register; 0x0000002D 
typedef union {
  byte Byte;
  struct {
    byte BIT0        1;                                        Comparator Address Low Compare Bit 0 
    byte BIT1        1;                                        Comparator Address Low Compare Bit 1 
    byte BIT2        1;                                        Comparator Address Low Compare Bit 2 
    byte BIT3        1;                                        Comparator Address Low Compare Bit 3 
    byte BIT4        1;                                        Comparator Address Low Compare Bit 4 
    byte BIT5        1;                                        Comparator Address Low Compare Bit 5 
    byte BIT6        1;                                        Comparator Address Low Compare Bit 6 
    byte BIT7        1;                                        Comparator Address Low Compare Bit 7 
  } Bits;
} DBGXDLSTR;
extern volatile DBGXDLSTR _DBGXDL @(REG_BASE + 0x0000002D);
#define DBGXDL                          _DBGXDL.Byte
#define DBGXDL_BIT0                     _DBGXDL.Bits.BIT0
#define DBGXDL_BIT1                     _DBGXDL.Bits.BIT1
#define DBGXDL_BIT2                     _DBGXDL.Bits.BIT2
#define DBGXDL_BIT3                     _DBGXDL.Bits.BIT3
#define DBGXDL_BIT4                     _DBGXDL.Bits.BIT4
#define DBGXDL_BIT5                     _DBGXDL.Bits.BIT5
#define DBGXDL_BIT6                     _DBGXDL.Bits.BIT6
#define DBGXDL_BIT7                     _DBGXDL.Bits.BIT7

