gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
#define DBGXDL_BIT0_MASK                1
#define DBGXDL_BIT1_MASK                2
#define DBGXDL_BIT2_MASK                4
#define DBGXDL_BIT3_MASK                8
#define DBGXDL_BIT4_MASK                16
#define DBGXDL_BIT5_MASK                32
#define DBGXDL_BIT6_MASK                64
#define DBGXDL_BIT7_MASK                128


 DBGXDHM - Debug Comparator Data High Mask Register; 0x0000002E 
typedef union {
  byte Byte;
  struct {
    byte BIT8        1;                                        Comparator Data High Mask Bit 8 
    byte BIT9        1;                                        Comparator Data High Mask Bit 9 
    byte BIT10       1;                                        Comparator Data High Mask Bit 10 
    byte BIT11       1;                                        Comparator Data High Mask Bit 11 
    byte BIT12       1;                                        Comparator Data High Mask Bit 12 
    byte BIT13       1;                                        Comparator Data High Mask Bit 13 
    byte BIT14       1;                                        Comparator Data High Mask Bit 14 
    byte BIT15       1;                                        Comparator Data High Mask Bit 15 
  } Bits;
} DBGXDHMSTR;
extern volatile DBGXDHMSTR _DBGXDHM @(REG_BASE + 0x0000002E);
#define DBGXDHM                         _DBGXDHM.Byte
#define DBGXDHM_BIT8                    _DBGXDHM.Bits.BIT8
#define DBGXDHM_BIT9                    _DBGXDHM.Bits.BIT9
#define DBGXDHM_BIT10                   _DBGXDHM.Bits.BIT10
#define DBGXDHM_BIT11                   _DBGXDHM.Bits.BIT11
#define DBGXDHM_BIT12                   _DBGXDHM.Bits.BIT12
#define DBGXDHM_BIT13                   _DBGXDHM.Bits.BIT13
#define DBGXDHM_BIT14                   _DBGXDHM.Bits.BIT14
#define DBGXDHM_BIT15                   _DBGXDHM.Bits.BIT15

#define DBGXDHM_BIT8_MASK               1
#define DBGXDHM_BIT9_MASK               2
#define DBGXDHM_BIT10_MASK              4
#define DBGXDHM_BIT11_MASK              8
#define DBGXDHM_BIT12_MASK              16
#define DBGXDHM_BIT13_MASK              32
#define DBGXDHM_BIT14_MASK              64
#define DBGXDHM_BIT15_MASK              128


 DBGXDLM - Debug Comparator Data Low Mask Register; 0x0000002F 
typedef union {
  byte Byte;
  struct {
    byte BIT0        1;                                        Comparator Data High Mask Bit 0 
    byte BIT1        1;                                        Comparator Data High Mask Bit 1 
    byte BIT2        1;                                        Comparator Data High Mask Bit 2 
    byte BIT3        1;                                        Comparator Data High Mask Bit 3 
    byte BIT4        1;                                        Comparator Data High Mask Bit 4 
    byte BIT5        1;                                        Comparator Data High Mask Bit 5 
    byte BIT6        1;                                        Comparator Data High Mask Bit 6 
    byte BIT7        1;                                        Comparator Data High Mask Bit 7 
  } Bits;
} DBGXDLMSTR;
extern volatile DBGXDLMSTR _DBGXDLM @(REG_BASE + 0x0000002F);
#define DBGXDLM                         _DBGXDLM.Byte
#define DBGXDLM_BIT0                    _DBGXDLM.Bits.BIT0
#define DBGXDLM_BIT1                    _DBGXDLM.Bits.BIT1
#define DBGXDLM_BIT2                    _DBGXDLM.Bits.BIT2
#define DBGXDLM_BIT3                    _DBGXDLM.Bits.BIT3
#define DBGXDLM_BIT4                    _DBGXDLM.Bits.BIT4
#define DBGXDLM_BIT5                    _DBGXDLM.Bits.BIT5
#define DBGXDLM_BIT6                    _DBGXDLM.Bits.BIT6
#define DBGXDLM_BIT7                    _DBGXDLM.Bits.BIT7

#define DBGXDLM_BIT0_MASK               1
#define DBGXDLM_BIT1_MASK               2
#define DBGXDLM_BIT2_MASK               4
#define DBGXDLM_BIT3_MASK               8
#define DBGXDLM_BIT4_MASK               16
#define DBGXDLM_BIT5_MASK               32
#define DBGXDLM_BIT6_MASK               64
#define DBGXDLM_BIT7_MASK               128


 PPAGE - Program Page Index Register; 0x00000030 
typedef union {
  byte Byte;
  struct {
    byte PIX0        1;                                        Program Page Index Bit 0 
    byte PIX1        1;                                        Program Page Index Bit 1 
    byte PIX2        1;                                        Program Page Index Bit 2 
    byte PIX3        1;                                        Program Page Index Bit 3 
    byte PIX4        1;                                        Program Page Index Bit 4 
    byte PIX5        1;                                        Program Page Index Bit 5 
    byte PIX6        1;                                        Program Page Index Bit 6 
    byte PIX7        1;                                        Program Page Index Bit 7 
  } Bits;
} PPAGESTR;
extern volatile PPAGESTR _PPAGE @(REG_BASE + 0x00000030);
#define PPAGE                           _PPAGE.Byte
#define PPAGE_PIX0                      _PPAGE.Bits.PIX0
#define PPAGE_PIX1                      _PPAGE.Bits.PIX1
#define PPAGE_PIX2                      _PPAGE.Bits.PIX2
#define PPAGE_PIX3                      _PPAGE.Bits.PIX3
#define PPAGE_PIX4                      _PPAGE.Bits.PIX4
#define PPAGE_PIX5                      _PPAGE.Bits.PIX5
#define PPAGE_PIX6                      _PPAGE.Bits.PIX6
#define PPAGE_PIX7                      _PPAGE.Bits.PIX7

#define PPAGE_PIX0_MASK                 1
#define PPAGE_PIX1_MASK                 2
#define PPAGE_PIX2_MASK                 4
#define PPAGE_PIX3_MASK                 8
#define PPAGE_PIX4_MASK                 16
#define PPAGE_PIX5_MASK                 32
#define PPAGE_PIX6_MASK                 64
#define PPAGE_PIX7_MASK                 128


 PORTK - Port K Data Register; 0x00000032 
typedef union {
  byte Byte;
  struct {
    byte PK0         1;                                        Port K Bit 0 
    byte PK1         1;                                        Port K Bit 1 
    byte PK2         1;                                        Port K Bit 2 
    byte PK3         1;                                        Port K Bit 3 
    byte PK4         1;                                        Port K Bit 4 
    byte PK5         1;                                        Port K Bit 5 
    byte PK6         1;                                        Port K Bit 6 
    byte PK7         1;                                        Port K Bit 7 
  } Bits;
} PORTKSTR;
extern volatile PORTKSTR _PORTK @(REG_BASE + 0x00000032);
#define PORTK                           _PORTK.Byte
#define PORTK_PK0                       _PORTK.Bits.PK0
#define PORTK_PK1                       _PORTK.Bits.PK1
#define PORTK_PK2                       _PORTK.Bits.PK2
#define PORTK_PK3                       _PORTK.Bits.PK3
#define PORTK_PK4                       _PORTK.Bits.PK4
#define PORTK_PK5                       _PORTK.Bits.PK5
#define PORTK_PK6                       _PORTK.Bits.PK6
#define PORTK_PK7                       _PORTK.Bits.PK7

#define PORTK_PK0_MASK                  1
#define PORTK_PK1_MASK                  2
#define PORTK_PK2_MASK                  4
#define PORTK_PK3_MASK                  8
#define PORTK_PK4_MASK                  16
#define PORTK_PK5_MASK                  32
#define PORTK_PK6_MASK                  64
#define PORTK_PK7_MASK                  128


 DDRK - Port K Data Direction Register; 0x00000033 
typedef union {
  byte Byte;
  struct {
    byte DDRK0       1;                                        Port K Data Direction Bit 0 
    byte DDRK1       1;                                        Port K Data Direction Bit 1 
    byte DDRK2       1;                                        Port K Data Direction Bit 2 
    byte DDRK3       1;                                        Port K Data Direction Bit 3 
    byte DDRK4       1;                                        Port K Data Direction Bit 4 
    byte DDRK5       1;                                        Port K Data Direction Bit 5 
    byte DDRK6       1;                                        Port K Data Direction Bit 6 
    byte DDRK7       1;                                        Port K Data Direction Bit 7 
  } Bits;
} DDRKSTR;
extern volatile DDRKSTR _DDRK @(REG_BASE + 0x00000033);
#define DDRK                            _DDRK.Byte
#define DDRK_DDRK0                      _DDRK.Bits.DDRK0
#define DDRK_DDRK1                      _DDRK.Bits.DDRK1
#define DDRK_DDRK2                      _DDRK.Bits.DDRK2
#define DDRK_DDRK3                      _DDRK.Bits.DDRK3
#define DDRK_DDRK4                      _DDRK.Bits.DDRK4
#define DDRK_DDRK5                      _DDRK.Bits.DDRK5
#define DDRK_DDRK6                      _DDRK.Bits.DDRK6
#define DDRK_DDRK7                      _DDRK.Bits.DDRK7

#define DDRK_DDRK0_MASK                 1
#define DDRK_DDRK1_MASK                 2
#define DDRK_DDRK2_MASK                 4
#define DDRK_DDRK3_MASK                 8
#define DDRK_DDRK4_MASK                 16
#define DDRK_DDRK5_MASK                 32
#define DDRK_DDRK6_MASK                 64
#define DDRK_DDRK7_MASK                 128


 SYNR - CRG Synthesizer Register; 0x00000034 
typedef union {
  byte Byte;
  struct {
    byte SYN0        1;                                        CRG Synthesizer Bit 0 
    byte SYN1        1;                                        CRG Synthesizer Bit 1 
    byte SYN2        1;                                        CRG Synthesizer Bit 2 
    byte SYN3        1;                                        CRG Synthesizer Bit 3 
    byte SYN4        1;                                        CRG Synthesizer Bit 4 
    byte SYN5        1;                                        CRG Synthesizer Bit 5 
    byte             1; 
    byte             1; 
  } Bits;
  struct {
    byte grpSYN  6;
    byte         1;
    byte         1;
  } MergedBits;
} SYNRSTR;
