gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
extern volatile SYNRSTR _SYNR @(REG_BASE + 0x00000034);
#define SYNR                            _SYNR.Byte
#define SYNR_SYN0                       _SYNR.Bits.SYN0
#define SYNR_SYN1                       _SYNR.Bits.SYN1
#define SYNR_SYN2                       _SYNR.Bits.SYN2
#define SYNR_SYN3                       _SYNR.Bits.SYN3
#define SYNR_SYN4                       _SYNR.Bits.SYN4
#define SYNR_SYN5                       _SYNR.Bits.SYN5
#define SYNR_SYN                        _SYNR.MergedBits.grpSYN

#define SYNR_SYN0_MASK                  1
#define SYNR_SYN1_MASK                  2
#define SYNR_SYN2_MASK                  4
#define SYNR_SYN3_MASK                  8
#define SYNR_SYN4_MASK                  16
#define SYNR_SYN5_MASK                  32
#define SYNR_SYN_MASK                   63
#define SYNR_SYN_BITNUM                 0


 REFDV - CRG Reference Divider Register; 0x00000035 
typedef union {
  byte Byte;
  struct {
    byte REFDV0      1;                                        CRG Reference Divider Bit 0 
    byte REFDV1      1;                                        CRG Reference Divider Bit 1 
    byte REFDV2      1;                                        CRG Reference Divider Bit 2 
    byte REFDV3      1;                                        CRG Reference Divider Bit 3 
    byte REFDV4      1;                                        CRG Reference Divider Bit 4 
    byte REFDV5      1;                                        CRG Reference Divider Bit 5 
    byte             1; 
    byte             1; 
  } Bits;
  struct {
    byte grpREFDV 6;
    byte         1;
    byte         1;
  } MergedBits;
} REFDVSTR;
extern volatile REFDVSTR _REFDV @(REG_BASE + 0x00000035);
#define REFDV                           _REFDV.Byte
#define REFDV_REFDV0                    _REFDV.Bits.REFDV0
#define REFDV_REFDV1                    _REFDV.Bits.REFDV1
#define REFDV_REFDV2                    _REFDV.Bits.REFDV2
#define REFDV_REFDV3                    _REFDV.Bits.REFDV3
#define REFDV_REFDV4                    _REFDV.Bits.REFDV4
#define REFDV_REFDV5                    _REFDV.Bits.REFDV5
#define REFDV_REFDV                     _REFDV.MergedBits.grpREFDV

#define REFDV_REFDV0_MASK               1
#define REFDV_REFDV1_MASK               2
#define REFDV_REFDV2_MASK               4
#define REFDV_REFDV3_MASK               8
#define REFDV_REFDV4_MASK               16
#define REFDV_REFDV5_MASK               32
#define REFDV_REFDV_MASK                63
#define REFDV_REFDV_BITNUM              0


 CRGFLG - CRG Flags Register; 0x00000037 
typedef union {
  byte Byte;
  struct {
    byte SCM         1;                                        Self-clock mode Status 
    byte SCMIF       1;                                        Self-clock mode Interrupt Flag 
    byte TRACK       1;                                        Track Status 
    byte LOCK        1;                                        Lock Status 
    byte LOCKIF      1;                                        PLL Lock Interrupt Flag 
    byte LVRF        1;                                        Low Voltage Reset Flag 
    byte PORF        1;                                        Power on Reset Flag 
    byte RTIF        1;                                        Real Time Interrupt Flag 
  } Bits;
} CRGFLGSTR;
extern volatile CRGFLGSTR _CRGFLG @(REG_BASE + 0x00000037);
#define CRGFLG                          _CRGFLG.Byte
#define CRGFLG_SCM                      _CRGFLG.Bits.SCM
#define CRGFLG_SCMIF                    _CRGFLG.Bits.SCMIF
#define CRGFLG_TRACK                    _CRGFLG.Bits.TRACK
#define CRGFLG_LOCK                     _CRGFLG.Bits.LOCK
#define CRGFLG_LOCKIF                   _CRGFLG.Bits.LOCKIF
#define CRGFLG_LVRF                     _CRGFLG.Bits.LVRF
#define CRGFLG_PORF                     _CRGFLG.Bits.PORF
#define CRGFLG_RTIF                     _CRGFLG.Bits.RTIF

#define CRGFLG_SCM_MASK                 1
#define CRGFLG_SCMIF_MASK               2
#define CRGFLG_TRACK_MASK               4
#define CRGFLG_LOCK_MASK                8
#define CRGFLG_LOCKIF_MASK              16
#define CRGFLG_LVRF_MASK                32
#define CRGFLG_PORF_MASK                64
#define CRGFLG_RTIF_MASK                128


 CRGINT - CRG Interrupt Enable Register; 0x00000038 
typedef union {
  byte Byte;
  struct {
    byte             1; 
    byte SCMIE       1;                                        Self-clock mode Interrupt Enable 
    byte             1; 
    byte             1; 
    byte LOCKIE      1;                                        Lock Interrupt Enable 
    byte             1; 
    byte ILAF        1;                                        Illegal Address Reset Flag 
    byte RTIE        1;                                        Real Time Interrupt Enable 
  } Bits;
} CRGINTSTR;
extern volatile CRGINTSTR _CRGINT @(REG_BASE + 0x00000038);
#define CRGINT                          _CRGINT.Byte
#define CRGINT_SCMIE                    _CRGINT.Bits.SCMIE
#define CRGINT_LOCKIE                   _CRGINT.Bits.LOCKIE
#define CRGINT_ILAF                     _CRGINT.Bits.ILAF
#define CRGINT_RTIE                     _CRGINT.Bits.RTIE

#define CRGINT_SCMIE_MASK               2
#define CRGINT_LOCKIE_MASK              16
#define CRGINT_ILAF_MASK                64
#define CRGINT_RTIE_MASK                128


 CLKSEL - CRG Clock Select Register; 0x00000039 
typedef union {
  byte Byte;
  struct {
    byte COPWAI      1;                                        COP stops in WAIT mode 
    byte RTIWAI      1;                                        RTI stops in WAIT mode 
    byte             1; 
    byte PLLWAI      1;                                        PLL stops in WAIT mode 
    byte             1; 
    byte             1; 
    byte PSTP        1;                                        Pseudo Stop 
    byte PLLSEL      1;                                        PLL selected for system clock 
  } Bits;
} CLKSELSTR;
extern volatile CLKSELSTR _CLKSEL @(REG_BASE + 0x00000039);
#define CLKSEL                          _CLKSEL.Byte
#define CLKSEL_COPWAI                   _CLKSEL.Bits.COPWAI
#define CLKSEL_RTIWAI                   _CLKSEL.Bits.RTIWAI
#define CLKSEL_PLLWAI                   _CLKSEL.Bits.PLLWAI
#define CLKSEL_PSTP                     _CLKSEL.Bits.PSTP
#define CLKSEL_PLLSEL                   _CLKSEL.Bits.PLLSEL

#define CLKSEL_COPWAI_MASK              1
#define CLKSEL_RTIWAI_MASK              2
#define CLKSEL_PLLWAI_MASK              8
#define CLKSEL_PSTP_MASK                64
#define CLKSEL_PLLSEL_MASK              128


