gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
 PLLCTL - CRG PLL Control Register; 0x0000003A 
typedef union {
  byte Byte;
  struct {
    byte SCME        1;                                        Self-clock mode enable 
    byte PCE         1;                                        COP Enable during Pseudo Stop Bit 
    byte PRE         1;                                        RTI Enable during Pseudo Stop Bit 
    byte FSTWKP      1;                                        Fast Wake-up from Full Stop Bit 
    byte ACQ         1;                                        Acquisition 
    byte AUTO        1;                                        Automatic Bandwidth Control 
    byte PLLON       1;                                        Phase Lock Loop On 
    byte CME         1;                                        Clock Monitor Enable 
  } Bits;
} PLLCTLSTR;
extern volatile PLLCTLSTR _PLLCTL @(REG_BASE + 0x0000003A);
#define PLLCTL                          _PLLCTL.Byte
#define PLLCTL_SCME                     _PLLCTL.Bits.SCME
#define PLLCTL_PCE                      _PLLCTL.Bits.PCE
#define PLLCTL_PRE                      _PLLCTL.Bits.PRE
#define PLLCTL_FSTWKP                   _PLLCTL.Bits.FSTWKP
#define PLLCTL_ACQ                      _PLLCTL.Bits.ACQ
#define PLLCTL_AUTO                     _PLLCTL.Bits.AUTO
#define PLLCTL_PLLON                    _PLLCTL.Bits.PLLON
#define PLLCTL_CME                      _PLLCTL.Bits.CME

#define PLLCTL_SCME_MASK                1
#define PLLCTL_PCE_MASK                 2
#define PLLCTL_PRE_MASK                 4
#define PLLCTL_FSTWKP_MASK              8
#define PLLCTL_ACQ_MASK                 16
#define PLLCTL_AUTO_MASK                32
#define PLLCTL_PLLON_MASK               64
#define PLLCTL_CME_MASK                 128


 RTICTL - CRG RTI Control Register; 0x0000003B 
typedef union {
  byte Byte;
  struct {
    byte RTR0        1;                                        Real Time Interrupt Modulus Counter Select Bit 0 
    byte RTR1        1;                                        Real Time Interrupt Modulus Counter Select Bit 1 
    byte RTR2        1;                                        Real Time Interrupt Modulus Counter Select Bit 2 
    byte RTR3        1;                                        Real Time Interrupt Modulus Counter Select Bit 3 
    byte RTR4        1;                                        Real Time Interrupt Prescale Rate Select Bit 4 
    byte RTR5        1;                                        Real Time Interrupt Prescale Rate Select Bit 5 
    byte RTR6        1;                                        Real Time Interrupt Prescale Rate Select Bit 6 
    byte RTDEC       1;                                        Decimal or Binary Divider Select Bit 
  } Bits;
  struct {
    byte grpRTR  7;
    byte         1;
  } MergedBits;
} RTICTLSTR;
extern volatile RTICTLSTR _RTICTL @(REG_BASE + 0x0000003B);
#define RTICTL                          _RTICTL.Byte
#define RTICTL_RTR0                     _RTICTL.Bits.RTR0
#define RTICTL_RTR1                     _RTICTL.Bits.RTR1
#define RTICTL_RTR2                     _RTICTL.Bits.RTR2
#define RTICTL_RTR3                     _RTICTL.Bits.RTR3
#define RTICTL_RTR4                     _RTICTL.Bits.RTR4
#define RTICTL_RTR5                     _RTICTL.Bits.RTR5
#define RTICTL_RTR6                     _RTICTL.Bits.RTR6
#define RTICTL_RTDEC                    _RTICTL.Bits.RTDEC
#define RTICTL_RTR                      _RTICTL.MergedBits.grpRTR

#define RTICTL_RTR0_MASK                1
#define RTICTL_RTR1_MASK                2
#define RTICTL_RTR2_MASK                4
#define RTICTL_RTR3_MASK                8
#define RTICTL_RTR4_MASK                16
#define RTICTL_RTR5_MASK                32
#define RTICTL_RTR6_MASK                64
#define RTICTL_RTDEC_MASK               128
#define RTICTL_RTR_MASK                 127
#define RTICTL_RTR_BITNUM               0


 COPCTL - CRG COP Control Register; 0x0000003C 
typedef union {
  byte Byte;
  struct {
    byte CR0         1;                                        COP Watchdog Timer Rate select Bit 0 
    byte CR1         1;                                        COP Watchdog Timer Rate select Bit 1 
    byte CR2         1;                                        COP Watchdog Timer Rate select Bit 2 
    byte             1; 
    byte             1; 
    byte             1; 
    byte RSBCK       1;                                        COP and RTI stop in Active BDM mode Bit 
    byte WCOP        1;                                        Window COP mode 
  } Bits;
  struct {
    byte grpCR   3;
    byte         1;
    byte         1;
    byte         1;
    byte         1;
    byte         1;
  } MergedBits;
} COPCTLSTR;
extern volatile COPCTLSTR _COPCTL @(REG_BASE + 0x0000003C);
#define COPCTL                          _COPCTL.Byte
#define COPCTL_CR0                      _COPCTL.Bits.CR0
#define COPCTL_CR1                      _COPCTL.Bits.CR1
#define COPCTL_CR2                      _COPCTL.Bits.CR2
#define COPCTL_RSBCK                    _COPCTL.Bits.RSBCK
#define COPCTL_WCOP                     _COPCTL.Bits.WCOP
#define COPCTL_CR                       _COPCTL.MergedBits.grpCR

#define COPCTL_CR0_MASK                 1
#define COPCTL_CR1_MASK                 2
#define COPCTL_CR2_MASK                 4
#define COPCTL_RSBCK_MASK               64
#define COPCTL_WCOP_MASK                128
#define COPCTL_CR_MASK                  7
#define COPCTL_CR_BITNUM                0


 ARMCOP - CRG COP Timer ArmReset Register; 0x0000003F 
typedef union {
  byte Byte;
  struct {
    byte BIT0        1;                                        CRG COP Timer ArmReset Bit 0 
    byte BIT1        1;                                        CRG COP Timer ArmReset Bit 1 
    byte BIT2        1;                                        CRG COP Timer ArmReset Bit 2 
    byte BIT3        1;                                        CRG COP Timer ArmReset Bit 3 
    byte BIT4        1;                                        CRG COP Timer ArmReset Bit 4 
    byte BIT5        1;                                        CRG COP Timer ArmReset Bit 5 
    byte BIT6        1;                                        CRG COP Timer ArmReset Bit 6 
    byte BIT7        1;                                        CRG COP Timer ArmReset Bit 7 
  } Bits;
} ARMCOPSTR;
