gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
extern volatile ARMCOPSTR _ARMCOP @(REG_BASE + 0x0000003F);
#define ARMCOP                          _ARMCOP.Byte
#define ARMCOP_BIT0                     _ARMCOP.Bits.BIT0
#define ARMCOP_BIT1                     _ARMCOP.Bits.BIT1
#define ARMCOP_BIT2                     _ARMCOP.Bits.BIT2
#define ARMCOP_BIT3                     _ARMCOP.Bits.BIT3
#define ARMCOP_BIT4                     _ARMCOP.Bits.BIT4
#define ARMCOP_BIT5                     _ARMCOP.Bits.BIT5
#define ARMCOP_BIT6                     _ARMCOP.Bits.BIT6
#define ARMCOP_BIT7                     _ARMCOP.Bits.BIT7

#define ARMCOP_BIT0_MASK                1
#define ARMCOP_BIT1_MASK                2
#define ARMCOP_BIT2_MASK                4
#define ARMCOP_BIT3_MASK                8
#define ARMCOP_BIT4_MASK                16
#define ARMCOP_BIT5_MASK                32
#define ARMCOP_BIT6_MASK                64
#define ARMCOP_BIT7_MASK                128


 TIOS - Timer Input CaptureOutput Compare Select; 0x00000040 
typedef union {
  byte Byte;
  struct {
    byte IOS0        1;                                        Input Capture or Output Compare Channel Configuration Bit 0 
    byte IOS1        1;                                        Input Capture or Output Compare Channel Configuration Bit 1 
    byte IOS2        1;                                        Input Capture or Output Compare Channel Configuration Bit 2 
    byte IOS3        1;                                        Input Capture or Output Compare Channel Configuration Bit 3 
    byte IOS4        1;                                        Input Capture or Output Compare Channel Configuration Bit 4 
    byte IOS5        1;                                        Input Capture or Output Compare Channel Configuration Bit 5 
    byte IOS6        1;                                        Input Capture or Output Compare Channel Configuration Bit 6 
    byte IOS7        1;                                        Input Capture or Output Compare Channel Configuration Bit 7 
  } Bits;
} TIOSSTR;
extern volatile TIOSSTR _TIOS @(REG_BASE + 0x00000040);
#define TIOS                            _TIOS.Byte
#define TIOS_IOS0                       _TIOS.Bits.IOS0
#define TIOS_IOS1                       _TIOS.Bits.IOS1
#define TIOS_IOS2                       _TIOS.Bits.IOS2
#define TIOS_IOS3                       _TIOS.Bits.IOS3
#define TIOS_IOS4                       _TIOS.Bits.IOS4
#define TIOS_IOS5                       _TIOS.Bits.IOS5
#define TIOS_IOS6                       _TIOS.Bits.IOS6
#define TIOS_IOS7                       _TIOS.Bits.IOS7

#define TIOS_IOS0_MASK                  1
#define TIOS_IOS1_MASK                  2
#define TIOS_IOS2_MASK                  4
#define TIOS_IOS3_MASK                  8
#define TIOS_IOS4_MASK                  16
#define TIOS_IOS5_MASK                  32
#define TIOS_IOS6_MASK                  64
#define TIOS_IOS7_MASK                  128


 CFORC - Timer Compare Force Register; 0x00000041 
typedef union {
  byte Byte;
  struct {
    byte FOC0        1;                                        Force Output Compare Action for Channel 0 
    byte FOC1        1;                                        Force Output Compare Action for Channel 1 
    byte FOC2        1;                                        Force Output Compare Action for Channel 2 
    byte FOC3        1;                                        Force Output Compare Action for Channel 3 
    byte FOC4        1;                                        Force Output Compare Action for Channel 4 
    byte FOC5        1;                                        Force Output Compare Action for Channel 5 
    byte FOC6        1;                                        Force Output Compare Action for Channel 6 
    byte FOC7        1;                                        Force Output Compare Action for Channel 7 
  } Bits;
} CFORCSTR;
extern volatile CFORCSTR _CFORC @(REG_BASE + 0x00000041);
#define CFORC                           _CFORC.Byte
#define CFORC_FOC0                      _CFORC.Bits.FOC0
#define CFORC_FOC1                      _CFORC.Bits.FOC1
#define CFORC_FOC2                      _CFORC.Bits.FOC2
#define CFORC_FOC3                      _CFORC.Bits.FOC3
#define CFORC_FOC4                      _CFORC.Bits.FOC4
#define CFORC_FOC5                      _CFORC.Bits.FOC5
#define CFORC_FOC6                      _CFORC.Bits.FOC6
#define CFORC_FOC7                      _CFORC.Bits.FOC7

#define CFORC_FOC0_MASK                 1
#define CFORC_FOC1_MASK                 2
#define CFORC_FOC2_MASK                 4
#define CFORC_FOC3_MASK                 8
#define CFORC_FOC4_MASK                 16
#define CFORC_FOC5_MASK                 32
#define CFORC_FOC6_MASK                 64
#define CFORC_FOC7_MASK                 128


 OC7M - Output Compare 7 Mask Register; 0x00000042 
typedef union {
  byte Byte;
  struct {
    byte OC7M0       1;                                        Output Compare 7 Mask Bit 0 
    byte OC7M1       1;                                        Output Compare 7 Mask Bit 1 
    byte OC7M2       1;                                        Output Compare 7 Mask Bit 2 
    byte OC7M3       1;                                        Output Compare 7 Mask Bit 3 
    byte OC7M4       1;                                        Output Compare 7 Mask Bit 4 
    byte OC7M5       1;                                        Output Compare 7 Mask Bit 5 
    byte OC7M6       1;                                        Output Compare 7 Mask Bit 6 
    byte OC7M7       1;                                        Output Compare 7 Mask Bit 7 
  } Bits;
} OC7MSTR;
extern volatile OC7MSTR _OC7M @(REG_BASE + 0x00000042);
#define OC7M                            _OC7M.Byte
#define OC7M_OC7M0                      _OC7M.Bits.OC7M0
#define OC7M_OC7M1                      _OC7M.Bits.OC7M1
#define OC7M_OC7M2                      _OC7M.Bits.OC7M2
#define OC7M_OC7M3                      _OC7M.Bits.OC7M3
#define OC7M_OC7M4                      _OC7M.Bits.OC7M4
#define OC7M_OC7M5                      _OC7M.Bits.OC7M5
#define OC7M_OC7M6                      _OC7M.Bits.OC7M6
#define OC7M_OC7M7                      _OC7M.Bits.OC7M7

#define OC7M_OC7M0_MASK                 1
#define OC7M_OC7M1_MASK                 2
#define OC7M_OC7M2_MASK                 4
#define OC7M_OC7M3_MASK                 8
#define OC7M_OC7M4_MASK                 16
#define OC7M_OC7M5_MASK                 32
#define OC7M_OC7M6_MASK                 64
#define OC7M_OC7M7_MASK                 128


 OC7D - Output Compare 7 Data Register; 0x00000043 
typedef union {
  byte Byte;
} OC7DSTR;
extern volatile OC7DSTR _OC7D @(REG_BASE + 0x00000043);
#define OC7D                            _OC7D.Byte



 TCNT - Timer Count Register; 0x00000044 
typedef union {
  word Word;
    Overlapped registers 
  struct {
     TCNTHi - Timer Count Register High; 0x00000044 
    union {
      byte Byte;
    } TCNTHiSTR;
    #define TCNTHi                      _TCNT.Overlap_STR.TCNTHiSTR.Byte
    
    


     TCNTLo - Timer Count Register Low; 0x00000045 
    union {
      byte Byte;
    } TCNTLoSTR;
    #define TCNTLo                      _TCNT.Overlap_STR.TCNTLoSTR.Byte
    
    

  } Overlap_STR;

