gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
} TCNTSTR;
extern volatile TCNTSTR _TCNT @(REG_BASE + 0x00000044);
#define TCNT                            _TCNT.Word



 TSCR1 - Timer System Control Register1; 0x00000046 
typedef union {
  byte Byte;
  struct {
    byte             1; 
    byte             1; 
    byte             1; 
    byte PRNT        1;                                        Precision Timer 
    byte TFFCA       1;                                        Timer Fast Flag Clear All 
    byte TSFRZ       1;                                        Timer and Modulus Counter Stop While in Freeze Mode 
    byte TSWAI       1;                                        Timer Module Stops While in Wait 
    byte TEN         1;                                        Timer Enable 
  } Bits;
} TSCR1STR;
extern volatile TSCR1STR _TSCR1 @(REG_BASE + 0x00000046);
#define TSCR1                           _TSCR1.Byte
#define TSCR1_PRNT                      _TSCR1.Bits.PRNT
#define TSCR1_TFFCA                     _TSCR1.Bits.TFFCA
#define TSCR1_TSFRZ                     _TSCR1.Bits.TSFRZ
#define TSCR1_TSWAI                     _TSCR1.Bits.TSWAI
#define TSCR1_TEN                       _TSCR1.Bits.TEN

#define TSCR1_PRNT_MASK                 8
#define TSCR1_TFFCA_MASK                16
#define TSCR1_TSFRZ_MASK                32
#define TSCR1_TSWAI_MASK                64
#define TSCR1_TEN_MASK                  128


 TTOV - Timer Toggle On Overflow Register; 0x00000047 
typedef union {
  byte Byte;
  struct {
    byte TOV0        1;                                        Toggle On Overflow Bit 0 
    byte TOV1        1;                                        Toggle On Overflow Bit 1 
    byte TOV2        1;                                        Toggle On Overflow Bit 2 
    byte TOV3        1;                                        Toggle On Overflow Bit 3 
    byte TOV4        1;                                        Toggle On Overflow Bit 4 
    byte TOV5        1;                                        Toggle On Overflow Bit 5 
    byte TOV6        1;                                        Toggle On Overflow Bit 6 
    byte TOV7        1;                                        Toggle On Overflow Bit 7 
  } Bits;
} TTOVSTR;
extern volatile TTOVSTR _TTOV @(REG_BASE + 0x00000047);
#define TTOV                            _TTOV.Byte
#define TTOV_TOV0                       _TTOV.Bits.TOV0
#define TTOV_TOV1                       _TTOV.Bits.TOV1
#define TTOV_TOV2                       _TTOV.Bits.TOV2
#define TTOV_TOV3                       _TTOV.Bits.TOV3
#define TTOV_TOV4                       _TTOV.Bits.TOV4
#define TTOV_TOV5                       _TTOV.Bits.TOV5
#define TTOV_TOV6                       _TTOV.Bits.TOV6
#define TTOV_TOV7                       _TTOV.Bits.TOV7

#define TTOV_TOV0_MASK                  1
#define TTOV_TOV1_MASK                  2
#define TTOV_TOV2_MASK                  4
#define TTOV_TOV3_MASK                  8
#define TTOV_TOV4_MASK                  16
#define TTOV_TOV5_MASK                  32
#define TTOV_TOV6_MASK                  64
#define TTOV_TOV7_MASK                  128


 TCTL1 - Timer Control Register 1; 0x00000048 
typedef union {
  byte Byte;
  struct {
    byte OL4         1;                                        Output Level Bit 4 
    byte OM4         1;                                        Output Mode Bit 4 
    byte OL5         1;                                        Output Level Bit 5 
    byte OM5         1;                                        Output Mode Bit 5 
    byte OL6         1;                                        Output Level Bit 6 
    byte OM6         1;                                        Output Mode Bit 6 
    byte OL7         1;                                        Output Level Bit 7 
    byte OM7         1;                                        Output Mode Bit 7 
  } Bits;
} TCTL1STR;
extern volatile TCTL1STR _TCTL1 @(REG_BASE + 0x00000048);
#define TCTL1                           _TCTL1.Byte
#define TCTL1_OL4                       _TCTL1.Bits.OL4
#define TCTL1_OM4                       _TCTL1.Bits.OM4
#define TCTL1_OL5                       _TCTL1.Bits.OL5
#define TCTL1_OM5                       _TCTL1.Bits.OM5
#define TCTL1_OL6                       _TCTL1.Bits.OL6
#define TCTL1_OM6                       _TCTL1.Bits.OM6
#define TCTL1_OL7                       _TCTL1.Bits.OL7
#define TCTL1_OM7                       _TCTL1.Bits.OM7

#define TCTL1_OL4_MASK                  1
#define TCTL1_OM4_MASK                  2
#define TCTL1_OL5_MASK                  4
#define TCTL1_OM5_MASK                  8
#define TCTL1_OL6_MASK                  16
#define TCTL1_OM6_MASK                  32
#define TCTL1_OL7_MASK                  64
#define TCTL1_OM7_MASK                  128


 TCTL2 - Timer Control Register 2; 0x00000049 
typedef union {
  byte Byte;
  struct {
    byte OL0         1;                                        Output Level Bit 0 
    byte OM0         1;                                        Output Mode Bit 0 
    byte OL1         1;                                        Output Level Bit 1 
    byte OM1         1;                                        Output Mode Bit 1 
    byte OL2         1;                                        Output Level Bit 2 
    byte OM2         1;                                        Output Mode Bit 2 
    byte OL3         1;                                        Output Level Bit 3 
    byte OM3         1;                                        Output Mode Bit 3 
  } Bits;
} TCTL2STR;
extern volatile TCTL2STR _TCTL2 @(REG_BASE + 0x00000049);
#define TCTL2                           _TCTL2.Byte
#define TCTL2_OL0                       _TCTL2.Bits.OL0
#define TCTL2_OM0                       _TCTL2.Bits.OM0
#define TCTL2_OL1                       _TCTL2.Bits.OL1
#define TCTL2_OM1                       _TCTL2.Bits.OM1
#define TCTL2_OL2                       _TCTL2.Bits.OL2
#define TCTL2_OM2                       _TCTL2.Bits.OM2
#define TCTL2_OL3                       _TCTL2.Bits.OL3
#define TCTL2_OM3                       _TCTL2.Bits.OM3

#define TCTL2_OL0_MASK                  1
#define TCTL2_OM0_MASK                  2
#define TCTL2_OL1_MASK                  4
#define TCTL2_OM1_MASK                  8
#define TCTL2_OL2_MASK                  16
#define TCTL2_OM2_MASK                  32
#define TCTL2_OL3_MASK                  64
#define TCTL2_OM3_MASK                  128


 TCTL3 - Timer Control Register 3; 0x0000004A 
typedef union {
  byte Byte;
  struct {
    byte EDG4A       1;                                        Input Capture Edge Control 4A 
    byte EDG4B       1;                                        Input Capture Edge Control 4B 
    byte EDG5A       1;                                        Input Capture Edge Control 5A 
    byte EDG5B       1;                                        Input Capture Edge Control 5B 
    byte EDG6A       1;                                        Input Capture Edge Control 6A 
    byte EDG6B       1;                                        Input Capture Edge Control 6B 
    byte EDG7A       1;                                        Input Capture Edge Control 7A 
    byte EDG7B       1;                                        Input Capture Edge Control 7B 
  } Bits;
  struct {
    byte grpEDG4x 2;
    byte grpEDG5x 2;
    byte grpEDG6x 2;
    byte grpEDG7x 2;
  } MergedBits;
} TCTL3STR;
extern volatile TCTL3STR _TCTL3 @(REG_BASE + 0x0000004A);
#define TCTL3                           _TCTL3.Byte
#define TCTL3_EDG4A                     _TCTL3.Bits.EDG4A
#define TCTL3_EDG4B                     _TCTL3.Bits.EDG4B
#define TCTL3_EDG5A                     _TCTL3.Bits.EDG5A
#define TCTL3_EDG5B                     _TCTL3.Bits.EDG5B
#define TCTL3_EDG6A                     _TCTL3.Bits.EDG6A
#define TCTL3_EDG6B                     _TCTL3.Bits.EDG6B
#define TCTL3_EDG7A                     _TCTL3.Bits.EDG7A
#define TCTL3_EDG7B                     _TCTL3.Bits.EDG7B
#define TCTL3_EDG4x                     _TCTL3.MergedBits.grpEDG4x
#define TCTL3_EDG5x                     _TCTL3.MergedBits.grpEDG5x
#define TCTL3_EDG6x                     _TCTL3.MergedBits.grpEDG6x
#define TCTL3_EDG7x                     _TCTL3.MergedBits.grpEDG7x

