gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
#define TCTL3_EDG4A_MASK                1
#define TCTL3_EDG4B_MASK                2
#define TCTL3_EDG5A_MASK                4
#define TCTL3_EDG5B_MASK                8
#define TCTL3_EDG6A_MASK                16
#define TCTL3_EDG6B_MASK                32
#define TCTL3_EDG7A_MASK                64
#define TCTL3_EDG7B_MASK                128
#define TCTL3_EDG4x_MASK                3
#define TCTL3_EDG4x_BITNUM              0
#define TCTL3_EDG5x_MASK                12
#define TCTL3_EDG5x_BITNUM              2
#define TCTL3_EDG6x_MASK                48
#define TCTL3_EDG6x_BITNUM              4
#define TCTL3_EDG7x_MASK                192
#define TCTL3_EDG7x_BITNUM              6


 TCTL4 - Timer Control Register 4; 0x0000004B 
typedef union {
  byte Byte;
  struct {
    byte EDG0A       1;                                        Input Capture Edge Control 0A 
    byte EDG0B       1;                                        Input Capture Edge Control 0B 
    byte EDG1A       1;                                        Input Capture Edge Control 1A 
    byte EDG1B       1;                                        Input Capture Edge Control 1B 
    byte EDG2A       1;                                        Input Capture Edge Control 2A 
    byte EDG2B       1;                                        Input Capture Edge Control 2B 
    byte EDG3A       1;                                        Input Capture Edge Control 3A 
    byte EDG3B       1;                                        Input Capture Edge Control 3B 
  } Bits;
  struct {
    byte grpEDG0x 2;
    byte grpEDG1x 2;
    byte grpEDG2x 2;
    byte grpEDG3x 2;
  } MergedBits;
} TCTL4STR;
extern volatile TCTL4STR _TCTL4 @(REG_BASE + 0x0000004B);
#define TCTL4                           _TCTL4.Byte
#define TCTL4_EDG0A                     _TCTL4.Bits.EDG0A
#define TCTL4_EDG0B                     _TCTL4.Bits.EDG0B
#define TCTL4_EDG1A                     _TCTL4.Bits.EDG1A
#define TCTL4_EDG1B                     _TCTL4.Bits.EDG1B
#define TCTL4_EDG2A                     _TCTL4.Bits.EDG2A
#define TCTL4_EDG2B                     _TCTL4.Bits.EDG2B
#define TCTL4_EDG3A                     _TCTL4.Bits.EDG3A
#define TCTL4_EDG3B                     _TCTL4.Bits.EDG3B
#define TCTL4_EDG0x                     _TCTL4.MergedBits.grpEDG0x
#define TCTL4_EDG1x                     _TCTL4.MergedBits.grpEDG1x
#define TCTL4_EDG2x                     _TCTL4.MergedBits.grpEDG2x
#define TCTL4_EDG3x                     _TCTL4.MergedBits.grpEDG3x

#define TCTL4_EDG0A_MASK                1
#define TCTL4_EDG0B_MASK                2
#define TCTL4_EDG1A_MASK                4
#define TCTL4_EDG1B_MASK                8
#define TCTL4_EDG2A_MASK                16
#define TCTL4_EDG2B_MASK                32
#define TCTL4_EDG3A_MASK                64
#define TCTL4_EDG3B_MASK                128
#define TCTL4_EDG0x_MASK                3
#define TCTL4_EDG0x_BITNUM              0
#define TCTL4_EDG1x_MASK                12
#define TCTL4_EDG1x_BITNUM              2
#define TCTL4_EDG2x_MASK                48
#define TCTL4_EDG2x_BITNUM              4
#define TCTL4_EDG3x_MASK                192
#define TCTL4_EDG3x_BITNUM              6


 TIE - Timer Interrupt Enable Register; 0x0000004C 
typedef union {
  byte Byte;
  struct {
    byte C0I         1;                                        Input CaptureOutput Compare Interrupt Enable Bit 0 
    byte C1I         1;                                        Input CaptureOutput Compare Interrupt Enable Bit 1 
    byte C2I         1;                                        Input CaptureOutput Compare Interrupt Enable Bit 2 
    byte C3I         1;                                        Input CaptureOutput Compare Interrupt Enable Bit 3 
    byte C4I         1;                                        Input CaptureOutput Compare Interrupt Enable Bit 4 
    byte C5I         1;                                        Input CaptureOutput Compare Interrupt Enable Bit 5 
    byte C6I         1;                                        Input CaptureOutput Compare Interrupt Enable Bit 6 
    byte C7I         1;                                        Input CaptureOutput Compare Interrupt Enable Bit 7 
  } Bits;
} TIESTR;
extern volatile TIESTR _TIE @(REG_BASE + 0x0000004C);
#define TIE                             _TIE.Byte
#define TIE_C0I                         _TIE.Bits.C0I
#define TIE_C1I                         _TIE.Bits.C1I
#define TIE_C2I                         _TIE.Bits.C2I
#define TIE_C3I                         _TIE.Bits.C3I
#define TIE_C4I                         _TIE.Bits.C4I
#define TIE_C5I                         _TIE.Bits.C5I
#define TIE_C6I                         _TIE.Bits.C6I
#define TIE_C7I                         _TIE.Bits.C7I

#define TIE_C0I_MASK                    1
#define TIE_C1I_MASK                    2
#define TIE_C2I_MASK                    4
#define TIE_C3I_MASK                    8
#define TIE_C4I_MASK                    16
#define TIE_C5I_MASK                    32
#define TIE_C6I_MASK                    64
#define TIE_C7I_MASK                    128


 TSCR2 - Timer System Control Register 2; 0x0000004D 
typedef union {
  byte Byte;
  struct {
    byte PR0         1;                                        Timer Prescaler Select Bit 0 
    byte PR1         1;                                        Timer Prescaler Select Bit 1 
    byte PR2         1;                                        Timer Prescaler Select Bit 2 
    byte TCRE        1;                                        Timer Counter Reset Enable 
    byte             1; 
    byte             1; 
    byte             1; 
    byte TOI         1;                                        Timer Overflow Interrupt Enable 
  } Bits;
  struct {
    byte grpPR   3;
    byte         1;
    byte         1;
    byte         1;
    byte         1;
    byte         1;
  } MergedBits;
} TSCR2STR;
extern volatile TSCR2STR _TSCR2 @(REG_BASE + 0x0000004D);
#define TSCR2                           _TSCR2.Byte
#define TSCR2_PR0                       _TSCR2.Bits.PR0
#define TSCR2_PR1                       _TSCR2.Bits.PR1
#define TSCR2_PR2                       _TSCR2.Bits.PR2
#define TSCR2_TCRE                      _TSCR2.Bits.TCRE
#define TSCR2_TOI                       _TSCR2.Bits.TOI
#define TSCR2_PR                        _TSCR2.MergedBits.grpPR

