gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
#define TSCR2_PR0_MASK                  1
#define TSCR2_PR1_MASK                  2
#define TSCR2_PR2_MASK                  4
#define TSCR2_TCRE_MASK                 8
#define TSCR2_TOI_MASK                  128
#define TSCR2_PR_MASK                   7
#define TSCR2_PR_BITNUM                 0


 TFLG1 - Main Timer Interrupt Flag 1; 0x0000004E 
typedef union {
  byte Byte;
  struct {
    byte C0F         1;                                        Input CaptureOutput Compare Channel Flag 0 
    byte C1F         1;                                        Input CaptureOutput Compare Channel Flag 1 
    byte C2F         1;                                        Input CaptureOutput Compare Channel Flag 2 
    byte C3F         1;                                        Input CaptureOutput Compare Channel Flag 3 
    byte C4F         1;                                        Input CaptureOutput Compare Channel Flag 4 
    byte C5F         1;                                        Input CaptureOutput Compare Channel Flag 5 
    byte C6F         1;                                        Input CaptureOutput Compare Channel Flag 6 
    byte C7F         1;                                        Input CaptureOutput Compare Channel Flag 7 
  } Bits;
} TFLG1STR;
extern volatile TFLG1STR _TFLG1 @(REG_BASE + 0x0000004E);
#define TFLG1                           _TFLG1.Byte
#define TFLG1_C0F                       _TFLG1.Bits.C0F
#define TFLG1_C1F                       _TFLG1.Bits.C1F
#define TFLG1_C2F                       _TFLG1.Bits.C2F
#define TFLG1_C3F                       _TFLG1.Bits.C3F
#define TFLG1_C4F                       _TFLG1.Bits.C4F
#define TFLG1_C5F                       _TFLG1.Bits.C5F
#define TFLG1_C6F                       _TFLG1.Bits.C6F
#define TFLG1_C7F                       _TFLG1.Bits.C7F

#define TFLG1_C0F_MASK                  1
#define TFLG1_C1F_MASK                  2
#define TFLG1_C2F_MASK                  4
#define TFLG1_C3F_MASK                  8
#define TFLG1_C4F_MASK                  16
#define TFLG1_C5F_MASK                  32
#define TFLG1_C6F_MASK                  64
#define TFLG1_C7F_MASK                  128


 TFLG2 - Main Timer Interrupt Flag 2; 0x0000004F 
typedef union {
  byte Byte;
  struct {
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
    byte TOF         1;                                        Timer Overflow Flag 
  } Bits;
} TFLG2STR;
extern volatile TFLG2STR _TFLG2 @(REG_BASE + 0x0000004F);
#define TFLG2                           _TFLG2.Byte
#define TFLG2_TOF                       _TFLG2.Bits.TOF

#define TFLG2_TOF_MASK                  128


 TC0 - Timer Input CaptureOutput Compare Register 0; 0x00000050 
typedef union {
  word Word;
    Overlapped registers 
  struct {
     TC0Hi - Timer Input CaptureOutput Compare Register 0 High; 0x00000050 
    union {
      byte Byte;
    } TC0HiSTR;
    #define TC0Hi                       _TC0.Overlap_STR.TC0HiSTR.Byte
    
    


     TC0Lo - Timer Input CaptureOutput Compare Register 0 Low; 0x00000051 
    union {
      byte Byte;
    } TC0LoSTR;
    #define TC0Lo                       _TC0.Overlap_STR.TC0LoSTR.Byte
    
    

  } Overlap_STR;

} TC0STR;
extern volatile TC0STR _TC0 @(REG_BASE + 0x00000050);
#define TC0                             _TC0.Word
 TC_ARR Access 8 TCx registers in an array 
#define TC_ARR                          ((volatile word ) &TC0)



 TC1 - Timer Input CaptureOutput Compare Register 1; 0x00000052 
typedef union {
  word Word;
    Overlapped registers 
  struct {
     TC1Hi - Timer Input CaptureOutput Compare Register 1 High; 0x00000052 
    union {
      byte Byte;
    } TC1HiSTR;
    #define TC1Hi                       _TC1.Overlap_STR.TC1HiSTR.Byte
    
    


     TC1Lo - Timer Input CaptureOutput Compare Register 1 Low; 0x00000053 
    union {
      byte Byte;
    } TC1LoSTR;
    #define TC1Lo                       _TC1.Overlap_STR.TC1LoSTR.Byte
    
    

  } Overlap_STR;

} TC1STR;
extern volatile TC1STR _TC1 @(REG_BASE + 0x00000052);
#define TC1                             _TC1.Word



 TC2 - Timer Input CaptureOutput Compare Register 2; 0x00000054 
typedef union {
  word Word;
    Overlapped registers 
  struct {
     TC2Hi - Timer Input CaptureOutput Compare Register 2 High; 0x00000054 
    union {
      byte Byte;
    } TC2HiSTR;
    #define TC2Hi                       _TC2.Overlap_STR.TC2HiSTR.Byte
    
    


     TC2Lo - Timer Input CaptureOutput Compare Register 2 Low; 0x00000055 
    union {
      byte Byte;
    } TC2LoSTR;
    #define TC2Lo                       _TC2.Overlap_STR.TC2LoSTR.Byte
    
    

  } Overlap_STR;

} TC2STR;
extern volatile TC2STR _TC2 @(REG_BASE + 0x00000054);
#define TC2                             _TC2.Word



 TC3 - Timer Input CaptureOutput Compare Register 3; 0x00000056 
typedef union {
  word Word;
    Overlapped registers 
  struct {
     TC3Hi - Timer Input CaptureOutput Compare Register 3 High; 0x00000056 
    union {
      byte Byte;
    } TC3HiSTR;
    #define TC3Hi                       _TC3.Overlap_STR.TC3HiSTR.Byte
    
    


     TC3Lo - Timer Input CaptureOutput Compare Register 3 Low; 0x00000057 
    union {
      byte Byte;
    } TC3LoSTR;
    #define TC3Lo                       _TC3.Overlap_STR.TC3LoSTR.Byte
    
    

  } Overlap_STR;

} TC3STR;
extern volatile TC3STR _TC3 @(REG_BASE + 0x00000056);
#define TC3                             _TC3.Word



 TC4 - Timer Input CaptureOutput Compare Register 4; 0x00000058 
typedef union {
  word Word;
    Overlapped registers 
  struct {
     TC4Hi - Timer Input CaptureOutput Compare Register 4 High; 0x00000058 
    union {
      byte Byte;
    } TC4HiSTR;
    #define TC4Hi                       _TC4.Overlap_STR.TC4HiSTR.Byte
    
    


     TC4Lo - Timer Input CaptureOutput Compare Register 4 Low; 0x00000059 
    union {
      byte Byte;
    } TC4LoSTR;
    #define TC4Lo                       _TC4.Overlap_STR.TC4LoSTR.Byte
    
    

  } Overlap_STR;

