gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
} TC4STR;
extern volatile TC4STR _TC4 @(REG_BASE + 0x00000058);
#define TC4                             _TC4.Word



 TC5 - Timer Input CaptureOutput Compare Register 5; 0x0000005A 
typedef union {
  word Word;
    Overlapped registers 
  struct {
     TC5Hi - Timer Input CaptureOutput Compare Register 5 High; 0x0000005A 
    union {
      byte Byte;
    } TC5HiSTR;
    #define TC5Hi                       _TC5.Overlap_STR.TC5HiSTR.Byte
    
    


     TC5Lo - Timer Input CaptureOutput Compare Register 5 Low; 0x0000005B 
    union {
      byte Byte;
    } TC5LoSTR;
    #define TC5Lo                       _TC5.Overlap_STR.TC5LoSTR.Byte
    
    

  } Overlap_STR;

} TC5STR;
extern volatile TC5STR _TC5 @(REG_BASE + 0x0000005A);
#define TC5                             _TC5.Word



 TC6 - Timer Input CaptureOutput Compare Register 6; 0x0000005C 
typedef union {
  word Word;
    Overlapped registers 
  struct {
     TC6Hi - Timer Input CaptureOutput Compare Register 6 High; 0x0000005C 
    union {
      byte Byte;
    } TC6HiSTR;
    #define TC6Hi                       _TC6.Overlap_STR.TC6HiSTR.Byte
    
    


     TC6Lo - Timer Input CaptureOutput Compare Register 6 Low; 0x0000005D 
    union {
      byte Byte;
    } TC6LoSTR;
    #define TC6Lo                       _TC6.Overlap_STR.TC6LoSTR.Byte
    
    

  } Overlap_STR;

} TC6STR;
extern volatile TC6STR _TC6 @(REG_BASE + 0x0000005C);
#define TC6                             _TC6.Word



 TC7 - Timer Input CaptureOutput Compare Register 7; 0x0000005E 
typedef union {
  word Word;
    Overlapped registers 
  struct {
     TC7Hi - Timer Input CaptureOutput Compare Register 7 High; 0x0000005E 
    union {
      byte Byte;
    } TC7HiSTR;
    #define TC7Hi                       _TC7.Overlap_STR.TC7HiSTR.Byte
    
    


     TC7Lo - Timer Input CaptureOutput Compare Register 7 Low; 0x0000005F 
    union {
      byte Byte;
    } TC7LoSTR;
    #define TC7Lo                       _TC7.Overlap_STR.TC7LoSTR.Byte
    
    

  } Overlap_STR;

} TC7STR;
extern volatile TC7STR _TC7 @(REG_BASE + 0x0000005E);
#define TC7                             _TC7.Word



 PACTL - 16-Bit Pulse Accumulator A Control Register; 0x00000060 
typedef union {
  byte Byte;
  struct {
    byte PAI         1;                                        Pulse Accumulator Input Interrupt enable 
    byte PAOVI       1;                                        Pulse Accumulator A Overflow Interrupt enable 
    byte CLK0        1;                                        Clock Select Bit 0 
    byte CLK1        1;                                        Clock Select Bit 1 
    byte PEDGE       1;                                        Pulse Accumulator Edge Control 
    byte PAMOD       1;                                        Pulse Accumulator Mode 
    byte PAEN        1;                                        Pulse Accumulator A System Enable 
    byte             1; 
  } Bits;
  struct {
    byte         1;
    byte         1;
    byte grpCLK  2;
    byte         1;
    byte         1;
    byte         1;
    byte         1;
  } MergedBits;
} PACTLSTR;
extern volatile PACTLSTR _PACTL @(REG_BASE + 0x00000060);
#define PACTL                           _PACTL.Byte
#define PACTL_PAI                       _PACTL.Bits.PAI
#define PACTL_PAOVI                     _PACTL.Bits.PAOVI
#define PACTL_CLK0                      _PACTL.Bits.CLK0
#define PACTL_CLK1                      _PACTL.Bits.CLK1
#define PACTL_PEDGE                     _PACTL.Bits.PEDGE
#define PACTL_PAMOD                     _PACTL.Bits.PAMOD
#define PACTL_PAEN                      _PACTL.Bits.PAEN
#define PACTL_CLK                       _PACTL.MergedBits.grpCLK

#define PACTL_PAI_MASK                  1
#define PACTL_PAOVI_MASK                2
#define PACTL_CLK0_MASK                 4
#define PACTL_CLK1_MASK                 8
#define PACTL_PEDGE_MASK                16
#define PACTL_PAMOD_MASK                32
#define PACTL_PAEN_MASK                 64
#define PACTL_CLK_MASK                  12
#define PACTL_CLK_BITNUM                2


 PAFLG - Pulse Accumulator A Flag Register; 0x00000061 
typedef union {
  byte Byte;
  struct {
    byte PAIF        1;                                        Pulse Accumulator Input edge Flag 
    byte PAOVF       1;                                        Pulse Accumulator A Overflow Flag 
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
  } Bits;
} PAFLGSTR;
extern volatile PAFLGSTR _PAFLG @(REG_BASE + 0x00000061);
#define PAFLG                           _PAFLG.Byte
#define PAFLG_PAIF                      _PAFLG.Bits.PAIF
#define PAFLG_PAOVF                     _PAFLG.Bits.PAOVF

#define PAFLG_PAIF_MASK                 1
#define PAFLG_PAOVF_MASK                2


 PACN32 - Pulse Accumulators Count 32 Register; 0x00000062 
typedef union {
  word Word;
    Overlapped registers 
  struct {
     PACN3 - Pulse Accumulators Count 3 Register; 0x00000062 
    union {
      byte Byte;
    } PACN3STR;
    #define PACN3                       _PACN32.Overlap_STR.PACN3STR.Byte
    
    


     PACN2 - Pulse Accumulators Count 2 Register; 0x00000063 
    union {
      byte Byte;
    } PACN2STR;
    #define PACN2                       _PACN32.Overlap_STR.PACN2STR.Byte
    
    

  } Overlap_STR;

} PACN32STR;
extern volatile PACN32STR _PACN32 @(REG_BASE + 0x00000062);
#define PACN32                          _PACN32.Word



 PACN10 - Pulse Accumulators Count 10 Register; 0x00000064 
typedef union {
  word Word;
    Overlapped registers 
  struct {
     PACN1 - Pulse Accumulators Count 1 Register; 0x00000064 
    union {
      byte Byte;
    } PACN1STR;
    #define PACN1                       _PACN10.Overlap_STR.PACN1STR.Byte
    
    


     PACN0 - Pulse Accumulators Count 0 Register; 0x00000065 
    union {
      byte Byte;
    } PACN0STR;
    #define PACN0                       _PACN10.Overlap_STR.PACN0STR.Byte
    
    

  } Overlap_STR;

