gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
} PACN10STR;
extern volatile PACN10STR _PACN10 @(REG_BASE + 0x00000064);
#define PACN10                          _PACN10.Word



 MCCTL - Modulus Down Counter underflow; 0x00000066 
typedef union {
  byte Byte;
  struct {
    byte MCPR0       1;                                        Modulus Counter Prescaler select 0 
    byte MCPR1       1;                                        Modulus Counter Prescaler select 1 
    byte MCEN        1;                                        Modulus Down-Counter Enable 
    byte FLMC        1;                                        Force Load Register into the Modulus Counter Count Register 
    byte ICLAT       1;                                        Input Capture Force Latch Action 
    byte RDMCL       1;                                        Read Modulus Down-Counter Load 
    byte MODMC       1;                                        Modulus Mode Enable 
    byte MCZI        1;                                        Modulus Counter Underflow Interrupt Enable 
  } Bits;
  struct {
    byte grpMCPR 2;
    byte         1;
    byte         1;
    byte         1;
    byte         1;
    byte         1;
    byte         1;
  } MergedBits;
} MCCTLSTR;
extern volatile MCCTLSTR _MCCTL @(REG_BASE + 0x00000066);
#define MCCTL                           _MCCTL.Byte
#define MCCTL_MCPR0                     _MCCTL.Bits.MCPR0
#define MCCTL_MCPR1                     _MCCTL.Bits.MCPR1
#define MCCTL_MCEN                      _MCCTL.Bits.MCEN
#define MCCTL_FLMC                      _MCCTL.Bits.FLMC
#define MCCTL_ICLAT                     _MCCTL.Bits.ICLAT
#define MCCTL_RDMCL                     _MCCTL.Bits.RDMCL
#define MCCTL_MODMC                     _MCCTL.Bits.MODMC
#define MCCTL_MCZI                      _MCCTL.Bits.MCZI
#define MCCTL_MCPR                      _MCCTL.MergedBits.grpMCPR

#define MCCTL_MCPR0_MASK                1
#define MCCTL_MCPR1_MASK                2
#define MCCTL_MCEN_MASK                 4
#define MCCTL_FLMC_MASK                 8
#define MCCTL_ICLAT_MASK                16
#define MCCTL_RDMCL_MASK                32
#define MCCTL_MODMC_MASK                64
#define MCCTL_MCZI_MASK                 128
#define MCCTL_MCPR_MASK                 3
#define MCCTL_MCPR_BITNUM               0


 MCFLG - 16-Bit Modulus Down Counter Flag Register; 0x00000067 
typedef union {
  byte Byte;
  struct {
    byte POLF0       1;                                        First Input Capture Polarity Status 0 
    byte POLF1       1;                                        First Input Capture Polarity Status 1 
    byte POLF2       1;                                        First Input Capture Polarity Status 2 
    byte POLF3       1;                                        First Input Capture Polarity Status 3 
    byte             1; 
    byte             1; 
    byte             1; 
    byte MCZF        1;                                        Modulus Counter Underflow Flag 
  } Bits;
  struct {
    byte grpPOLF 4;
    byte         1;
    byte         1;
    byte         1;
    byte         1;
  } MergedBits;
} MCFLGSTR;
extern volatile MCFLGSTR _MCFLG @(REG_BASE + 0x00000067);
#define MCFLG                           _MCFLG.Byte
#define MCFLG_POLF0                     _MCFLG.Bits.POLF0
#define MCFLG_POLF1                     _MCFLG.Bits.POLF1
#define MCFLG_POLF2                     _MCFLG.Bits.POLF2
#define MCFLG_POLF3                     _MCFLG.Bits.POLF3
#define MCFLG_MCZF                      _MCFLG.Bits.MCZF
#define MCFLG_POLF                      _MCFLG.MergedBits.grpPOLF

#define MCFLG_POLF0_MASK                1
#define MCFLG_POLF1_MASK                2
#define MCFLG_POLF2_MASK                4
#define MCFLG_POLF3_MASK                8
#define MCFLG_MCZF_MASK                 128
#define MCFLG_POLF_MASK                 15
#define MCFLG_POLF_BITNUM               0


 ICPAR - Input Control Pulse Accumulator Register; 0x00000068 
typedef union {
  byte Byte;
  struct {
    byte PA0EN       1;                                        8-Bit Pulse Accumulator 0 Enable 
    byte PA1EN       1;                                        8-Bit Pulse Accumulator 1 Enable 
    byte PA2EN       1;                                        8-Bit Pulse Accumulator 2 Enable 
    byte PA3EN       1;                                        8-Bit Pulse Accumulator 3 Enable 
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
  } Bits;
} ICPARSTR;
extern volatile ICPARSTR _ICPAR @(REG_BASE + 0x00000068);
#define ICPAR                           _ICPAR.Byte
#define ICPAR_PA0EN                     _ICPAR.Bits.PA0EN
#define ICPAR_PA1EN                     _ICPAR.Bits.PA1EN
#define ICPAR_PA2EN                     _ICPAR.Bits.PA2EN
#define ICPAR_PA3EN                     _ICPAR.Bits.PA3EN

#define ICPAR_PA0EN_MASK                1
#define ICPAR_PA1EN_MASK                2
#define ICPAR_PA2EN_MASK                4
#define ICPAR_PA3EN_MASK                8


 DLYCT - Delay Counter Control Register; 0x00000069 
typedef union {
  byte Byte;
  struct {
    byte DLY0        1;                                        Delay Counter Select Bit 0 
    byte DLY1        1;                                        Delay Counter Select Bit 1 
    byte DLY2        1;                                        Delay Counter Select Bit 2 
    byte DLY3        1;                                        Delay Counter Select Bit 3 
    byte DLY4        1;                                        Delay Counter Select Bit 4 
    byte DLY5        1;                                        Delay Counter Select Bit 5 
    byte DLY6        1;                                        Delay Counter Select Bit 6 
    byte DLY7        1;                                        Delay Counter Select Bit 7 
  } Bits;
} DLYCTSTR;
extern volatile DLYCTSTR _DLYCT @(REG_BASE + 0x00000069);
#define DLYCT                           _DLYCT.Byte
#define DLYCT_DLY0                      _DLYCT.Bits.DLY0
#define DLYCT_DLY1                      _DLYCT.Bits.DLY1
#define DLYCT_DLY2                      _DLYCT.Bits.DLY2
#define DLYCT_DLY3                      _DLYCT.Bits.DLY3
#define DLYCT_DLY4                      _DLYCT.Bits.DLY4
#define DLYCT_DLY5                      _DLYCT.Bits.DLY5
#define DLYCT_DLY6                      _DLYCT.Bits.DLY6
#define DLYCT_DLY7                      _DLYCT.Bits.DLY7

#define DLYCT_DLY0_MASK                 1
#define DLYCT_DLY1_MASK                 2
#define DLYCT_DLY2_MASK                 4
#define DLYCT_DLY3_MASK                 8
#define DLYCT_DLY4_MASK                 16
#define DLYCT_DLY5_MASK                 32
#define DLYCT_DLY6_MASK                 64
#define DLYCT_DLY7_MASK                 128


