gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
 ICOVW - Input Control Overwrite Register; 0x0000006A 
typedef union {
  byte Byte;
  struct {
    byte NOVW0       1;                                        No Input Capture Overwrite 0 
    byte NOVW1       1;                                        No Input Capture Overwrite 1 
    byte NOVW2       1;                                        No Input Capture Overwrite 2 
    byte NOVW3       1;                                        No Input Capture Overwrite 3 
    byte NOVW4       1;                                        No Input Capture Overwrite 4 
    byte NOVW5       1;                                        No Input Capture Overwrite 5 
    byte NOVW6       1;                                        No Input Capture Overwrite 6 
    byte NOVW7       1;                                        No Input Capture Overwrite 7 
  } Bits;
} ICOVWSTR;
extern volatile ICOVWSTR _ICOVW @(REG_BASE + 0x0000006A);
#define ICOVW                           _ICOVW.Byte
#define ICOVW_NOVW0                     _ICOVW.Bits.NOVW0
#define ICOVW_NOVW1                     _ICOVW.Bits.NOVW1
#define ICOVW_NOVW2                     _ICOVW.Bits.NOVW2
#define ICOVW_NOVW3                     _ICOVW.Bits.NOVW3
#define ICOVW_NOVW4                     _ICOVW.Bits.NOVW4
#define ICOVW_NOVW5                     _ICOVW.Bits.NOVW5
#define ICOVW_NOVW6                     _ICOVW.Bits.NOVW6
#define ICOVW_NOVW7                     _ICOVW.Bits.NOVW7

#define ICOVW_NOVW0_MASK                1
#define ICOVW_NOVW1_MASK                2
#define ICOVW_NOVW2_MASK                4
#define ICOVW_NOVW3_MASK                8
#define ICOVW_NOVW4_MASK                16
#define ICOVW_NOVW5_MASK                32
#define ICOVW_NOVW6_MASK                64
#define ICOVW_NOVW7_MASK                128


 ICSYS - Input Control System Control Register; 0x0000006B 
typedef union {
  byte Byte;
  struct {
    byte LATQ        1;                                        Input Control Latch or Queue Mode Enable 
    byte BUFEN       1;                                        IC Buffer Enable 
    byte PACMX       1;                                        8-Bit Pulse Accumulators Maximum Count 
    byte TFMOD       1;                                        Timer Flag-setting Mode 
    byte SH04        1;                                        Share Input action of Input Capture Channels 0 and 4 
    byte SH15        1;                                        Share Input action of Input Capture Channels 1 and 5 
    byte SH26        1;                                        Share Input action of Input Capture Channels 2 and 6 
    byte SH37        1;                                        Share Input action of Input Capture Channels 3 and 7 
  } Bits;
} ICSYSSTR;
extern volatile ICSYSSTR _ICSYS @(REG_BASE + 0x0000006B);
#define ICSYS                           _ICSYS.Byte
#define ICSYS_LATQ                      _ICSYS.Bits.LATQ
#define ICSYS_BUFEN                     _ICSYS.Bits.BUFEN
#define ICSYS_PACMX                     _ICSYS.Bits.PACMX
#define ICSYS_TFMOD                     _ICSYS.Bits.TFMOD
#define ICSYS_SH04                      _ICSYS.Bits.SH04
#define ICSYS_SH15                      _ICSYS.Bits.SH15
#define ICSYS_SH26                      _ICSYS.Bits.SH26
#define ICSYS_SH37                      _ICSYS.Bits.SH37

#define ICSYS_LATQ_MASK                 1
#define ICSYS_BUFEN_MASK                2
#define ICSYS_PACMX_MASK                4
#define ICSYS_TFMOD_MASK                8
#define ICSYS_SH04_MASK                 16
#define ICSYS_SH15_MASK                 32
#define ICSYS_SH26_MASK                 64
#define ICSYS_SH37_MASK                 128


 PTPSR - Precision Timer Prescaler Select; 0x0000006E 
typedef union {
  byte Byte;
  struct {
    byte PTPS0       1;                                        Precision Timer Prescaler Select Bit 0 
    byte PTPS1       1;                                        Precision Timer Prescaler Select Bit 1 
    byte PTPS2       1;                                        Precision Timer Prescaler Select Bit 2 
    byte PTPS3       1;                                        Precision Timer Prescaler Select Bit 3 
    byte PTPS4       1;                                        Precision Timer Prescaler Select Bit 4 
    byte PTPS5       1;                                        Precision Timer Prescaler Select Bit 5 
    byte PTPS6       1;                                        Precision Timer Prescaler Select Bit 6 
    byte PTPS7       1;                                        Precision Timer Prescaler Select Bit 7 
  } Bits;
} PTPSRSTR;
extern volatile PTPSRSTR _PTPSR @(REG_BASE + 0x0000006E);
#define PTPSR                           _PTPSR.Byte
#define PTPSR_PTPS0                     _PTPSR.Bits.PTPS0
#define PTPSR_PTPS1                     _PTPSR.Bits.PTPS1
#define PTPSR_PTPS2                     _PTPSR.Bits.PTPS2
#define PTPSR_PTPS3                     _PTPSR.Bits.PTPS3
#define PTPSR_PTPS4                     _PTPSR.Bits.PTPS4
#define PTPSR_PTPS5                     _PTPSR.Bits.PTPS5
#define PTPSR_PTPS6                     _PTPSR.Bits.PTPS6
#define PTPSR_PTPS7                     _PTPSR.Bits.PTPS7

#define PTPSR_PTPS0_MASK                1
#define PTPSR_PTPS1_MASK                2
#define PTPSR_PTPS2_MASK                4
#define PTPSR_PTPS3_MASK                8
#define PTPSR_PTPS4_MASK                16
#define PTPSR_PTPS5_MASK                32
#define PTPSR_PTPS6_MASK                64
#define PTPSR_PTPS7_MASK                128


 PTMCPSR - Precision Timer Modulus Counter Prescaler Select Register; 0x0000006F 
typedef union {
  byte Byte;
  struct {
    byte PTMPS0      1;                                        Precision Timer Modulus Counter Prescaler Select bit 0 
    byte PTMPS1      1;                                        Precision Timer Modulus Counter Prescaler Select bit 1 
    byte PTMPS2      1;                                        Precision Timer Modulus Counter Prescaler Select bit 2 
    byte PTMPS3      1;                                        Precision Timer Modulus Counter Prescaler Select bit 3 
    byte PTMPS4      1;                                        Precision Timer Modulus Counter Prescaler Select bit 4 
    byte PTMPS5      1;                                        Precision Timer Modulus Counter Prescaler Select bit 5 
    byte PTMPS6      1;                                        Precision Timer Modulus Counter Prescaler Select bit 6 
    byte PTMPS7      1;                                        Precision Timer Modulus Counter Prescaler Select bit 7 
  } Bits;
} PTMCPSRSTR;
extern volatile PTMCPSRSTR _PTMCPSR @(REG_BASE + 0x0000006F);
#define PTMCPSR                         _PTMCPSR.Byte
#define PTMCPSR_PTMPS0                  _PTMCPSR.Bits.PTMPS0
#define PTMCPSR_PTMPS1                  _PTMCPSR.Bits.PTMPS1
#define PTMCPSR_PTMPS2                  _PTMCPSR.Bits.PTMPS2
#define PTMCPSR_PTMPS3                  _PTMCPSR.Bits.PTMPS3
#define PTMCPSR_PTMPS4                  _PTMCPSR.Bits.PTMPS4
#define PTMCPSR_PTMPS5                  _PTMCPSR.Bits.PTMPS5
#define PTMCPSR_PTMPS6                  _PTMCPSR.Bits.PTMPS6
#define PTMCPSR_PTMPS7                  _PTMCPSR.Bits.PTMPS7

