gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
  struct {
    word BIT0        1;                                        Timer Input Capture Holding Bit 0 
    word BIT1        1;                                        Timer Input Capture Holding Bit 1 
    word BIT2        1;                                        Timer Input Capture Holding Bit 2 
    word BIT3        1;                                        Timer Input Capture Holding Bit 3 
    word BIT4        1;                                        Timer Input Capture Holding Bit 4 
    word BIT5        1;                                        Timer Input Capture Holding Bit 5 
    word BIT6        1;                                        Timer Input Capture Holding Bit 6 
    word BIT7        1;                                        Timer Input Capture Holding Bit 7 
    word BIT8        1;                                        Timer Input Capture Holding Bit 8 
    word BIT9        1;                                        Timer Input Capture Holding Bit 9 
    word BIT10       1;                                        Timer Input Capture Holding Bit 10 
    word BIT11       1;                                        Timer Input Capture Holding Bit 11 
    word BIT12       1;                                        Timer Input Capture Holding Bit 12 
    word BIT13       1;                                        Timer Input Capture Holding Bit 13 
    word BIT14       1;                                        Timer Input Capture Holding Bit 14 
    word BIT15       1;                                        Timer Input Capture Holding Bit 15 
  } Bits;
} TC2HSTR;
extern volatile TC2HSTR _TC2H @(REG_BASE + 0x0000007C);
#define TC2H                            _TC2H.Word
#define TC2H_BIT0                       _TC2H.Bits.BIT0
#define TC2H_BIT1                       _TC2H.Bits.BIT1
#define TC2H_BIT2                       _TC2H.Bits.BIT2
#define TC2H_BIT3                       _TC2H.Bits.BIT3
#define TC2H_BIT4                       _TC2H.Bits.BIT4
#define TC2H_BIT5                       _TC2H.Bits.BIT5
#define TC2H_BIT6                       _TC2H.Bits.BIT6
#define TC2H_BIT7                       _TC2H.Bits.BIT7
#define TC2H_BIT8                       _TC2H.Bits.BIT8
#define TC2H_BIT9                       _TC2H.Bits.BIT9
#define TC2H_BIT10                      _TC2H.Bits.BIT10
#define TC2H_BIT11                      _TC2H.Bits.BIT11
#define TC2H_BIT12                      _TC2H.Bits.BIT12
#define TC2H_BIT13                      _TC2H.Bits.BIT13
#define TC2H_BIT14                      _TC2H.Bits.BIT14
#define TC2H_BIT15                      _TC2H.Bits.BIT15

#define TC2H_BIT0_MASK                  1
#define TC2H_BIT1_MASK                  2
#define TC2H_BIT2_MASK                  4
#define TC2H_BIT3_MASK                  8
#define TC2H_BIT4_MASK                  16
#define TC2H_BIT5_MASK                  32
#define TC2H_BIT6_MASK                  64
#define TC2H_BIT7_MASK                  128
#define TC2H_BIT8_MASK                  256
#define TC2H_BIT9_MASK                  512
#define TC2H_BIT10_MASK                 1024
#define TC2H_BIT11_MASK                 2048
#define TC2H_BIT12_MASK                 4096
#define TC2H_BIT13_MASK                 8192
#define TC2H_BIT14_MASK                 16384
#define TC2H_BIT15_MASK                 32768


 TC3H - Timer Input Capture Holding Registers 3; 0x0000007E 
typedef union {
  word Word;
    Overlapped registers 
  struct {
     TC3Hhi - Timer Input Capture Holding Registers 3 High; 0x0000007E 
    union {
      byte Byte;
      struct {
        byte BIT8        1;                                        Timer Input Capture Holding Bit 8 
        byte BIT9        1;                                        Timer Input Capture Holding Bit 9 
        byte BIT10       1;                                        Timer Input Capture Holding Bit 10 
        byte BIT11       1;                                        Timer Input Capture Holding Bit 11 
        byte BIT12       1;                                        Timer Input Capture Holding Bit 12 
        byte BIT13       1;                                        Timer Input Capture Holding Bit 13 
        byte BIT14       1;                                        Timer Input Capture Holding Bit 14 
        byte BIT15       1;                                        Timer Input Capture Holding Bit 15 
      } Bits;
    } TC3HhiSTR;
    #define TC3Hhi                      _TC3H.Overlap_STR.TC3HhiSTR.Byte
    #define TC3Hhi_BIT8                 _TC3H.Overlap_STR.TC3HhiSTR.Bits.BIT8
    #define TC3Hhi_BIT9                 _TC3H.Overlap_STR.TC3HhiSTR.Bits.BIT9
    #define TC3Hhi_BIT10                _TC3H.Overlap_STR.TC3HhiSTR.Bits.BIT10
    #define TC3Hhi_BIT11                _TC3H.Overlap_STR.TC3HhiSTR.Bits.BIT11
    #define TC3Hhi_BIT12                _TC3H.Overlap_STR.TC3HhiSTR.Bits.BIT12
    #define TC3Hhi_BIT13                _TC3H.Overlap_STR.TC3HhiSTR.Bits.BIT13
    #define TC3Hhi_BIT14                _TC3H.Overlap_STR.TC3HhiSTR.Bits.BIT14
    #define TC3Hhi_BIT15                _TC3H.Overlap_STR.TC3HhiSTR.Bits.BIT15
    
    
    #define TC3Hhi_BIT8_MASK            1
    #define TC3Hhi_BIT9_MASK            2
    #define TC3Hhi_BIT10_MASK           4
    #define TC3Hhi_BIT11_MASK           8
    #define TC3Hhi_BIT12_MASK           16
    #define TC3Hhi_BIT13_MASK           32
    #define TC3Hhi_BIT14_MASK           64
    #define TC3Hhi_BIT15_MASK           128


     TC3Hlo - Timer Input Capture Holding Registers 3 Low; 0x0000007F 
    union {
      byte Byte;
      struct {
        byte BIT0        1;                                        Timer Input Capture Holding Bit 0 
        byte BIT1        1;                                        Timer Input Capture Holding Bit 1 
        byte BIT2        1;                                        Timer Input Capture Holding Bit 2 
        byte BIT3        1;                                        Timer Input Capture Holding Bit 3 
        byte BIT4        1;                                        Timer Input Capture Holding Bit 4 
        byte BIT5        1;                                        Timer Input Capture Holding Bit 5 
        byte BIT6        1;                                        Timer Input Capture Holding Bit 6 
        byte BIT7        1;                                        Timer Input Capture Holding Bit 7 
      } Bits;
    } TC3HloSTR;
    #define TC3Hlo                      _TC3H.Overlap_STR.TC3HloSTR.Byte
    #define TC3Hlo_BIT0                 _TC3H.Overlap_STR.TC3HloSTR.Bits.BIT0
    #define TC3Hlo_BIT1                 _TC3H.Overlap_STR.TC3HloSTR.Bits.BIT1
    #define TC3Hlo_BIT2                 _TC3H.Overlap_STR.TC3HloSTR.Bits.BIT2
    #define TC3Hlo_BIT3                 _TC3H.Overlap_STR.TC3HloSTR.Bits.BIT3
    #define TC3Hlo_BIT4                 _TC3H.Overlap_STR.TC3HloSTR.Bits.BIT4
    #define TC3Hlo_BIT5                 _TC3H.Overlap_STR.TC3HloSTR.Bits.BIT5
    #define TC3Hlo_BIT6                 _TC3H.Overlap_STR.TC3HloSTR.Bits.BIT6
    #define TC3Hlo_BIT7                 _TC3H.Overlap_STR.TC3HloSTR.Bits.BIT7
    
    
