gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
    #define TC3Hlo_BIT0_MASK            1
    #define TC3Hlo_BIT1_MASK            2
    #define TC3Hlo_BIT2_MASK            4
    #define TC3Hlo_BIT3_MASK            8
    #define TC3Hlo_BIT4_MASK            16
    #define TC3Hlo_BIT5_MASK            32
    #define TC3Hlo_BIT6_MASK            64
    #define TC3Hlo_BIT7_MASK            128

  } Overlap_STR;

  struct {
    word BIT0        1;                                        Timer Input Capture Holding Bit 0 
    word BIT1        1;                                        Timer Input Capture Holding Bit 1 
    word BIT2        1;                                        Timer Input Capture Holding Bit 2 
    word BIT3        1;                                        Timer Input Capture Holding Bit 3 
    word BIT4        1;                                        Timer Input Capture Holding Bit 4 
    word BIT5        1;                                        Timer Input Capture Holding Bit 5 
    word BIT6        1;                                        Timer Input Capture Holding Bit 6 
    word BIT7        1;                                        Timer Input Capture Holding Bit 7 
    word BIT8        1;                                        Timer Input Capture Holding Bit 8 
    word BIT9        1;                                        Timer Input Capture Holding Bit 9 
    word BIT10       1;                                        Timer Input Capture Holding Bit 10 
    word BIT11       1;                                        Timer Input Capture Holding Bit 11 
    word BIT12       1;                                        Timer Input Capture Holding Bit 12 
    word BIT13       1;                                        Timer Input Capture Holding Bit 13 
    word BIT14       1;                                        Timer Input Capture Holding Bit 14 
    word BIT15       1;                                        Timer Input Capture Holding Bit 15 
  } Bits;
} TC3HSTR;
extern volatile TC3HSTR _TC3H @(REG_BASE + 0x0000007E);
#define TC3H                            _TC3H.Word
#define TC3H_BIT0                       _TC3H.Bits.BIT0
#define TC3H_BIT1                       _TC3H.Bits.BIT1
#define TC3H_BIT2                       _TC3H.Bits.BIT2
#define TC3H_BIT3                       _TC3H.Bits.BIT3
#define TC3H_BIT4                       _TC3H.Bits.BIT4
#define TC3H_BIT5                       _TC3H.Bits.BIT5
#define TC3H_BIT6                       _TC3H.Bits.BIT6
#define TC3H_BIT7                       _TC3H.Bits.BIT7
#define TC3H_BIT8                       _TC3H.Bits.BIT8
#define TC3H_BIT9                       _TC3H.Bits.BIT9
#define TC3H_BIT10                      _TC3H.Bits.BIT10
#define TC3H_BIT11                      _TC3H.Bits.BIT11
#define TC3H_BIT12                      _TC3H.Bits.BIT12
#define TC3H_BIT13                      _TC3H.Bits.BIT13
#define TC3H_BIT14                      _TC3H.Bits.BIT14
#define TC3H_BIT15                      _TC3H.Bits.BIT15

#define TC3H_BIT0_MASK                  1
#define TC3H_BIT1_MASK                  2
#define TC3H_BIT2_MASK                  4
#define TC3H_BIT3_MASK                  8
#define TC3H_BIT4_MASK                  16
#define TC3H_BIT5_MASK                  32
#define TC3H_BIT6_MASK                  64
#define TC3H_BIT7_MASK                  128
#define TC3H_BIT8_MASK                  256
#define TC3H_BIT9_MASK                  512
#define TC3H_BIT10_MASK                 1024
#define TC3H_BIT11_MASK                 2048
#define TC3H_BIT12_MASK                 4096
#define TC3H_BIT13_MASK                 8192
#define TC3H_BIT14_MASK                 16384
#define TC3H_BIT15_MASK                 32768


 ATD1CTL01 - ATD 1 Control Register 01; 0x00000080 
typedef union {
  word Word;
    Overlapped registers 
  struct {
     ATD1CTL0 - ATD 1 Control Register 0; 0x00000080 
    union {
      byte Byte;
      struct {
        byte WRAP0       1;                                        Wrap Around Channel Select Bit 0 
        byte WRAP1       1;                                        Wrap Around Channel Select Bit 1 
        byte WRAP2       1;                                        Wrap Around Channel Select Bit 2 
        byte WRAP3       1;                                        Wrap Around Channel Select Bit 3 
        byte             1; 
        byte             1; 
        byte             1; 
        byte             1; 
      } Bits;
      struct {
        byte grpWRAP 4;
        byte     1;
        byte     1;
        byte     1;
        byte     1;
      } MergedBits;
    } ATD1CTL0STR;
    #define ATD1CTL0                    _ATD1CTL01.Overlap_STR.ATD1CTL0STR.Byte
    #define ATD1CTL0_WRAP0              _ATD1CTL01.Overlap_STR.ATD1CTL0STR.Bits.WRAP0
    #define ATD1CTL0_WRAP1              _ATD1CTL01.Overlap_STR.ATD1CTL0STR.Bits.WRAP1
    #define ATD1CTL0_WRAP2              _ATD1CTL01.Overlap_STR.ATD1CTL0STR.Bits.WRAP2
    #define ATD1CTL0_WRAP3              _ATD1CTL01.Overlap_STR.ATD1CTL0STR.Bits.WRAP3
    
     ATD1CTL_ARR Access 6 ATD1CTLx registers in an array 
    #define ATD1CTL_ARR                 ((volatile byte ) &ATD1CTL0)
    #define ATD1CTL0_WRAP               _ATD1CTL01.Overlap_STR.ATD1CTL0STR.MergedBits.grpWRAP
    
    #define ATD1CTL0_WRAP0_MASK         1
    #define ATD1CTL0_WRAP1_MASK         2
    #define ATD1CTL0_WRAP2_MASK         4
    #define ATD1CTL0_WRAP3_MASK         8
    #define ATD1CTL0_WRAP_MASK          15
    #define ATD1CTL0_WRAP_BITNUM        0


     ATD1CTL1 - ATD1 Control Register 1; 0x00000081 
    union {
      byte Byte;
      struct {
        byte ETRIGCH0    1;                                        External Trigger Channel Select Bit 0 
        byte ETRIGCH1    1;                                        External Trigger Channel Select Bit 1 
        byte ETRIGCH2    1;                                        External Trigger Channel Select Bit 2 
        byte ETRIGCH3    1;                                        External Trigger Channel Select Bit 3 
        byte             1; 
        byte             1; 
        byte             1; 
        byte ETRIGSEL    1;                                        External Trigger Source Select 
      } Bits;
      struct {
        byte grpETRIGCH 4;
        byte     1;
        byte     1;
        byte     1;
        byte     1;
      } MergedBits;
    } ATD1CTL1STR;
    #define ATD1CTL1                    _ATD1CTL01.Overlap_STR.ATD1CTL1STR.Byte
    #define ATD1CTL1_ETRIGCH0           _ATD1CTL01.Overlap_STR.ATD1CTL1STR.Bits.ETRIGCH0
    #define ATD1CTL1_ETRIGCH1           _ATD1CTL01.Overlap_STR.ATD1CTL1STR.Bits.ETRIGCH1
    #define ATD1CTL1_ETRIGCH2           _ATD1CTL01.Overlap_STR.ATD1CTL1STR.Bits.ETRIGCH2
    #define ATD1CTL1_ETRIGCH3           _ATD1CTL01.Overlap_STR.ATD1CTL1STR.Bits.ETRIGCH3
    #define ATD1CTL1_ETRIGSEL           _ATD1CTL01.Overlap_STR.ATD1CTL1STR.Bits.ETRIGSEL
    
    #define ATD1CTL1_ETRIGCH            _ATD1CTL01.Overlap_STR.ATD1CTL1STR.MergedBits.grpETRIGCH
    
