gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
    #define ATD1CTL3_FRZ0_MASK          1
    #define ATD1CTL3_FRZ1_MASK          2
    #define ATD1CTL3_FIFO_MASK          4
    #define ATD1CTL3_S1C_MASK           8
    #define ATD1CTL3_S2C_MASK           16
    #define ATD1CTL3_S4C_MASK           32
    #define ATD1CTL3_S8C_MASK           64
    #define ATD1CTL3_FRZ_MASK           3
    #define ATD1CTL3_FRZ_BITNUM         0

  } Overlap_STR;

  struct {
    word FRZ0        1;                                        Background Debug Freeze Enable Bit 0 
    word FRZ1        1;                                        Background Debug Freeze Enable Bit 1 
    word FIFO        1;                                        Result Register FIFO Mode 
    word S1C         1;                                        Conversion Sequence Length 1 
    word S2C         1;                                        Conversion Sequence Length 2 
    word S4C         1;                                        Conversion Sequence Length 4 
    word S8C         1;                                        Conversion Sequence Length 8 
    word             1; 
    word ASCIF       1;                                        ATD 1 Sequence Complete Interrupt Flag 
    word ASCIE       1;                                        ATD 1 Sequence Complete Interrupt Enable 
    word ETRIGE      1;                                        External Trigger Mode enable 
    word ETRIGP      1;                                        External Trigger Polarity 
    word ETRIGLE     1;                                        External Trigger LevelEdge control 
    word AWAI        1;                                        ATD Power Down in Wait Mode 
    word AFFC        1;                                        ATD Fast Conversion Complete Flag Clear 
    word ADPU        1;                                        ATD Disable  Power Down 
  } Bits;
  struct {
    word grpFRZ  2;
    word         1;
    word         1;
    word         1;
    word         1;
    word         1;
    word         1;
    word         1;
    word         1;
    word         1;
    word         1;
    word         1;
    word         1;
    word         1;
    word         1;
  } MergedBits;
} ATD1CTL23STR;
extern volatile ATD1CTL23STR _ATD1CTL23 @(REG_BASE + 0x00000082);
#define ATD1CTL23                       _ATD1CTL23.Word
#define ATD1CTL23_FRZ0                  _ATD1CTL23.Bits.FRZ0
#define ATD1CTL23_FRZ1                  _ATD1CTL23.Bits.FRZ1
#define ATD1CTL23_FIFO                  _ATD1CTL23.Bits.FIFO
#define ATD1CTL23_S1C                   _ATD1CTL23.Bits.S1C
#define ATD1CTL23_S2C                   _ATD1CTL23.Bits.S2C
#define ATD1CTL23_S4C                   _ATD1CTL23.Bits.S4C
#define ATD1CTL23_S8C                   _ATD1CTL23.Bits.S8C
#define ATD1CTL23_ASCIF                 _ATD1CTL23.Bits.ASCIF
#define ATD1CTL23_ASCIE                 _ATD1CTL23.Bits.ASCIE
#define ATD1CTL23_ETRIGE                _ATD1CTL23.Bits.ETRIGE
#define ATD1CTL23_ETRIGP                _ATD1CTL23.Bits.ETRIGP
#define ATD1CTL23_ETRIGLE               _ATD1CTL23.Bits.ETRIGLE
#define ATD1CTL23_AWAI                  _ATD1CTL23.Bits.AWAI
#define ATD1CTL23_AFFC                  _ATD1CTL23.Bits.AFFC
#define ATD1CTL23_ADPU                  _ATD1CTL23.Bits.ADPU
#define ATD1CTL23_FRZ                   _ATD1CTL23.MergedBits.grpFRZ

#define ATD1CTL23_FRZ0_MASK             1
#define ATD1CTL23_FRZ1_MASK             2
#define ATD1CTL23_FIFO_MASK             4
#define ATD1CTL23_S1C_MASK              8
#define ATD1CTL23_S2C_MASK              16
#define ATD1CTL23_S4C_MASK              32
#define ATD1CTL23_S8C_MASK              64
#define ATD1CTL23_ASCIF_MASK            256
#define ATD1CTL23_ASCIE_MASK            512
#define ATD1CTL23_ETRIGE_MASK           1024
#define ATD1CTL23_ETRIGP_MASK           2048
#define ATD1CTL23_ETRIGLE_MASK          4096
#define ATD1CTL23_AWAI_MASK             8192
#define ATD1CTL23_AFFC_MASK             16384
#define ATD1CTL23_ADPU_MASK             32768
#define ATD1CTL23_FRZ_MASK              3
#define ATD1CTL23_FRZ_BITNUM            0


 ATD1CTL45 - ATD 1 Control Register 45; 0x00000084 
typedef union {
  word Word;
    Overlapped registers 
  struct {
     ATD1CTL4 - ATD 1 Control Register 4; 0x00000084 
    union {
      byte Byte;
      struct {
        byte PRS0        1;                                        ATD Clock Prescaler 0 
        byte PRS1        1;                                        ATD Clock Prescaler 1 
        byte PRS2        1;                                        ATD Clock Prescaler 2 
        byte PRS3        1;                                        ATD Clock Prescaler 3 
        byte PRS4        1;                                        ATD Clock Prescaler 4 
        byte SMP0        1;                                        Sample Time Select 0 
        byte SMP1        1;                                        Sample Time Select 1 
        byte SRES8       1;                                        ATD Resolution Select 
      } Bits;
      struct {
        byte grpPRS 5;
        byte grpSMP 2;
        byte grpSRES_8 1;
      } MergedBits;
    } ATD1CTL4STR;
    #define ATD1CTL4                    _ATD1CTL45.Overlap_STR.ATD1CTL4STR.Byte
    #define ATD1CTL4_PRS0               _ATD1CTL45.Overlap_STR.ATD1CTL4STR.Bits.PRS0
    #define ATD1CTL4_PRS1               _ATD1CTL45.Overlap_STR.ATD1CTL4STR.Bits.PRS1
    #define ATD1CTL4_PRS2               _ATD1CTL45.Overlap_STR.ATD1CTL4STR.Bits.PRS2
    #define ATD1CTL4_PRS3               _ATD1CTL45.Overlap_STR.ATD1CTL4STR.Bits.PRS3
    #define ATD1CTL4_PRS4               _ATD1CTL45.Overlap_STR.ATD1CTL4STR.Bits.PRS4
    #define ATD1CTL4_SMP0               _ATD1CTL45.Overlap_STR.ATD1CTL4STR.Bits.SMP0
    #define ATD1CTL4_SMP1               _ATD1CTL45.Overlap_STR.ATD1CTL4STR.Bits.SMP1
    #define ATD1CTL4_SRES8              _ATD1CTL45.Overlap_STR.ATD1CTL4STR.Bits.SRES8
    
    #define ATD1CTL4_PRS                _ATD1CTL45.Overlap_STR.ATD1CTL4STR.MergedBits.grpPRS
    #define ATD1CTL4_SMP                _ATD1CTL45.Overlap_STR.ATD1CTL4STR.MergedBits.grpSMP
    
    #define ATD1CTL4_PRS0_MASK          1
    #define ATD1CTL4_PRS1_MASK          2
    #define ATD1CTL4_PRS2_MASK          4
    #define ATD1CTL4_PRS3_MASK          8
    #define ATD1CTL4_PRS4_MASK          16
    #define ATD1CTL4_SMP0_MASK          32
    #define ATD1CTL4_SMP1_MASK          64
    #define ATD1CTL4_SRES8_MASK         128
    #define ATD1CTL4_PRS_MASK           31
    #define ATD1CTL4_PRS_BITNUM         0
    #define ATD1CTL4_SMP_MASK           96
    #define ATD1CTL4_SMP_BITNUM         5


