gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
     ATD1CTL5 - ATD 1 Control Register 5; 0x00000085 
    union {
      byte Byte;
      struct {
        byte CA          1;                                        Analog Input Channel Select Code A 
        byte CB          1;                                        Analog Input Channel Select Code B 
        byte CC          1;                                        Analog Input Channel Select Code C 
        byte CD          1;                                        Analog Input Channel Select Code D 
        byte MULT        1;                                        Multi-Channel Sample Mode 
        byte SCAN        1;                                        Continuous Conversion Sequence Mode 
        byte DSGN        1;                                        SignedUnsigned Result Data Mode 
        byte DJM         1;                                        Result Register Data Justification Mode 
      } Bits;
      struct {
        byte grpCx 4;
        byte     1;
        byte     1;
        byte     1;
        byte     1;
      } MergedBits;
    } ATD1CTL5STR;
    #define ATD1CTL5                    _ATD1CTL45.Overlap_STR.ATD1CTL5STR.Byte
    #define ATD1CTL5_CA                 _ATD1CTL45.Overlap_STR.ATD1CTL5STR.Bits.CA
    #define ATD1CTL5_CB                 _ATD1CTL45.Overlap_STR.ATD1CTL5STR.Bits.CB
    #define ATD1CTL5_CC                 _ATD1CTL45.Overlap_STR.ATD1CTL5STR.Bits.CC
    #define ATD1CTL5_CD                 _ATD1CTL45.Overlap_STR.ATD1CTL5STR.Bits.CD
    #define ATD1CTL5_MULT               _ATD1CTL45.Overlap_STR.ATD1CTL5STR.Bits.MULT
    #define ATD1CTL5_SCAN               _ATD1CTL45.Overlap_STR.ATD1CTL5STR.Bits.SCAN
    #define ATD1CTL5_DSGN               _ATD1CTL45.Overlap_STR.ATD1CTL5STR.Bits.DSGN
    #define ATD1CTL5_DJM                _ATD1CTL45.Overlap_STR.ATD1CTL5STR.Bits.DJM
    
    #define ATD1CTL5_Cx                 _ATD1CTL45.Overlap_STR.ATD1CTL5STR.MergedBits.grpCx
    
    #define ATD1CTL5_CA_MASK            1
    #define ATD1CTL5_CB_MASK            2
    #define ATD1CTL5_CC_MASK            4
    #define ATD1CTL5_CD_MASK            8
    #define ATD1CTL5_MULT_MASK          16
    #define ATD1CTL5_SCAN_MASK          32
    #define ATD1CTL5_DSGN_MASK          64
    #define ATD1CTL5_DJM_MASK           128
    #define ATD1CTL5_Cx_MASK            15
    #define ATD1CTL5_Cx_BITNUM          0

  } Overlap_STR;

  struct {
    word CA          1;                                        Analog Input Channel Select Code A 
    word CB          1;                                        Analog Input Channel Select Code B 
    word CC          1;                                        Analog Input Channel Select Code C 
    word CD          1;                                        Analog Input Channel Select Code D 
    word MULT        1;                                        Multi-Channel Sample Mode 
    word SCAN        1;                                        Continuous Conversion Sequence Mode 
    word DSGN        1;                                        SignedUnsigned Result Data Mode 
    word DJM         1;                                        Result Register Data Justification Mode 
    word PRS0        1;                                        ATD Clock Prescaler 0 
    word PRS1        1;                                        ATD Clock Prescaler 1 
    word PRS2        1;                                        ATD Clock Prescaler 2 
    word PRS3        1;                                        ATD Clock Prescaler 3 
    word PRS4        1;                                        ATD Clock Prescaler 4 
    word SMP0        1;                                        Sample Time Select 0 
    word SMP1        1;                                        Sample Time Select 1 
    word SRES8       1;                                        ATD Resolution Select 
  } Bits;
  struct {
    word grpCx   4;
    word         1;
    word         1;
    word         1;
    word         1;
    word grpPRS  5;
    word grpSMP  2;
    word grpSRES_8 1;
  } MergedBits;
} ATD1CTL45STR;
extern volatile ATD1CTL45STR _ATD1CTL45 @(REG_BASE + 0x00000084);
#define ATD1CTL45                       _ATD1CTL45.Word
#define ATD1CTL45_CA                    _ATD1CTL45.Bits.CA
#define ATD1CTL45_CB                    _ATD1CTL45.Bits.CB
#define ATD1CTL45_CC                    _ATD1CTL45.Bits.CC
#define ATD1CTL45_CD                    _ATD1CTL45.Bits.CD
#define ATD1CTL45_MULT                  _ATD1CTL45.Bits.MULT
#define ATD1CTL45_SCAN                  _ATD1CTL45.Bits.SCAN
#define ATD1CTL45_DSGN                  _ATD1CTL45.Bits.DSGN
#define ATD1CTL45_DJM                   _ATD1CTL45.Bits.DJM
#define ATD1CTL45_PRS0                  _ATD1CTL45.Bits.PRS0
#define ATD1CTL45_PRS1                  _ATD1CTL45.Bits.PRS1
#define ATD1CTL45_PRS2                  _ATD1CTL45.Bits.PRS2
#define ATD1CTL45_PRS3                  _ATD1CTL45.Bits.PRS3
#define ATD1CTL45_PRS4                  _ATD1CTL45.Bits.PRS4
#define ATD1CTL45_SMP0                  _ATD1CTL45.Bits.SMP0
#define ATD1CTL45_SMP1                  _ATD1CTL45.Bits.SMP1
#define ATD1CTL45_SRES8                 _ATD1CTL45.Bits.SRES8
#define ATD1CTL45_Cx                    _ATD1CTL45.MergedBits.grpCx
#define ATD1CTL45_PRS                   _ATD1CTL45.MergedBits.grpPRS
#define ATD1CTL45_SMP                   _ATD1CTL45.MergedBits.grpSMP

#define ATD1CTL45_CA_MASK               1
#define ATD1CTL45_CB_MASK               2
#define ATD1CTL45_CC_MASK               4
#define ATD1CTL45_CD_MASK               8
#define ATD1CTL45_MULT_MASK             16
#define ATD1CTL45_SCAN_MASK             32
#define ATD1CTL45_DSGN_MASK             64
#define ATD1CTL45_DJM_MASK              128
#define ATD1CTL45_PRS0_MASK             256
#define ATD1CTL45_PRS1_MASK             512
#define ATD1CTL45_PRS2_MASK             1024
#define ATD1CTL45_PRS3_MASK             2048
#define ATD1CTL45_PRS4_MASK             4096
#define ATD1CTL45_SMP0_MASK             8192
#define ATD1CTL45_SMP1_MASK             16384
#define ATD1CTL45_SRES8_MASK            32768
#define ATD1CTL45_Cx_MASK               15
#define ATD1CTL45_Cx_BITNUM             0
#define ATD1CTL45_PRS_MASK              7936
#define ATD1CTL45_PRS_BITNUM            8
#define ATD1CTL45_SMP_MASK              24576
#define ATD1CTL45_SMP_BITNUM            13


