gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
 ATD1STAT0 - ATD 1 Status Register 0; 0x00000086 
typedef union {
  byte Byte;
  struct {
    byte CC0         1;                                        Conversion Counter 0 
    byte CC1         1;                                        Conversion Counter 1 
    byte CC2         1;                                        Conversion Counter 2 
    byte CC3         1;                                        Conversion Counter 3 
    byte FIFOR       1;                                        FIFO Over Run Flag 
    byte ETORF       1;                                        External Trigger Overrun Flag 
    byte             1; 
    byte SCF         1;                                        Sequence Complete Flag 
  } Bits;
  struct {
    byte grpCC   4;
    byte         1;
    byte         1;
    byte         1;
    byte         1;
  } MergedBits;
} ATD1STAT0STR;
extern volatile ATD1STAT0STR _ATD1STAT0 @(REG_BASE + 0x00000086);
#define ATD1STAT0                       _ATD1STAT0.Byte
#define ATD1STAT0_CC0                   _ATD1STAT0.Bits.CC0
#define ATD1STAT0_CC1                   _ATD1STAT0.Bits.CC1
#define ATD1STAT0_CC2                   _ATD1STAT0.Bits.CC2
#define ATD1STAT0_CC3                   _ATD1STAT0.Bits.CC3
#define ATD1STAT0_FIFOR                 _ATD1STAT0.Bits.FIFOR
#define ATD1STAT0_ETORF                 _ATD1STAT0.Bits.ETORF
#define ATD1STAT0_SCF                   _ATD1STAT0.Bits.SCF
#define ATD1STAT0_CC                    _ATD1STAT0.MergedBits.grpCC

#define ATD1STAT0_CC0_MASK              1
#define ATD1STAT0_CC1_MASK              2
#define ATD1STAT0_CC2_MASK              4
#define ATD1STAT0_CC3_MASK              8
#define ATD1STAT0_FIFOR_MASK            16
#define ATD1STAT0_ETORF_MASK            32
#define ATD1STAT0_SCF_MASK              128
#define ATD1STAT0_CC_MASK               15
#define ATD1STAT0_CC_BITNUM             0


 ATD1TEST1 - ATD1 Test Register; 0x00000089 
typedef union {
  byte Byte;
  struct {
    byte SC          1;                                        Special Channel Conversion Bit 
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
  } Bits;
} ATD1TEST1STR;
extern volatile ATD1TEST1STR _ATD1TEST1 @(REG_BASE + 0x00000089);
#define ATD1TEST1                       _ATD1TEST1.Byte
#define ATD1TEST1_SC                    _ATD1TEST1.Bits.SC

#define ATD1TEST1_SC_MASK               1


 ATD1STAT2 - ATD 1 Status Register 2; 0x0000008A 
typedef union {
  byte Byte;
  struct {
    byte CCF8        1;                                        Conversion Complete Flag 8 
    byte CCF9        1;                                        Conversion Complete Flag 9 
    byte CCF10       1;                                        Conversion Complete Flag 10 
    byte CCF11       1;                                        Conversion Complete Flag 11 
    byte CCF12       1;                                        Conversion Complete Flag 12 
    byte CCF13       1;                                        Conversion Complete Flag 13 
    byte CCF14       1;                                        Conversion Complete Flag 14 
    byte CCF15       1;                                        Conversion Complete Flag 15 
  } Bits;
} ATD1STAT2STR;
extern volatile ATD1STAT2STR _ATD1STAT2 @(REG_BASE + 0x0000008A);
#define ATD1STAT2                       _ATD1STAT2.Byte
#define ATD1STAT2_CCF8                  _ATD1STAT2.Bits.CCF8
#define ATD1STAT2_CCF9                  _ATD1STAT2.Bits.CCF9
#define ATD1STAT2_CCF10                 _ATD1STAT2.Bits.CCF10
#define ATD1STAT2_CCF11                 _ATD1STAT2.Bits.CCF11
#define ATD1STAT2_CCF12                 _ATD1STAT2.Bits.CCF12
#define ATD1STAT2_CCF13                 _ATD1STAT2.Bits.CCF13
#define ATD1STAT2_CCF14                 _ATD1STAT2.Bits.CCF14
#define ATD1STAT2_CCF15                 _ATD1STAT2.Bits.CCF15

#define ATD1STAT2_CCF8_MASK             1
#define ATD1STAT2_CCF9_MASK             2
#define ATD1STAT2_CCF10_MASK            4
#define ATD1STAT2_CCF11_MASK            8
#define ATD1STAT2_CCF12_MASK            16
#define ATD1STAT2_CCF13_MASK            32
#define ATD1STAT2_CCF14_MASK            64
#define ATD1STAT2_CCF15_MASK            128


 ATD1STAT1 - ATD 1 Status Register 1; 0x0000008B 
typedef union {
  byte Byte;
  struct {
    byte CCF0        1;                                        Conversion Complete Flag 0 
    byte CCF1        1;                                        Conversion Complete Flag 1 
    byte CCF2        1;                                        Conversion Complete Flag 2 
    byte CCF3        1;                                        Conversion Complete Flag 3 
    byte CCF4        1;                                        Conversion Complete Flag 4 
    byte CCF5        1;                                        Conversion Complete Flag 5 
    byte CCF6        1;                                        Conversion Complete Flag 6 
    byte CCF7        1;                                        Conversion Complete Flag 7 
  } Bits;
} ATD1STAT1STR;
extern volatile ATD1STAT1STR _ATD1STAT1 @(REG_BASE + 0x0000008B);
#define ATD1STAT1                       _ATD1STAT1.Byte
#define ATD1STAT1_CCF0                  _ATD1STAT1.Bits.CCF0
#define ATD1STAT1_CCF1                  _ATD1STAT1.Bits.CCF1
#define ATD1STAT1_CCF2                  _ATD1STAT1.Bits.CCF2
#define ATD1STAT1_CCF3                  _ATD1STAT1.Bits.CCF3
#define ATD1STAT1_CCF4                  _ATD1STAT1.Bits.CCF4
#define ATD1STAT1_CCF5                  _ATD1STAT1.Bits.CCF5
#define ATD1STAT1_CCF6                  _ATD1STAT1.Bits.CCF6
#define ATD1STAT1_CCF7                  _ATD1STAT1.Bits.CCF7

#define ATD1STAT1_CCF0_MASK             1
#define ATD1STAT1_CCF1_MASK             2
#define ATD1STAT1_CCF2_MASK             4
#define ATD1STAT1_CCF3_MASK             8
#define ATD1STAT1_CCF4_MASK             16
#define ATD1STAT1_CCF5_MASK             32
#define ATD1STAT1_CCF6_MASK             64
#define ATD1STAT1_CCF7_MASK             128


 ATD1DIEN - ATD 1 Input Enable Register; 0x0000008C 
typedef union {
  word Word;
    Overlapped registers 
  struct {
     ATD1DIEN0 - ATD 1 Input Enable Register 0; 0x0000008C 
    union {
      byte Byte;
      struct {
        byte IEN8        1;                                        ATD Digital Input Enable on channel 8 
        byte IEN9        1;                                        ATD Digital Input Enable on channel 9 
        byte IEN10       1;                                        ATD Digital Input Enable on channel 10 
        byte IEN11       1;                                        ATD Digital Input Enable on channel 11 
        byte IEN12       1;                                        ATD Digital Input Enable on channel 12 
        byte IEN13       1;                                        ATD Digital Input Enable on channel 13 
        byte IEN14       1;                                        ATD Digital Input Enable on channel 14 
        byte IEN15       1;                                        ATD Digital Input Enable on channel 15 
      } Bits;
    } ATD1DIEN0STR;
    #define ATD1DIEN0                   _ATD1DIEN.Overlap_STR.ATD1DIEN0STR.Byte
    #define ATD1DIEN0_IEN8              _ATD1DIEN.Overlap_STR.ATD1DIEN0STR.Bits.IEN8
    #define ATD1DIEN0_IEN9              _ATD1DIEN.Overlap_STR.ATD1DIEN0STR.Bits.IEN9
    #define ATD1DIEN0_IEN10             _ATD1DIEN.Overlap_STR.ATD1DIEN0STR.Bits.IEN10
    #define ATD1DIEN0_IEN11             _ATD1DIEN.Overlap_STR.ATD1DIEN0STR.Bits.IEN11
    #define ATD1DIEN0_IEN12             _ATD1DIEN.Overlap_STR.ATD1DIEN0STR.Bits.IEN12
    #define ATD1DIEN0_IEN13             _ATD1DIEN.Overlap_STR.ATD1DIEN0STR.Bits.IEN13
    #define ATD1DIEN0_IEN14             _ATD1DIEN.Overlap_STR.ATD1DIEN0STR.Bits.IEN14
    #define ATD1DIEN0_IEN15             _ATD1DIEN.Overlap_STR.ATD1DIEN0STR.Bits.IEN15
    
