gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
     ATD1DIEN_ARR Access 2 ATD1DIENx registers in an array 
    #define ATD1DIEN_ARR                ((volatile byte ) &ATD1DIEN0)
    
    #define ATD1DIEN0_IEN8_MASK         1
    #define ATD1DIEN0_IEN9_MASK         2
    #define ATD1DIEN0_IEN10_MASK        4
    #define ATD1DIEN0_IEN11_MASK        8
    #define ATD1DIEN0_IEN12_MASK        16
    #define ATD1DIEN0_IEN13_MASK        32
    #define ATD1DIEN0_IEN14_MASK        64
    #define ATD1DIEN0_IEN15_MASK        128


     ATD1DIEN1 - ATD 1 Input Enable Register 1; 0x0000008D 
    union {
      byte Byte;
      struct {
        byte IEN0        1;                                        ATD Digital Input Enable on channel 0 
        byte IEN1        1;                                        ATD Digital Input Enable on channel 1 
        byte IEN2        1;                                        ATD Digital Input Enable on channel 2 
        byte IEN3        1;                                        ATD Digital Input Enable on channel 3 
        byte IEN4        1;                                        ATD Digital Input Enable on channel 4 
        byte IEN5        1;                                        ATD Digital Input Enable on channel 5 
        byte IEN6        1;                                        ATD Digital Input Enable on channel 6 
        byte IEN7        1;                                        ATD Digital Input Enable on channel 7 
      } Bits;
    } ATD1DIEN1STR;
    #define ATD1DIEN1                   _ATD1DIEN.Overlap_STR.ATD1DIEN1STR.Byte
    #define ATD1DIEN1_IEN0              _ATD1DIEN.Overlap_STR.ATD1DIEN1STR.Bits.IEN0
    #define ATD1DIEN1_IEN1              _ATD1DIEN.Overlap_STR.ATD1DIEN1STR.Bits.IEN1
    #define ATD1DIEN1_IEN2              _ATD1DIEN.Overlap_STR.ATD1DIEN1STR.Bits.IEN2
    #define ATD1DIEN1_IEN3              _ATD1DIEN.Overlap_STR.ATD1DIEN1STR.Bits.IEN3
    #define ATD1DIEN1_IEN4              _ATD1DIEN.Overlap_STR.ATD1DIEN1STR.Bits.IEN4
    #define ATD1DIEN1_IEN5              _ATD1DIEN.Overlap_STR.ATD1DIEN1STR.Bits.IEN5
    #define ATD1DIEN1_IEN6              _ATD1DIEN.Overlap_STR.ATD1DIEN1STR.Bits.IEN6
    #define ATD1DIEN1_IEN7              _ATD1DIEN.Overlap_STR.ATD1DIEN1STR.Bits.IEN7
    
    
    #define ATD1DIEN1_IEN0_MASK         1
    #define ATD1DIEN1_IEN1_MASK         2
    #define ATD1DIEN1_IEN2_MASK         4
    #define ATD1DIEN1_IEN3_MASK         8
    #define ATD1DIEN1_IEN4_MASK         16
    #define ATD1DIEN1_IEN5_MASK         32
    #define ATD1DIEN1_IEN6_MASK         64
    #define ATD1DIEN1_IEN7_MASK         128

  } Overlap_STR;

  struct {
    word IEN0        1;                                        ATD Digital Input Enable on channel 0 
    word IEN1        1;                                        ATD Digital Input Enable on channel 1 
    word IEN2        1;                                        ATD Digital Input Enable on channel 2 
    word IEN3        1;                                        ATD Digital Input Enable on channel 3 
    word IEN4        1;                                        ATD Digital Input Enable on channel 4 
    word IEN5        1;                                        ATD Digital Input Enable on channel 5 
    word IEN6        1;                                        ATD Digital Input Enable on channel 6 
    word IEN7        1;                                        ATD Digital Input Enable on channel 7 
    word IEN8        1;                                        ATD Digital Input Enable on channel 8 
    word IEN9        1;                                        ATD Digital Input Enable on channel 9 
    word IEN10       1;                                        ATD Digital Input Enable on channel 10 
    word IEN11       1;                                        ATD Digital Input Enable on channel 11 
    word IEN12       1;                                        ATD Digital Input Enable on channel 12 
    word IEN13       1;                                        ATD Digital Input Enable on channel 13 
    word IEN14       1;                                        ATD Digital Input Enable on channel 14 
    word IEN15       1;                                        ATD Digital Input Enable on channel 15 
  } Bits;
} ATD1DIENSTR;
extern volatile ATD1DIENSTR _ATD1DIEN @(REG_BASE + 0x0000008C);
#define ATD1DIEN                        _ATD1DIEN.Word
#define ATD1DIEN_IEN0                   _ATD1DIEN.Bits.IEN0
#define ATD1DIEN_IEN1                   _ATD1DIEN.Bits.IEN1
#define ATD1DIEN_IEN2                   _ATD1DIEN.Bits.IEN2
#define ATD1DIEN_IEN3                   _ATD1DIEN.Bits.IEN3
#define ATD1DIEN_IEN4                   _ATD1DIEN.Bits.IEN4
#define ATD1DIEN_IEN5                   _ATD1DIEN.Bits.IEN5
#define ATD1DIEN_IEN6                   _ATD1DIEN.Bits.IEN6
#define ATD1DIEN_IEN7                   _ATD1DIEN.Bits.IEN7
#define ATD1DIEN_IEN8                   _ATD1DIEN.Bits.IEN8
#define ATD1DIEN_IEN9                   _ATD1DIEN.Bits.IEN9
#define ATD1DIEN_IEN10                  _ATD1DIEN.Bits.IEN10
#define ATD1DIEN_IEN11                  _ATD1DIEN.Bits.IEN11
#define ATD1DIEN_IEN12                  _ATD1DIEN.Bits.IEN12
#define ATD1DIEN_IEN13                  _ATD1DIEN.Bits.IEN13
#define ATD1DIEN_IEN14                  _ATD1DIEN.Bits.IEN14
#define ATD1DIEN_IEN15                  _ATD1DIEN.Bits.IEN15

#define ATD1DIEN_IEN0_MASK              1
#define ATD1DIEN_IEN1_MASK              2
#define ATD1DIEN_IEN2_MASK              4
#define ATD1DIEN_IEN3_MASK              8
#define ATD1DIEN_IEN4_MASK              16
#define ATD1DIEN_IEN5_MASK              32
#define ATD1DIEN_IEN6_MASK              64
#define ATD1DIEN_IEN7_MASK              128
#define ATD1DIEN_IEN8_MASK              256
#define ATD1DIEN_IEN9_MASK              512
#define ATD1DIEN_IEN10_MASK             1024
#define ATD1DIEN_IEN11_MASK             2048
#define ATD1DIEN_IEN12_MASK             4096
#define ATD1DIEN_IEN13_MASK             8192
#define ATD1DIEN_IEN14_MASK             16384
#define ATD1DIEN_IEN15_MASK             32768


 ATD1PTAD - ATD1 Port AD Register; 0x0000008E 
typedef union {
  word Word;
    Overlapped registers 
  struct {
     ATD1PTAD0 - ATD1 Port AD0 Register; 0x0000008E 
    union {
      byte Byte;
      struct {
        byte PTAD8       1;                                        AD Channel 8 (AN8) Digital Input 
        byte PTAD9       1;                                        AD Channel 9 (AN9) Digital Input 
        byte PTAD10      1;                                        AD Channel 10 (AN10) Digital Input 
        byte PTAD11      1;                                        AD Channel 11 (AN11) Digital Input 
        byte PTAD12      1;                                        AD Channel 12 (AN12) Digital Input 
        byte PTAD13      1;                                        AD Channel 13 (AN13) Digital Input 
        byte PTAD14      1;                                        AD Channel 14 (AN14) Digital Input 
        byte PTAD15      1;                                        AD Channel 15 (AN15) Digital Input 
      } Bits;
    } ATD1PTAD0STR;
    #define ATD1PTAD0                   _ATD1PTAD.Overlap_STR.ATD1PTAD0STR.Byte
    #define ATD1PTAD0_PTAD8             _ATD1PTAD.Overlap_STR.ATD1PTAD0STR.Bits.PTAD8
    #define ATD1PTAD0_PTAD9             _ATD1PTAD.Overlap_STR.ATD1PTAD0STR.Bits.PTAD9
    #define ATD1PTAD0_PTAD10            _ATD1PTAD.Overlap_STR.ATD1PTAD0STR.Bits.PTAD10
    #define ATD1PTAD0_PTAD11            _ATD1PTAD.Overlap_STR.ATD1PTAD0STR.Bits.PTAD11
    #define ATD1PTAD0_PTAD12            _ATD1PTAD.Overlap_STR.ATD1PTAD0STR.Bits.PTAD12
    #define ATD1PTAD0_PTAD13            _ATD1PTAD.Overlap_STR.ATD1PTAD0STR.Bits.PTAD13
    #define ATD1PTAD0_PTAD14            _ATD1PTAD.Overlap_STR.ATD1PTAD0STR.Bits.PTAD14
    #define ATD1PTAD0_PTAD15            _ATD1PTAD.Overlap_STR.ATD1PTAD0STR.Bits.PTAD15
    
     ATD1PTAD_ARR Access 2 ATD1PTADx registers in an array 
    #define ATD1PTAD_ARR                ((volatile byte ) &ATD1PTAD0)
    
    #define ATD1PTAD0_PTAD8_MASK        1
    #define ATD1PTAD0_PTAD9_MASK        2
    #define ATD1PTAD0_PTAD10_MASK       4
    #define ATD1PTAD0_PTAD11_MASK       8
    #define ATD1PTAD0_PTAD12_MASK       16
    #define ATD1PTAD0_PTAD13_MASK       32
    #define ATD1PTAD0_PTAD14_MASK       64
    #define ATD1PTAD0_PTAD15_MASK       128


