gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
     ATD1PTAD1 - ATD1 Port AD1 Register; 0x0000008F 
    union {
      byte Byte;
      struct {
        byte PTAD0       1;                                        AD Channel 0 (AN0) Digital Input 
        byte PTAD1       1;                                        AD Channel 1 (AN1) Digital Input 
        byte PTAD2       1;                                        AD Channel 2 (AN2) Digital Input 
        byte PTAD3       1;                                        AD Channel 3 (AN3) Digital Input 
        byte PTAD4       1;                                        AD Channel 4 (AN4) Digital Input 
        byte PTAD5       1;                                        AD Channel 5 (AN5) Digital Input 
        byte PTAD6       1;                                        AD Channel 6 (AN6) Digital Input 
        byte PTAD7       1;                                        AD Channel 7 (AN7) Digital Input 
      } Bits;
    } ATD1PTAD1STR;
    #define ATD1PTAD1                   _ATD1PTAD.Overlap_STR.ATD1PTAD1STR.Byte
    #define ATD1PTAD1_PTAD0             _ATD1PTAD.Overlap_STR.ATD1PTAD1STR.Bits.PTAD0
    #define ATD1PTAD1_PTAD1             _ATD1PTAD.Overlap_STR.ATD1PTAD1STR.Bits.PTAD1
    #define ATD1PTAD1_PTAD2             _ATD1PTAD.Overlap_STR.ATD1PTAD1STR.Bits.PTAD2
    #define ATD1PTAD1_PTAD3             _ATD1PTAD.Overlap_STR.ATD1PTAD1STR.Bits.PTAD3
    #define ATD1PTAD1_PTAD4             _ATD1PTAD.Overlap_STR.ATD1PTAD1STR.Bits.PTAD4
    #define ATD1PTAD1_PTAD5             _ATD1PTAD.Overlap_STR.ATD1PTAD1STR.Bits.PTAD5
    #define ATD1PTAD1_PTAD6             _ATD1PTAD.Overlap_STR.ATD1PTAD1STR.Bits.PTAD6
    #define ATD1PTAD1_PTAD7             _ATD1PTAD.Overlap_STR.ATD1PTAD1STR.Bits.PTAD7
    
    
    #define ATD1PTAD1_PTAD0_MASK        1
    #define ATD1PTAD1_PTAD1_MASK        2
    #define ATD1PTAD1_PTAD2_MASK        4
    #define ATD1PTAD1_PTAD3_MASK        8
    #define ATD1PTAD1_PTAD4_MASK        16
    #define ATD1PTAD1_PTAD5_MASK        32
    #define ATD1PTAD1_PTAD6_MASK        64
    #define ATD1PTAD1_PTAD7_MASK        128

  } Overlap_STR;

  struct {
    word PTAD0       1;                                        AD Channel 0 (AN0) Digital Input 
    word PTAD1       1;                                        AD Channel 1 (AN1) Digital Input 
    word PTAD2       1;                                        AD Channel 2 (AN2) Digital Input 
    word PTAD3       1;                                        AD Channel 3 (AN3) Digital Input 
    word PTAD4       1;                                        AD Channel 4 (AN4) Digital Input 
    word PTAD5       1;                                        AD Channel 5 (AN5) Digital Input 
    word PTAD6       1;                                        AD Channel 6 (AN6) Digital Input 
    word PTAD7       1;                                        AD Channel 7 (AN7) Digital Input 
    word PTAD8       1;                                        AD Channel 8 (AN8) Digital Input 
    word PTAD9       1;                                        AD Channel 9 (AN9) Digital Input 
    word PTAD10      1;                                        AD Channel 10 (AN10) Digital Input 
    word PTAD11      1;                                        AD Channel 11 (AN11) Digital Input 
    word PTAD12      1;                                        AD Channel 12 (AN12) Digital Input 
    word PTAD13      1;                                        AD Channel 13 (AN13) Digital Input 
    word PTAD14      1;                                        AD Channel 14 (AN14) Digital Input 
    word PTAD15      1;                                        AD Channel 15 (AN15) Digital Input 
  } Bits;
} ATD1PTADSTR;
extern volatile ATD1PTADSTR _ATD1PTAD @(REG_BASE + 0x0000008E);
#define ATD1PTAD                        _ATD1PTAD.Word
#define ATD1PTAD_PTAD0                  _ATD1PTAD.Bits.PTAD0
#define ATD1PTAD_PTAD1                  _ATD1PTAD.Bits.PTAD1
#define ATD1PTAD_PTAD2                  _ATD1PTAD.Bits.PTAD2
#define ATD1PTAD_PTAD3                  _ATD1PTAD.Bits.PTAD3
#define ATD1PTAD_PTAD4                  _ATD1PTAD.Bits.PTAD4
#define ATD1PTAD_PTAD5                  _ATD1PTAD.Bits.PTAD5
#define ATD1PTAD_PTAD6                  _ATD1PTAD.Bits.PTAD6
#define ATD1PTAD_PTAD7                  _ATD1PTAD.Bits.PTAD7
#define ATD1PTAD_PTAD8                  _ATD1PTAD.Bits.PTAD8
#define ATD1PTAD_PTAD9                  _ATD1PTAD.Bits.PTAD9
#define ATD1PTAD_PTAD10                 _ATD1PTAD.Bits.PTAD10
#define ATD1PTAD_PTAD11                 _ATD1PTAD.Bits.PTAD11
#define ATD1PTAD_PTAD12                 _ATD1PTAD.Bits.PTAD12
#define ATD1PTAD_PTAD13                 _ATD1PTAD.Bits.PTAD13
#define ATD1PTAD_PTAD14                 _ATD1PTAD.Bits.PTAD14
#define ATD1PTAD_PTAD15                 _ATD1PTAD.Bits.PTAD15

#define ATD1PTAD_PTAD0_MASK             1
#define ATD1PTAD_PTAD1_MASK             2
#define ATD1PTAD_PTAD2_MASK             4
#define ATD1PTAD_PTAD3_MASK             8
#define ATD1PTAD_PTAD4_MASK             16
#define ATD1PTAD_PTAD5_MASK             32
#define ATD1PTAD_PTAD6_MASK             64
#define ATD1PTAD_PTAD7_MASK             128
#define ATD1PTAD_PTAD8_MASK             256
#define ATD1PTAD_PTAD9_MASK             512
#define ATD1PTAD_PTAD10_MASK            1024
#define ATD1PTAD_PTAD11_MASK            2048
#define ATD1PTAD_PTAD12_MASK            4096
#define ATD1PTAD_PTAD13_MASK            8192
#define ATD1PTAD_PTAD14_MASK            16384
#define ATD1PTAD_PTAD15_MASK            32768


 ATD1DR0 - ATD 1 Conversion Result Register 0; 0x00000090 
typedef union {
  word Word;
    Overlapped registers 
  struct {
     ATD1DR0H - ATD 1 Conversion Result Register 0 High; 0x00000090 
    union {
      byte Byte;
      struct {
        byte BIT8        1;                                        Bit 8 
        byte BIT9        1;                                        Bit 9 
        byte BIT10       1;                                        Bit 10 
        byte BIT11       1;                                        Bit 11 
        byte BIT12       1;                                        Bit 12 
        byte BIT13       1;                                        Bit 13 
        byte BIT14       1;                                        Bit 14 
        byte BIT15       1;                                        Bit 15 
      } Bits;
    } ATD1DR0HSTR;
    #define ATD1DR0H                    _ATD1DR0.Overlap_STR.ATD1DR0HSTR.Byte
    #define ATD1DR0H_BIT8               _ATD1DR0.Overlap_STR.ATD1DR0HSTR.Bits.BIT8
    #define ATD1DR0H_BIT9               _ATD1DR0.Overlap_STR.ATD1DR0HSTR.Bits.BIT9
    #define ATD1DR0H_BIT10              _ATD1DR0.Overlap_STR.ATD1DR0HSTR.Bits.BIT10
    #define ATD1DR0H_BIT11              _ATD1DR0.Overlap_STR.ATD1DR0HSTR.Bits.BIT11
    #define ATD1DR0H_BIT12              _ATD1DR0.Overlap_STR.ATD1DR0HSTR.Bits.BIT12
    #define ATD1DR0H_BIT13              _ATD1DR0.Overlap_STR.ATD1DR0HSTR.Bits.BIT13
    #define ATD1DR0H_BIT14              _ATD1DR0.Overlap_STR.ATD1DR0HSTR.Bits.BIT14
    #define ATD1DR0H_BIT15              _ATD1DR0.Overlap_STR.ATD1DR0HSTR.Bits.BIT15
    
    
