gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
extern volatile ATD1DR2STR _ATD1DR2 @(REG_BASE + 0x00000094);
#define ATD1DR2                         _ATD1DR2.Word
#define ATD1DR2_BIT6                    _ATD1DR2.Bits.BIT6
#define ATD1DR2_BIT7                    _ATD1DR2.Bits.BIT7
#define ATD1DR2_BIT8                    _ATD1DR2.Bits.BIT8
#define ATD1DR2_BIT9                    _ATD1DR2.Bits.BIT9
#define ATD1DR2_BIT10                   _ATD1DR2.Bits.BIT10
#define ATD1DR2_BIT11                   _ATD1DR2.Bits.BIT11
#define ATD1DR2_BIT12                   _ATD1DR2.Bits.BIT12
#define ATD1DR2_BIT13                   _ATD1DR2.Bits.BIT13
#define ATD1DR2_BIT14                   _ATD1DR2.Bits.BIT14
#define ATD1DR2_BIT15                   _ATD1DR2.Bits.BIT15
#define ATD1DR2_BIT_6                   _ATD1DR2.MergedBits.grpBIT_6
#define ATD1DR2_BIT                     ATD1DR2_BIT_6

#define ATD1DR2_BIT6_MASK               64
#define ATD1DR2_BIT7_MASK               128
#define ATD1DR2_BIT8_MASK               256
#define ATD1DR2_BIT9_MASK               512
#define ATD1DR2_BIT10_MASK              1024
#define ATD1DR2_BIT11_MASK              2048
#define ATD1DR2_BIT12_MASK              4096
#define ATD1DR2_BIT13_MASK              8192
#define ATD1DR2_BIT14_MASK              16384
#define ATD1DR2_BIT15_MASK              32768
#define ATD1DR2_BIT_6_MASK              65472
#define ATD1DR2_BIT_6_BITNUM            6


 ATD1DR3 - ATD 1 Conversion Result Register 3; 0x00000096 
typedef union {
  word Word;
    Overlapped registers 
  struct {
     ATD1DR3H - ATD 1 Conversion Result Register 3 High; 0x00000096 
    union {
      byte Byte;
      struct {
        byte BIT8        1;                                        Bit 8 
        byte BIT9        1;                                        Bit 9 
        byte BIT10       1;                                        Bit 10 
        byte BIT11       1;                                        Bit 11 
        byte BIT12       1;                                        Bit 12 
        byte BIT13       1;                                        Bit 13 
        byte BIT14       1;                                        Bit 14 
        byte BIT15       1;                                        Bit 15 
      } Bits;
    } ATD1DR3HSTR;
    #define ATD1DR3H                    _ATD1DR3.Overlap_STR.ATD1DR3HSTR.Byte
    #define ATD1DR3H_BIT8               _ATD1DR3.Overlap_STR.ATD1DR3HSTR.Bits.BIT8
    #define ATD1DR3H_BIT9               _ATD1DR3.Overlap_STR.ATD1DR3HSTR.Bits.BIT9
    #define ATD1DR3H_BIT10              _ATD1DR3.Overlap_STR.ATD1DR3HSTR.Bits.BIT10
    #define ATD1DR3H_BIT11              _ATD1DR3.Overlap_STR.ATD1DR3HSTR.Bits.BIT11
    #define ATD1DR3H_BIT12              _ATD1DR3.Overlap_STR.ATD1DR3HSTR.Bits.BIT12
    #define ATD1DR3H_BIT13              _ATD1DR3.Overlap_STR.ATD1DR3HSTR.Bits.BIT13
    #define ATD1DR3H_BIT14              _ATD1DR3.Overlap_STR.ATD1DR3HSTR.Bits.BIT14
    #define ATD1DR3H_BIT15              _ATD1DR3.Overlap_STR.ATD1DR3HSTR.Bits.BIT15
    
    
    #define ATD1DR3H_BIT8_MASK          1
    #define ATD1DR3H_BIT9_MASK          2
    #define ATD1DR3H_BIT10_MASK         4
    #define ATD1DR3H_BIT11_MASK         8
    #define ATD1DR3H_BIT12_MASK         16
    #define ATD1DR3H_BIT13_MASK         32
    #define ATD1DR3H_BIT14_MASK         64
    #define ATD1DR3H_BIT15_MASK         128


     ATD1DR3L - ATD 1 Conversion Result Register 3 Low; 0x00000097 
    union {
      byte Byte;
      struct {
        byte             1; 
        byte             1; 
        byte             1; 
        byte             1; 
        byte             1; 
        byte             1; 
        byte BIT6        1;                                        Bit 6 
        byte BIT7        1;                                        Bit 7 
      } Bits;
      struct {
        byte     1;
        byte     1;
        byte     1;
        byte     1;
        byte     1;
        byte     1;
        byte grpBIT_6 2;
      } MergedBits;
    } ATD1DR3LSTR;
    #define ATD1DR3L                    _ATD1DR3.Overlap_STR.ATD1DR3LSTR.Byte
    #define ATD1DR3L_BIT6               _ATD1DR3.Overlap_STR.ATD1DR3LSTR.Bits.BIT6
    #define ATD1DR3L_BIT7               _ATD1DR3.Overlap_STR.ATD1DR3LSTR.Bits.BIT7
    
    #define ATD1DR3L_BIT_6              _ATD1DR3.Overlap_STR.ATD1DR3LSTR.MergedBits.grpBIT_6
    #define ATD1DR3L_BIT                ATD1DR3L_BIT_6
    
    #define ATD1DR3L_BIT6_MASK          64
    #define ATD1DR3L_BIT7_MASK          128
    #define ATD1DR3L_BIT_6_MASK         192
    #define ATD1DR3L_BIT_6_BITNUM       6

  } Overlap_STR;

  struct {
    word             1; 
    word             1; 
    word             1; 
    word             1; 
    word             1; 
    word             1; 
    word BIT6        1;                                        Bit 6 
    word BIT7        1;                                        Bit 7 
    word BIT8        1;                                        Bit 8 
    word BIT9        1;                                        Bit 9 
    word BIT10       1;                                        Bit 10 
    word BIT11       1;                                        Bit 11 
    word BIT12       1;                                        Bit 12 
    word BIT13       1;                                        Bit 13 
    word BIT14       1;                                        Bit 14 
    word BIT15       1;                                        Bit 15 
  } Bits;
  struct {
    word         1;
    word         1;
    word         1;
    word         1;
    word         1;
    word         1;
    word grpBIT_6 10;
  } MergedBits;
} ATD1DR3STR;
extern volatile ATD1DR3STR _ATD1DR3 @(REG_BASE + 0x00000096);
#define ATD1DR3                         _ATD1DR3.Word
#define ATD1DR3_BIT6                    _ATD1DR3.Bits.BIT6
#define ATD1DR3_BIT7                    _ATD1DR3.Bits.BIT7
#define ATD1DR3_BIT8                    _ATD1DR3.Bits.BIT8
#define ATD1DR3_BIT9                    _ATD1DR3.Bits.BIT9
#define ATD1DR3_BIT10                   _ATD1DR3.Bits.BIT10
#define ATD1DR3_BIT11                   _ATD1DR3.Bits.BIT11
#define ATD1DR3_BIT12                   _ATD1DR3.Bits.BIT12
#define ATD1DR3_BIT13                   _ATD1DR3.Bits.BIT13
#define ATD1DR3_BIT14                   _ATD1DR3.Bits.BIT14
#define ATD1DR3_BIT15                   _ATD1DR3.Bits.BIT15
#define ATD1DR3_BIT_6                   _ATD1DR3.MergedBits.grpBIT_6
#define ATD1DR3_BIT                     ATD1DR3_BIT_6

#define ATD1DR3_BIT6_MASK               64
#define ATD1DR3_BIT7_MASK               128
#define ATD1DR3_BIT8_MASK               256
#define ATD1DR3_BIT9_MASK               512
#define ATD1DR3_BIT10_MASK              1024
#define ATD1DR3_BIT11_MASK              2048
#define ATD1DR3_BIT12_MASK              4096
#define ATD1DR3_BIT13_MASK              8192
#define ATD1DR3_BIT14_MASK              16384
#define ATD1DR3_BIT15_MASK              32768
#define ATD1DR3_BIT_6_MASK              65472
#define ATD1DR3_BIT_6_BITNUM            6


