gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
#define ATD1DR8_BIT6_MASK               64
#define ATD1DR8_BIT7_MASK               128
#define ATD1DR8_BIT8_MASK               256
#define ATD1DR8_BIT9_MASK               512
#define ATD1DR8_BIT10_MASK              1024
#define ATD1DR8_BIT11_MASK              2048
#define ATD1DR8_BIT12_MASK              4096
#define ATD1DR8_BIT13_MASK              8192
#define ATD1DR8_BIT14_MASK              16384
#define ATD1DR8_BIT15_MASK              32768
#define ATD1DR8_BIT_6_MASK              65472
#define ATD1DR8_BIT_6_BITNUM            6


 ATD1DR9 - ATD 1 Conversion Result Register 9; 0x000000A2 
typedef union {
  word Word;
    Overlapped registers 
  struct {
     ATD1DR9H - ATD 1 Conversion Result Register 9 High; 0x000000A2 
    union {
      byte Byte;
      struct {
        byte BIT8        1;                                        Bit 8 
        byte BIT9        1;                                        Bit 9 
        byte BIT10       1;                                        Bit 10 
        byte BIT11       1;                                        Bit 11 
        byte BIT12       1;                                        Bit 12 
        byte BIT13       1;                                        Bit 13 
        byte BIT14       1;                                        Bit 14 
        byte BIT15       1;                                        Bit 15 
      } Bits;
    } ATD1DR9HSTR;
    #define ATD1DR9H                    _ATD1DR9.Overlap_STR.ATD1DR9HSTR.Byte
    #define ATD1DR9H_BIT8               _ATD1DR9.Overlap_STR.ATD1DR9HSTR.Bits.BIT8
    #define ATD1DR9H_BIT9               _ATD1DR9.Overlap_STR.ATD1DR9HSTR.Bits.BIT9
    #define ATD1DR9H_BIT10              _ATD1DR9.Overlap_STR.ATD1DR9HSTR.Bits.BIT10
    #define ATD1DR9H_BIT11              _ATD1DR9.Overlap_STR.ATD1DR9HSTR.Bits.BIT11
    #define ATD1DR9H_BIT12              _ATD1DR9.Overlap_STR.ATD1DR9HSTR.Bits.BIT12
    #define ATD1DR9H_BIT13              _ATD1DR9.Overlap_STR.ATD1DR9HSTR.Bits.BIT13
    #define ATD1DR9H_BIT14              _ATD1DR9.Overlap_STR.ATD1DR9HSTR.Bits.BIT14
    #define ATD1DR9H_BIT15              _ATD1DR9.Overlap_STR.ATD1DR9HSTR.Bits.BIT15
    
    
    #define ATD1DR9H_BIT8_MASK          1
    #define ATD1DR9H_BIT9_MASK          2
    #define ATD1DR9H_BIT10_MASK         4
    #define ATD1DR9H_BIT11_MASK         8
    #define ATD1DR9H_BIT12_MASK         16
    #define ATD1DR9H_BIT13_MASK         32
    #define ATD1DR9H_BIT14_MASK         64
    #define ATD1DR9H_BIT15_MASK         128


     ATD1DR9L - ATD 1 Conversion Result Register 9 Low; 0x000000A3 
    union {
      byte Byte;
      struct {
        byte             1; 
        byte             1; 
        byte             1; 
        byte             1; 
        byte             1; 
        byte             1; 
        byte BIT6        1;                                        Bit 6 
        byte BIT7        1;                                        Bit 7 
      } Bits;
      struct {
        byte     1;
        byte     1;
        byte     1;
        byte     1;
        byte     1;
        byte     1;
        byte grpBIT_6 2;
      } MergedBits;
    } ATD1DR9LSTR;
    #define ATD1DR9L                    _ATD1DR9.Overlap_STR.ATD1DR9LSTR.Byte
    #define ATD1DR9L_BIT6               _ATD1DR9.Overlap_STR.ATD1DR9LSTR.Bits.BIT6
    #define ATD1DR9L_BIT7               _ATD1DR9.Overlap_STR.ATD1DR9LSTR.Bits.BIT7
    
    #define ATD1DR9L_BIT_6              _ATD1DR9.Overlap_STR.ATD1DR9LSTR.MergedBits.grpBIT_6
    #define ATD1DR9L_BIT                ATD1DR9L_BIT_6
    
    #define ATD1DR9L_BIT6_MASK          64
    #define ATD1DR9L_BIT7_MASK          128
    #define ATD1DR9L_BIT_6_MASK         192
    #define ATD1DR9L_BIT_6_BITNUM       6

  } Overlap_STR;

  struct {
    word             1; 
    word             1; 
    word             1; 
    word             1; 
    word             1; 
    word             1; 
    word BIT6        1;                                        Bit 6 
    word BIT7        1;                                        Bit 7 
    word BIT8        1;                                        Bit 8 
    word BIT9        1;                                        Bit 9 
    word BIT10       1;                                        Bit 10 
    word BIT11       1;                                        Bit 11 
    word BIT12       1;                                        Bit 12 
    word BIT13       1;                                        Bit 13 
    word BIT14       1;                                        Bit 14 
    word BIT15       1;                                        Bit 15 
  } Bits;
  struct {
    word         1;
    word         1;
    word         1;
    word         1;
    word         1;
    word         1;
    word grpBIT_6 10;
  } MergedBits;
} ATD1DR9STR;
extern volatile ATD1DR9STR _ATD1DR9 @(REG_BASE + 0x000000A2);
#define ATD1DR9                         _ATD1DR9.Word
#define ATD1DR9_BIT6                    _ATD1DR9.Bits.BIT6
#define ATD1DR9_BIT7                    _ATD1DR9.Bits.BIT7
#define ATD1DR9_BIT8                    _ATD1DR9.Bits.BIT8
#define ATD1DR9_BIT9                    _ATD1DR9.Bits.BIT9
#define ATD1DR9_BIT10                   _ATD1DR9.Bits.BIT10
#define ATD1DR9_BIT11                   _ATD1DR9.Bits.BIT11
#define ATD1DR9_BIT12                   _ATD1DR9.Bits.BIT12
#define ATD1DR9_BIT13                   _ATD1DR9.Bits.BIT13
#define ATD1DR9_BIT14                   _ATD1DR9.Bits.BIT14
#define ATD1DR9_BIT15                   _ATD1DR9.Bits.BIT15
#define ATD1DR9_BIT_6                   _ATD1DR9.MergedBits.grpBIT_6
#define ATD1DR9_BIT                     ATD1DR9_BIT_6

#define ATD1DR9_BIT6_MASK               64
#define ATD1DR9_BIT7_MASK               128
#define ATD1DR9_BIT8_MASK               256
#define ATD1DR9_BIT9_MASK               512
#define ATD1DR9_BIT10_MASK              1024
#define ATD1DR9_BIT11_MASK              2048
#define ATD1DR9_BIT12_MASK              4096
#define ATD1DR9_BIT13_MASK              8192
#define ATD1DR9_BIT14_MASK              16384
#define ATD1DR9_BIT15_MASK              32768
#define ATD1DR9_BIT_6_MASK              65472
#define ATD1DR9_BIT_6_BITNUM            6


