gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
extern volatile ATD1DR14STR _ATD1DR14 @(REG_BASE + 0x000000AC);
#define ATD1DR14                        _ATD1DR14.Word
#define ATD1DR14_BIT6                   _ATD1DR14.Bits.BIT6
#define ATD1DR14_BIT7                   _ATD1DR14.Bits.BIT7
#define ATD1DR14_BIT8                   _ATD1DR14.Bits.BIT8
#define ATD1DR14_BIT9                   _ATD1DR14.Bits.BIT9
#define ATD1DR14_BIT10                  _ATD1DR14.Bits.BIT10
#define ATD1DR14_BIT11                  _ATD1DR14.Bits.BIT11
#define ATD1DR14_BIT12                  _ATD1DR14.Bits.BIT12
#define ATD1DR14_BIT13                  _ATD1DR14.Bits.BIT13
#define ATD1DR14_BIT14                  _ATD1DR14.Bits.BIT14
#define ATD1DR14_BIT15                  _ATD1DR14.Bits.BIT15
#define ATD1DR14_BIT_6                  _ATD1DR14.MergedBits.grpBIT_6
#define ATD1DR14_BIT                    ATD1DR14_BIT_6

#define ATD1DR14_BIT6_MASK              64
#define ATD1DR14_BIT7_MASK              128
#define ATD1DR14_BIT8_MASK              256
#define ATD1DR14_BIT9_MASK              512
#define ATD1DR14_BIT10_MASK             1024
#define ATD1DR14_BIT11_MASK             2048
#define ATD1DR14_BIT12_MASK             4096
#define ATD1DR14_BIT13_MASK             8192
#define ATD1DR14_BIT14_MASK             16384
#define ATD1DR14_BIT15_MASK             32768
#define ATD1DR14_BIT_6_MASK             65472
#define ATD1DR14_BIT_6_BITNUM           6


 ATD1DR15 - ATD 1 Conversion Result Register 15; 0x000000AE 
typedef union {
  word Word;
    Overlapped registers 
  struct {
     ATD1DR15H - ATD 1 Conversion Result Register 15 High; 0x000000AE 
    union {
      byte Byte;
      struct {
        byte BIT8        1;                                        Bit 8 
        byte BIT9        1;                                        Bit 9 
        byte BIT10       1;                                        Bit 10 
        byte BIT11       1;                                        Bit 11 
        byte BIT12       1;                                        Bit 12 
        byte BIT13       1;                                        Bit 13 
        byte BIT14       1;                                        Bit 14 
        byte BIT15       1;                                        Bit 15 
      } Bits;
    } ATD1DR15HSTR;
    #define ATD1DR15H                   _ATD1DR15.Overlap_STR.ATD1DR15HSTR.Byte
    #define ATD1DR15H_BIT8              _ATD1DR15.Overlap_STR.ATD1DR15HSTR.Bits.BIT8
    #define ATD1DR15H_BIT9              _ATD1DR15.Overlap_STR.ATD1DR15HSTR.Bits.BIT9
    #define ATD1DR15H_BIT10             _ATD1DR15.Overlap_STR.ATD1DR15HSTR.Bits.BIT10
    #define ATD1DR15H_BIT11             _ATD1DR15.Overlap_STR.ATD1DR15HSTR.Bits.BIT11
    #define ATD1DR15H_BIT12             _ATD1DR15.Overlap_STR.ATD1DR15HSTR.Bits.BIT12
    #define ATD1DR15H_BIT13             _ATD1DR15.Overlap_STR.ATD1DR15HSTR.Bits.BIT13
    #define ATD1DR15H_BIT14             _ATD1DR15.Overlap_STR.ATD1DR15HSTR.Bits.BIT14
    #define ATD1DR15H_BIT15             _ATD1DR15.Overlap_STR.ATD1DR15HSTR.Bits.BIT15
    
    
    #define ATD1DR15H_BIT8_MASK         1
    #define ATD1DR15H_BIT9_MASK         2
    #define ATD1DR15H_BIT10_MASK        4
    #define ATD1DR15H_BIT11_MASK        8
    #define ATD1DR15H_BIT12_MASK        16
    #define ATD1DR15H_BIT13_MASK        32
    #define ATD1DR15H_BIT14_MASK        64
    #define ATD1DR15H_BIT15_MASK        128


     ATD1DR15L - ATD 1 Conversion Result Register 15 Low; 0x000000AF 
    union {
      byte Byte;
      struct {
        byte             1; 
        byte             1; 
        byte             1; 
        byte             1; 
        byte             1; 
        byte             1; 
        byte BIT6        1;                                        Bit 6 
        byte BIT7        1;                                        Bit 7 
      } Bits;
      struct {
        byte     1;
        byte     1;
        byte     1;
        byte     1;
        byte     1;
        byte     1;
        byte grpBIT_6 2;
      } MergedBits;
    } ATD1DR15LSTR;
    #define ATD1DR15L                   _ATD1DR15.Overlap_STR.ATD1DR15LSTR.Byte
    #define ATD1DR15L_BIT6              _ATD1DR15.Overlap_STR.ATD1DR15LSTR.Bits.BIT6
    #define ATD1DR15L_BIT7              _ATD1DR15.Overlap_STR.ATD1DR15LSTR.Bits.BIT7
    
    #define ATD1DR15L_BIT_6             _ATD1DR15.Overlap_STR.ATD1DR15LSTR.MergedBits.grpBIT_6
    #define ATD1DR15L_BIT               ATD1DR15L_BIT_6
    
    #define ATD1DR15L_BIT6_MASK         64
    #define ATD1DR15L_BIT7_MASK         128
    #define ATD1DR15L_BIT_6_MASK        192
    #define ATD1DR15L_BIT_6_BITNUM      6

  } Overlap_STR;

  struct {
    word             1; 
    word             1; 
    word             1; 
    word             1; 
    word             1; 
    word             1; 
    word BIT6        1;                                        Bit 6 
    word BIT7        1;                                        Bit 7 
    word BIT8        1;                                        Bit 8 
    word BIT9        1;                                        Bit 9 
    word BIT10       1;                                        Bit 10 
    word BIT11       1;                                        Bit 11 
    word BIT12       1;                                        Bit 12 
    word BIT13       1;                                        Bit 13 
    word BIT14       1;                                        Bit 14 
    word BIT15       1;                                        Bit 15 
  } Bits;
  struct {
    word         1;
    word         1;
    word         1;
    word         1;
    word         1;
    word         1;
    word grpBIT_6 10;
  } MergedBits;
} ATD1DR15STR;
extern volatile ATD1DR15STR _ATD1DR15 @(REG_BASE + 0x000000AE);
#define ATD1DR15                        _ATD1DR15.Word
#define ATD1DR15_BIT6                   _ATD1DR15.Bits.BIT6
#define ATD1DR15_BIT7                   _ATD1DR15.Bits.BIT7
#define ATD1DR15_BIT8                   _ATD1DR15.Bits.BIT8
#define ATD1DR15_BIT9                   _ATD1DR15.Bits.BIT9
#define ATD1DR15_BIT10                  _ATD1DR15.Bits.BIT10
#define ATD1DR15_BIT11                  _ATD1DR15.Bits.BIT11
#define ATD1DR15_BIT12                  _ATD1DR15.Bits.BIT12
#define ATD1DR15_BIT13                  _ATD1DR15.Bits.BIT13
#define ATD1DR15_BIT14                  _ATD1DR15.Bits.BIT14
#define ATD1DR15_BIT15                  _ATD1DR15.Bits.BIT15
#define ATD1DR15_BIT_6                  _ATD1DR15.MergedBits.grpBIT_6
#define ATD1DR15_BIT                    ATD1DR15_BIT_6

