gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
#define ATD1DR15_BIT6_MASK              64
#define ATD1DR15_BIT7_MASK              128
#define ATD1DR15_BIT8_MASK              256
#define ATD1DR15_BIT9_MASK              512
#define ATD1DR15_BIT10_MASK             1024
#define ATD1DR15_BIT11_MASK             2048
#define ATD1DR15_BIT12_MASK             4096
#define ATD1DR15_BIT13_MASK             8192
#define ATD1DR15_BIT14_MASK             16384
#define ATD1DR15_BIT15_MASK             32768
#define ATD1DR15_BIT_6_MASK             65472
#define ATD1DR15_BIT_6_BITNUM           6


 SCI2BD - SCI 2 Baud Rate Register; 0x000000B8 
typedef union {
  word Word;
    Overlapped registers 
  struct {
     SCI2ASR1 - SCI 2 Alternative Status Register 1; 0x000000B8 
    union {
      byte Byte;
      union { Several registers at the same address 
         SCI2ASR1 - SCI 2 Alternative Status Register 1; Several registers at the same address 
        union {
          struct {
            byte BKDIF       1;                                        Break Detect Interrupt Flag 
            byte BERRIF      1;                                        Bit Error Interrupt Flag 
            byte BERRV       1;                                        Bit Error Value 
            byte             1; 
            byte             1; 
            byte             1; 
            byte             1; 
            byte RXEDGIF     1;                                        Receive Input Active Edge Interrupt Flag 
          } Bits;
        } SCI2ASR1STR;
        #define SCI2ASR1                _SCI2BD.Overlap_STR.SCI2ASR1STR.Byte
        #define SCI2ASR1_BKDIF          _SCI2BD.Overlap_STR.SCI2ASR1STR.SameAddr_STR.SCI2ASR1STR.Bits.BKDIF
        #define SCI2ASR1_BERRIF         _SCI2BD.Overlap_STR.SCI2ASR1STR.SameAddr_STR.SCI2ASR1STR.Bits.BERRIF
        #define SCI2ASR1_BERRV          _SCI2BD.Overlap_STR.SCI2ASR1STR.SameAddr_STR.SCI2ASR1STR.Bits.BERRV
        #define SCI2ASR1_RXEDGIF        _SCI2BD.Overlap_STR.SCI2ASR1STR.SameAddr_STR.SCI2ASR1STR.Bits.RXEDGIF
        
        
        #define SCI2ASR1_BKDIF_MASK     1
        #define SCI2ASR1_BERRIF_MASK    2
        #define SCI2ASR1_BERRV_MASK     4
        #define SCI2ASR1_RXEDGIF_MASK   128
    
         SCI2BDH - SCI 2 Baud Rate Register High; Several registers at the same address 
        union {
          struct {
            byte SBR8        1;                                        SCI Baud Rate Bit 8 
            byte SBR9        1;                                        SCI Baud Rate Bit 9 
            byte SBR10       1;                                        SCI Baud Rate Bit 10 
            byte SBR11       1;                                        SCI Baud Rate Bit 11 
            byte SBR12       1;                                        SCI Baud Rate Bit 12 
            byte TNP0        1;                                        Transmitter Narrow Pulse Bit 0 
            byte TNP1        1;                                        Transmitter Narrow Pulse Bit 1 
            byte IREN        1;                                        Infrared Enable Bit 
          } Bits;
          struct {
            byte grpSBR_8 5;
            byte grpTNP 2;
            byte 1;
          } MergedBits;
        } SCI2BDHSTR;
        #define SCI2BDH                 _SCI2BD.Overlap_STR.SCI2ASR1STR.Byte
        #define SCI2BDH_SBR8            _SCI2BD.Overlap_STR.SCI2ASR1STR.SameAddr_STR.SCI2BDHSTR.Bits.SBR8
        #define SCI2BDH_SBR9            _SCI2BD.Overlap_STR.SCI2ASR1STR.SameAddr_STR.SCI2BDHSTR.Bits.SBR9
        #define SCI2BDH_SBR10           _SCI2BD.Overlap_STR.SCI2ASR1STR.SameAddr_STR.SCI2BDHSTR.Bits.SBR10
        #define SCI2BDH_SBR11           _SCI2BD.Overlap_STR.SCI2ASR1STR.SameAddr_STR.SCI2BDHSTR.Bits.SBR11
        #define SCI2BDH_SBR12           _SCI2BD.Overlap_STR.SCI2ASR1STR.SameAddr_STR.SCI2BDHSTR.Bits.SBR12
        #define SCI2BDH_TNP0            _SCI2BD.Overlap_STR.SCI2ASR1STR.SameAddr_STR.SCI2BDHSTR.Bits.TNP0
        #define SCI2BDH_TNP1            _SCI2BD.Overlap_STR.SCI2ASR1STR.SameAddr_STR.SCI2BDHSTR.Bits.TNP1
        #define SCI2BDH_IREN            _SCI2BD.Overlap_STR.SCI2ASR1STR.SameAddr_STR.SCI2BDHSTR.Bits.IREN
        
        #define SCI2BDH_SBR_8           _SCI2BD.Overlap_STR.SCI2ASR1STR.SameAddr_STR.SCI2BDHSTR.MergedBits.grpSBR_8
        #define SCI2BDH_TNP             _SCI2BD.Overlap_STR.SCI2ASR1STR.SameAddr_STR.SCI2BDHSTR.MergedBits.grpTNP
        #define SCI2BDH_SBR             SCI2BDH_SBR_8
        
        #define SCI2BDH_SBR8_MASK       1
        #define SCI2BDH_SBR9_MASK       2
        #define SCI2BDH_SBR10_MASK      4
        #define SCI2BDH_SBR11_MASK      8
        #define SCI2BDH_SBR12_MASK      16
        #define SCI2BDH_TNP0_MASK       32
        #define SCI2BDH_TNP1_MASK       64
        #define SCI2BDH_IREN_MASK       128
        #define SCI2BDH_SBR_8_MASK      31
        #define SCI2BDH_SBR_8_BITNUM    0
        #define SCI2BDH_TNP_MASK        96
        #define SCI2BDH_TNP_BITNUM      5
    
      } SameAddr_STR; Several registers at the same address 
    
    } SCI2ASR1STR;
    


     SCI2ACR1 - SCI 2 Alternative Control Register 1; 0x000000B9 
    union {
      byte Byte;
      union { Several registers at the same address 
         SCI2ACR1 - SCI 2 Alternative Control Register 1; Several registers at the same address 
        union {
          struct {
            byte BKDIE       1;                                        Break Detect Interrupt Enable 
            byte BERRIE      1;                                        Bit Error Interrupt Enable 
            byte             1; 
            byte             1; 
            byte             1; 
            byte             1; 
            byte             1; 
            byte RXEDGIE     1;                                        Receive Input Active Edge Interrupt Enable 
          } Bits;
        } SCI2ACR1STR;
        #define SCI2ACR1                _SCI2BD.Overlap_STR.SCI2ACR1STR.Byte
        #define SCI2ACR1_BKDIE          _SCI2BD.Overlap_STR.SCI2ACR1STR.SameAddr_STR.SCI2ACR1STR.Bits.BKDIE
        #define SCI2ACR1_BERRIE         _SCI2BD.Overlap_STR.SCI2ACR1STR.SameAddr_STR.SCI2ACR1STR.Bits.BERRIE
        #define SCI2ACR1_RXEDGIE        _SCI2BD.Overlap_STR.SCI2ACR1STR.SameAddr_STR.SCI2ACR1STR.Bits.RXEDGIE
        
        
        #define SCI2ACR1_BKDIE_MASK     1
        #define SCI2ACR1_BERRIE_MASK    2
        #define SCI2ACR1_RXEDGIE_MASK   128
    
