gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
         SCI2BDL - SCI 2 Baud Rate Register Low; Several registers at the same address 
        union {
          struct {
            byte SBR0        1;                                        SCI Baud Rate Bit 0 
            byte SBR1        1;                                        SCI Baud Rate Bit 1 
            byte SBR2        1;                                        SCI Baud Rate Bit 2 
            byte SBR3        1;                                        SCI Baud Rate Bit 3 
            byte SBR4        1;                                        SCI Baud Rate Bit 4 
            byte SBR5        1;                                        SCI Baud Rate Bit 5 
            byte SBR6        1;                                        SCI Baud Rate Bit 6 
            byte SBR7        1;                                        SCI Baud Rate Bit 7 
          } Bits;
        } SCI2BDLSTR;
        #define SCI2BDL                 _SCI2BD.Overlap_STR.SCI2ACR1STR.Byte
        #define SCI2BDL_SBR0            _SCI2BD.Overlap_STR.SCI2ACR1STR.SameAddr_STR.SCI2BDLSTR.Bits.SBR0
        #define SCI2BDL_SBR1            _SCI2BD.Overlap_STR.SCI2ACR1STR.SameAddr_STR.SCI2BDLSTR.Bits.SBR1
        #define SCI2BDL_SBR2            _SCI2BD.Overlap_STR.SCI2ACR1STR.SameAddr_STR.SCI2BDLSTR.Bits.SBR2
        #define SCI2BDL_SBR3            _SCI2BD.Overlap_STR.SCI2ACR1STR.SameAddr_STR.SCI2BDLSTR.Bits.SBR3
        #define SCI2BDL_SBR4            _SCI2BD.Overlap_STR.SCI2ACR1STR.SameAddr_STR.SCI2BDLSTR.Bits.SBR4
        #define SCI2BDL_SBR5            _SCI2BD.Overlap_STR.SCI2ACR1STR.SameAddr_STR.SCI2BDLSTR.Bits.SBR5
        #define SCI2BDL_SBR6            _SCI2BD.Overlap_STR.SCI2ACR1STR.SameAddr_STR.SCI2BDLSTR.Bits.SBR6
        #define SCI2BDL_SBR7            _SCI2BD.Overlap_STR.SCI2ACR1STR.SameAddr_STR.SCI2BDLSTR.Bits.SBR7
        
        
        #define SCI2BDL_SBR0_MASK       1
        #define SCI2BDL_SBR1_MASK       2
        #define SCI2BDL_SBR2_MASK       4
        #define SCI2BDL_SBR3_MASK       8
        #define SCI2BDL_SBR4_MASK       16
        #define SCI2BDL_SBR5_MASK       32
        #define SCI2BDL_SBR6_MASK       64
        #define SCI2BDL_SBR7_MASK       128
    
      } SameAddr_STR; Several registers at the same address 
    
    } SCI2ACR1STR;
    

  } Overlap_STR;

  struct {
    word SBR0        1;                                        SCI Baud Rate Bit 0 
    word SBR1        1;                                        SCI Baud Rate Bit 1 
    word SBR2        1;                                        SCI Baud Rate Bit 2 
    word SBR3        1;                                        SCI Baud Rate Bit 3 
    word SBR4        1;                                        SCI Baud Rate Bit 4 
    word SBR5        1;                                        SCI Baud Rate Bit 5 
    word SBR6        1;                                        SCI Baud Rate Bit 6 
    word SBR7        1;                                        SCI Baud Rate Bit 7 
    word SBR8        1;                                        SCI Baud Rate Bit 8 
    word SBR9        1;                                        SCI Baud Rate Bit 9 
    word SBR10       1;                                        SCI Baud Rate Bit 10 
    word SBR11       1;                                        SCI Baud Rate Bit 11 
    word SBR12       1;                                        SCI Baud Rate Bit 12 
    word TNP0        1;                                        Transmitter Narrow Pulse Bit 0 
    word TNP1        1;                                        Transmitter Narrow Pulse Bit 1 
    word IREN        1;                                        Infrared Enable Bit 
  } Bits;
  struct {
    word grpSBR  13;
    word grpTNP  2;
    word         1;
  } MergedBits;
} SCI2BDSTR;
extern volatile SCI2BDSTR _SCI2BD @(REG_BASE + 0x000000B8);
#define SCI2BD                          _SCI2BD.Word
#define SCI2BD_SBR0                     _SCI2BD.Bits.SBR0
#define SCI2BD_SBR1                     _SCI2BD.Bits.SBR1
#define SCI2BD_SBR2                     _SCI2BD.Bits.SBR2
#define SCI2BD_SBR3                     _SCI2BD.Bits.SBR3
#define SCI2BD_SBR4                     _SCI2BD.Bits.SBR4
#define SCI2BD_SBR5                     _SCI2BD.Bits.SBR5
#define SCI2BD_SBR6                     _SCI2BD.Bits.SBR6
#define SCI2BD_SBR7                     _SCI2BD.Bits.SBR7
#define SCI2BD_SBR8                     _SCI2BD.Bits.SBR8
#define SCI2BD_SBR9                     _SCI2BD.Bits.SBR9
#define SCI2BD_SBR10                    _SCI2BD.Bits.SBR10
#define SCI2BD_SBR11                    _SCI2BD.Bits.SBR11
#define SCI2BD_SBR12                    _SCI2BD.Bits.SBR12
#define SCI2BD_TNP0                     _SCI2BD.Bits.TNP0
#define SCI2BD_TNP1                     _SCI2BD.Bits.TNP1
#define SCI2BD_IREN                     _SCI2BD.Bits.IREN
#define SCI2BD_SBR                      _SCI2BD.MergedBits.grpSBR
#define SCI2BD_TNP                      _SCI2BD.MergedBits.grpTNP

#define SCI2BD_SBR0_MASK                1
#define SCI2BD_SBR1_MASK                2
#define SCI2BD_SBR2_MASK                4
#define SCI2BD_SBR3_MASK                8
#define SCI2BD_SBR4_MASK                16
#define SCI2BD_SBR5_MASK                32
#define SCI2BD_SBR6_MASK                64
#define SCI2BD_SBR7_MASK                128
#define SCI2BD_SBR8_MASK                256
#define SCI2BD_SBR9_MASK                512
#define SCI2BD_SBR10_MASK               1024
#define SCI2BD_SBR11_MASK               2048
#define SCI2BD_SBR12_MASK               4096
#define SCI2BD_TNP0_MASK                8192
#define SCI2BD_TNP1_MASK                16384
#define SCI2BD_IREN_MASK                32768
#define SCI2BD_SBR_MASK                 8191
#define SCI2BD_SBR_BITNUM               0
#define SCI2BD_TNP_MASK                 24576
#define SCI2BD_TNP_BITNUM               13


 SCI2ACR2 - SCI 2 Alternative Control Register 2; 0x000000BA 
typedef union {
  byte Byte;
  union { Several registers at the same address 
     SCI2ACR2 - SCI 2 Alternative Control Register 2; Several registers at the same address 
    union {
      struct {
        byte BKDFE       1;                                        Break Detect Feature Enable 
        byte BERRM0      1;                                        Bit Error Mode Bit 0 
        byte BERRM1      1;                                        Bit Error Mode Bit 1 
        byte             1; 
        byte             1; 
        byte             1; 
        byte             1; 
        byte             1; 
      } Bits;
      struct {
        byte     1;
        byte grpBERRM 2;
        byte     1;
        byte     1;
        byte     1;
        byte     1;
        byte     1;
      } MergedBits;
    } SCI2ACR2STR;
    #define SCI2ACR2                    _SCI2ACR2.Byte
    #define SCI2ACR2_BKDFE              _SCI2ACR2.SameAddr_STR.SCI2ACR2STR.Bits.BKDFE
    #define SCI2ACR2_BERRM0             _SCI2ACR2.SameAddr_STR.SCI2ACR2STR.Bits.BERRM0
    #define SCI2ACR2_BERRM1             _SCI2ACR2.SameAddr_STR.SCI2ACR2STR.Bits.BERRM1
    
