gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
    #define SCI2ACR2_BERRM              _SCI2ACR2.SameAddr_STR.SCI2ACR2STR.MergedBits.grpBERRM
    
    #define SCI2ACR2_BKDFE_MASK         1
    #define SCI2ACR2_BERRM0_MASK        2
    #define SCI2ACR2_BERRM1_MASK        4
    #define SCI2ACR2_BERRM_MASK         6
    #define SCI2ACR2_BERRM_BITNUM       1

     SCI2CR1 - SCI 2 Control Register 1; Several registers at the same address 
    union {
      struct {
        byte PT          1;                                        Parity Type Bit 
        byte PE          1;                                        Parity Enable Bit 
        byte ILT         1;                                        Idle Line Type Bit 
        byte WAKE        1;                                        Wakeup Condition Bit 
        byte M           1;                                        Data Format Mode Bit 
        byte RSRC        1;                                        Receiver Source Bit 
        byte SCISWAI     1;                                        SCI Stop in Wait Mode Bit 
        byte LOOPS       1;                                        Loop Select Bit 
      } Bits;
    } SCI2CR1STR;
    #define SCI2CR1                     _SCI2ACR2.Byte
    #define SCI2CR1_PT                  _SCI2ACR2.SameAddr_STR.SCI2CR1STR.Bits.PT
    #define SCI2CR1_PE                  _SCI2ACR2.SameAddr_STR.SCI2CR1STR.Bits.PE
    #define SCI2CR1_ILT                 _SCI2ACR2.SameAddr_STR.SCI2CR1STR.Bits.ILT
    #define SCI2CR1_WAKE                _SCI2ACR2.SameAddr_STR.SCI2CR1STR.Bits.WAKE
    #define SCI2CR1_M                   _SCI2ACR2.SameAddr_STR.SCI2CR1STR.Bits.M
    #define SCI2CR1_RSRC                _SCI2ACR2.SameAddr_STR.SCI2CR1STR.Bits.RSRC
    #define SCI2CR1_SCISWAI             _SCI2ACR2.SameAddr_STR.SCI2CR1STR.Bits.SCISWAI
    #define SCI2CR1_LOOPS               _SCI2ACR2.SameAddr_STR.SCI2CR1STR.Bits.LOOPS
    
    
    #define SCI2CR1_PT_MASK             1
    #define SCI2CR1_PE_MASK             2
    #define SCI2CR1_ILT_MASK            4
    #define SCI2CR1_WAKE_MASK           8
    #define SCI2CR1_M_MASK              16
    #define SCI2CR1_RSRC_MASK           32
    #define SCI2CR1_SCISWAI_MASK        64
    #define SCI2CR1_LOOPS_MASK          128

  } SameAddr_STR; Several registers at the same address 

} SCI2ACR2STR;
extern volatile SCI2ACR2STR _SCI2ACR2 @(REG_BASE + 0x000000BA);



 SCI2CR2 - SCI 2 Control Register 2; 0x000000BB 
typedef union {
  byte Byte;
  struct {
    byte SBK         1;                                        Send Break Bit 
    byte RWU         1;                                        Receiver Wakeup Bit 
    byte RE          1;                                        Receiver Enable Bit 
    byte TE          1;                                        Transmitter Enable Bit 
    byte ILIE        1;                                        Idle Line Interrupt Enable Bit 
    byte RIE         1;                                        Receiver Full Interrupt Enable Bit 
    byte TCIE        1;                                        Transmission Complete Interrupt Enable Bit 
    byte SCTIE       1;                                        Transmitter Interrupt Enable Bit 
  } Bits;
} SCI2CR2STR;
extern volatile SCI2CR2STR _SCI2CR2 @(REG_BASE + 0x000000BB);
#define SCI2CR2                         _SCI2CR2.Byte
#define SCI2CR2_SBK                     _SCI2CR2.Bits.SBK
#define SCI2CR2_RWU                     _SCI2CR2.Bits.RWU
#define SCI2CR2_RE                      _SCI2CR2.Bits.RE
#define SCI2CR2_TE                      _SCI2CR2.Bits.TE
#define SCI2CR2_ILIE                    _SCI2CR2.Bits.ILIE
#define SCI2CR2_RIE                     _SCI2CR2.Bits.RIE
#define SCI2CR2_TCIE                    _SCI2CR2.Bits.TCIE
#define SCI2CR2_SCTIE                   _SCI2CR2.Bits.SCTIE

#define SCI2CR2_SBK_MASK                1
#define SCI2CR2_RWU_MASK                2
#define SCI2CR2_RE_MASK                 4
#define SCI2CR2_TE_MASK                 8
#define SCI2CR2_ILIE_MASK               16
#define SCI2CR2_RIE_MASK                32
#define SCI2CR2_TCIE_MASK               64
#define SCI2CR2_SCTIE_MASK              128


 SCI2SR1 - SCI 2 Status Register 1; 0x000000BC 
typedef union {
  byte Byte;
  struct {
    byte PF          1;                                        Parity Error Flag 
    byte FE          1;                                        Framing Error Flag 
    byte NF          1;                                        Noise Flag 
    byte OR          1;                                        Overrun Flag 
    byte IDLE        1;                                        Idle Line Flag 
    byte RDRF        1;                                        Receive Data Register Full Flag 
    byte TC          1;                                        Transmit Complete Flag 
    byte TDRE        1;                                        Transmit Data Register Empty Flag 
  } Bits;
} SCI2SR1STR;
extern volatile SCI2SR1STR _SCI2SR1 @(REG_BASE + 0x000000BC);
#define SCI2SR1                         _SCI2SR1.Byte
#define SCI2SR1_PF                      _SCI2SR1.Bits.PF
#define SCI2SR1_FE                      _SCI2SR1.Bits.FE
#define SCI2SR1_NF                      _SCI2SR1.Bits.NF
#define SCI2SR1_OR                      _SCI2SR1.Bits.OR
#define SCI2SR1_IDLE                    _SCI2SR1.Bits.IDLE
#define SCI2SR1_RDRF                    _SCI2SR1.Bits.RDRF
#define SCI2SR1_TC                      _SCI2SR1.Bits.TC
#define SCI2SR1_TDRE                    _SCI2SR1.Bits.TDRE

#define SCI2SR1_PF_MASK                 1
#define SCI2SR1_FE_MASK                 2
#define SCI2SR1_NF_MASK                 4
#define SCI2SR1_OR_MASK                 8
#define SCI2SR1_IDLE_MASK               16
#define SCI2SR1_RDRF_MASK               32
#define SCI2SR1_TC_MASK                 64
#define SCI2SR1_TDRE_MASK               128


 SCI2SR2 - SCI 2 Status Register 2; 0x000000BD 
typedef union {
  byte Byte;
  struct {
    byte RAF         1;                                        Receiver Active Flag 
    byte TXDIR       1;                                        Transmitter pin data direction in Single-Wire mode 
    byte BRK13       1;                                        Break Transmit character length 
    byte RXPOL       1;                                        Receive Polarity 
    byte TXPOL       1;                                        Transmit Polarity 
    byte             1; 
    byte             1; 
    byte AMAP        1;                                        Alternative Map 
  } Bits;
} SCI2SR2STR;
