gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
        #define SCI0BDH_SBR8_MASK       1
        #define SCI0BDH_SBR9_MASK       2
        #define SCI0BDH_SBR10_MASK      4
        #define SCI0BDH_SBR11_MASK      8
        #define SCI0BDH_SBR12_MASK      16
        #define SCI0BDH_TNP0_MASK       32
        #define SCI0BDH_TNP1_MASK       64
        #define SCI0BDH_IREN_MASK       128
        #define SCI0BDH_SBR_8_MASK      31
        #define SCI0BDH_SBR_8_BITNUM    0
        #define SCI0BDH_TNP_MASK        96
        #define SCI0BDH_TNP_BITNUM      5
    
      } SameAddr_STR; Several registers at the same address 
    
    } SCI0ASR1STR;
    


     SCI0ACR1 - SCI 0 Alternative Control Register 1; 0x000000C9 
    union {
      byte Byte;
      union { Several registers at the same address 
         SCI0ACR1 - SCI 0 Alternative Control Register 1; Several registers at the same address 
        union {
          struct {
            byte BKDIE       1;                                        Break Detect Interrupt Enable 
            byte BERRIE      1;                                        Bit Error Interrupt Enable 
            byte             1; 
            byte             1; 
            byte             1; 
            byte             1; 
            byte             1; 
            byte RXEDGIE     1;                                        Receive Input Active Edge Interrupt Enable 
          } Bits;
        } SCI0ACR1STR;
        #define SCI0ACR1                _SCI0BD.Overlap_STR.SCI0ACR1STR.Byte
        #define SCI0ACR1_BKDIE          _SCI0BD.Overlap_STR.SCI0ACR1STR.SameAddr_STR.SCI0ACR1STR.Bits.BKDIE
        #define SCI0ACR1_BERRIE         _SCI0BD.Overlap_STR.SCI0ACR1STR.SameAddr_STR.SCI0ACR1STR.Bits.BERRIE
        #define SCI0ACR1_RXEDGIE        _SCI0BD.Overlap_STR.SCI0ACR1STR.SameAddr_STR.SCI0ACR1STR.Bits.RXEDGIE
        
        
        #define SCI0ACR1_BKDIE_MASK     1
        #define SCI0ACR1_BERRIE_MASK    2
        #define SCI0ACR1_RXEDGIE_MASK   128
    
         SCI0BDL - SCI 0 Baud Rate Register Low; Several registers at the same address 
        union {
          struct {
            byte SBR0        1;                                        SCI Baud Rate Bit 0 
            byte SBR1        1;                                        SCI Baud Rate Bit 1 
            byte SBR2        1;                                        SCI Baud Rate Bit 2 
            byte SBR3        1;                                        SCI Baud Rate Bit 3 
            byte SBR4        1;                                        SCI Baud Rate Bit 4 
            byte SBR5        1;                                        SCI Baud Rate Bit 5 
            byte SBR6        1;                                        SCI Baud Rate Bit 6 
            byte SBR7        1;                                        SCI Baud Rate Bit 7 
          } Bits;
        } SCI0BDLSTR;
        #define SCI0BDL                 _SCI0BD.Overlap_STR.SCI0ACR1STR.Byte
        #define SCI0BDL_SBR0            _SCI0BD.Overlap_STR.SCI0ACR1STR.SameAddr_STR.SCI0BDLSTR.Bits.SBR0
        #define SCI0BDL_SBR1            _SCI0BD.Overlap_STR.SCI0ACR1STR.SameAddr_STR.SCI0BDLSTR.Bits.SBR1
        #define SCI0BDL_SBR2            _SCI0BD.Overlap_STR.SCI0ACR1STR.SameAddr_STR.SCI0BDLSTR.Bits.SBR2
        #define SCI0BDL_SBR3            _SCI0BD.Overlap_STR.SCI0ACR1STR.SameAddr_STR.SCI0BDLSTR.Bits.SBR3
        #define SCI0BDL_SBR4            _SCI0BD.Overlap_STR.SCI0ACR1STR.SameAddr_STR.SCI0BDLSTR.Bits.SBR4
        #define SCI0BDL_SBR5            _SCI0BD.Overlap_STR.SCI0ACR1STR.SameAddr_STR.SCI0BDLSTR.Bits.SBR5
        #define SCI0BDL_SBR6            _SCI0BD.Overlap_STR.SCI0ACR1STR.SameAddr_STR.SCI0BDLSTR.Bits.SBR6
        #define SCI0BDL_SBR7            _SCI0BD.Overlap_STR.SCI0ACR1STR.SameAddr_STR.SCI0BDLSTR.Bits.SBR7
        
        
        #define SCI0BDL_SBR0_MASK       1
        #define SCI0BDL_SBR1_MASK       2
        #define SCI0BDL_SBR2_MASK       4
        #define SCI0BDL_SBR3_MASK       8
        #define SCI0BDL_SBR4_MASK       16
        #define SCI0BDL_SBR5_MASK       32
        #define SCI0BDL_SBR6_MASK       64
        #define SCI0BDL_SBR7_MASK       128
    
      } SameAddr_STR; Several registers at the same address 
    
    } SCI0ACR1STR;
    

  } Overlap_STR;

  struct {
    word SBR0        1;                                        SCI Baud Rate Bit 0 
    word SBR1        1;                                        SCI Baud Rate Bit 1 
    word SBR2        1;                                        SCI Baud Rate Bit 2 
    word SBR3        1;                                        SCI Baud Rate Bit 3 
    word SBR4        1;                                        SCI Baud Rate Bit 4 
    word SBR5        1;                                        SCI Baud Rate Bit 5 
    word SBR6        1;                                        SCI Baud Rate Bit 6 
    word SBR7        1;                                        SCI Baud Rate Bit 7 
    word SBR8        1;                                        SCI Baud Rate Bit 8 
    word SBR9        1;                                        SCI Baud Rate Bit 9 
    word SBR10       1;                                        SCI Baud Rate Bit 10 
    word SBR11       1;                                        SCI Baud Rate Bit 11 
    word SBR12       1;                                        SCI Baud Rate Bit 12 
    word TNP0        1;                                        Transmitter Narrow Pulse Bit 0 
    word TNP1        1;                                        Transmitter Narrow Pulse Bit 1 
    word IREN        1;                                        Infrared Enable Bit 
  } Bits;
  struct {
    word grpSBR  13;
    word grpTNP  2;
    word         1;
  } MergedBits;
} SCI0BDSTR;
extern volatile SCI0BDSTR _SCI0BD @(REG_BASE + 0x000000C8);
#define SCI0BD                          _SCI0BD.Word
#define SCI0BD_SBR0                     _SCI0BD.Bits.SBR0
#define SCI0BD_SBR1                     _SCI0BD.Bits.SBR1
#define SCI0BD_SBR2                     _SCI0BD.Bits.SBR2
#define SCI0BD_SBR3                     _SCI0BD.Bits.SBR3
#define SCI0BD_SBR4                     _SCI0BD.Bits.SBR4
#define SCI0BD_SBR5                     _SCI0BD.Bits.SBR5
#define SCI0BD_SBR6                     _SCI0BD.Bits.SBR6
#define SCI0BD_SBR7                     _SCI0BD.Bits.SBR7
#define SCI0BD_SBR8                     _SCI0BD.Bits.SBR8
#define SCI0BD_SBR9                     _SCI0BD.Bits.SBR9
#define SCI0BD_SBR10                    _SCI0BD.Bits.SBR10
#define SCI0BD_SBR11                    _SCI0BD.Bits.SBR11
#define SCI0BD_SBR12                    _SCI0BD.Bits.SBR12
#define SCI0BD_TNP0                     _SCI0BD.Bits.TNP0
#define SCI0BD_TNP1                     _SCI0BD.Bits.TNP1
#define SCI0BD_IREN                     _SCI0BD.Bits.IREN
#define SCI0BD_SBR                      _SCI0BD.MergedBits.grpSBR
#define SCI0BD_TNP                      _SCI0BD.MergedBits.grpTNP

#define SCI0BD_SBR0_MASK                1
#define SCI0BD_SBR1_MASK                2
#define SCI0BD_SBR2_MASK                4
#define SCI0BD_SBR3_MASK                8
#define SCI0BD_SBR4_MASK                16
#define SCI0BD_SBR5_MASK                32
#define SCI0BD_SBR6_MASK                64
#define SCI0BD_SBR7_MASK                128
#define SCI0BD_SBR8_MASK                256
#define SCI0BD_SBR9_MASK                512
#define SCI0BD_SBR10_MASK               1024
#define SCI0BD_SBR11_MASK               2048
#define SCI0BD_SBR12_MASK               4096
#define SCI0BD_TNP0_MASK                8192
#define SCI0BD_TNP1_MASK                16384
#define SCI0BD_IREN_MASK                32768
#define SCI0BD_SBR_MASK                 8191
#define SCI0BD_SBR_BITNUM               0
#define SCI0BD_TNP_MASK                 24576
#define SCI0BD_TNP_BITNUM               13


