gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
 SCI0ACR2 - SCI 0 Alternative Control Register 2; 0x000000CA 
typedef union {
  byte Byte;
  union { Several registers at the same address 
     SCI0ACR2 - SCI 0 Alternative Control Register 2; Several registers at the same address 
    union {
      struct {
        byte BKDFE       1;                                        Break Detect Feature Enable 
        byte BERRM0      1;                                        Bit Error Mode Bit 0 
        byte BERRM1      1;                                        Bit Error Mode Bit 1 
        byte             1; 
        byte             1; 
        byte             1; 
        byte             1; 
        byte             1; 
      } Bits;
      struct {
        byte     1;
        byte grpBERRM 2;
        byte     1;
        byte     1;
        byte     1;
        byte     1;
        byte     1;
      } MergedBits;
    } SCI0ACR2STR;
    #define SCI0ACR2                    _SCI0ACR2.Byte
    #define SCI0ACR2_BKDFE              _SCI0ACR2.SameAddr_STR.SCI0ACR2STR.Bits.BKDFE
    #define SCI0ACR2_BERRM0             _SCI0ACR2.SameAddr_STR.SCI0ACR2STR.Bits.BERRM0
    #define SCI0ACR2_BERRM1             _SCI0ACR2.SameAddr_STR.SCI0ACR2STR.Bits.BERRM1
    
    #define SCI0ACR2_BERRM              _SCI0ACR2.SameAddr_STR.SCI0ACR2STR.MergedBits.grpBERRM
    
    #define SCI0ACR2_BKDFE_MASK         1
    #define SCI0ACR2_BERRM0_MASK        2
    #define SCI0ACR2_BERRM1_MASK        4
    #define SCI0ACR2_BERRM_MASK         6
    #define SCI0ACR2_BERRM_BITNUM       1

     SCI0CR1 - SCI 0 Control Register 1; Several registers at the same address 
    union {
      struct {
        byte PT          1;                                        Parity Type Bit 
        byte PE          1;                                        Parity Enable Bit 
        byte ILT         1;                                        Idle Line Type Bit 
        byte WAKE        1;                                        Wakeup Condition Bit 
        byte M           1;                                        Data Format Mode Bit 
        byte RSRC        1;                                        Receiver Source Bit 
        byte SCISWAI     1;                                        SCI Stop in Wait Mode Bit 
        byte LOOPS       1;                                        Loop Select Bit 
      } Bits;
    } SCI0CR1STR;
    #define SCI0CR1                     _SCI0ACR2.Byte
    #define SCI0CR1_PT                  _SCI0ACR2.SameAddr_STR.SCI0CR1STR.Bits.PT
    #define SCI0CR1_PE                  _SCI0ACR2.SameAddr_STR.SCI0CR1STR.Bits.PE
    #define SCI0CR1_ILT                 _SCI0ACR2.SameAddr_STR.SCI0CR1STR.Bits.ILT
    #define SCI0CR1_WAKE                _SCI0ACR2.SameAddr_STR.SCI0CR1STR.Bits.WAKE
    #define SCI0CR1_M                   _SCI0ACR2.SameAddr_STR.SCI0CR1STR.Bits.M
    #define SCI0CR1_RSRC                _SCI0ACR2.SameAddr_STR.SCI0CR1STR.Bits.RSRC
    #define SCI0CR1_SCISWAI             _SCI0ACR2.SameAddr_STR.SCI0CR1STR.Bits.SCISWAI
    #define SCI0CR1_LOOPS               _SCI0ACR2.SameAddr_STR.SCI0CR1STR.Bits.LOOPS
    
    
    #define SCI0CR1_PT_MASK             1
    #define SCI0CR1_PE_MASK             2
    #define SCI0CR1_ILT_MASK            4
    #define SCI0CR1_WAKE_MASK           8
    #define SCI0CR1_M_MASK              16
    #define SCI0CR1_RSRC_MASK           32
    #define SCI0CR1_SCISWAI_MASK        64
    #define SCI0CR1_LOOPS_MASK          128

  } SameAddr_STR; Several registers at the same address 

} SCI0ACR2STR;
extern volatile SCI0ACR2STR _SCI0ACR2 @(REG_BASE + 0x000000CA);



 SCI0CR2 - SCI 0 Control Register 2; 0x000000CB 
typedef union {
  byte Byte;
  struct {
    byte SBK         1;                                        Send Break Bit 
    byte RWU         1;                                        Receiver Wakeup Bit 
    byte RE          1;                                        Receiver Enable Bit 
    byte TE          1;                                        Transmitter Enable Bit 
    byte ILIE        1;                                        Idle Line Interrupt Enable Bit 
    byte RIE         1;                                        Receiver Full Interrupt Enable Bit 
    byte TCIE        1;                                        Transmission Complete Interrupt Enable Bit 
    byte SCTIE       1;                                        Transmitter Interrupt Enable Bit 
  } Bits;
} SCI0CR2STR;
extern volatile SCI0CR2STR _SCI0CR2 @(REG_BASE + 0x000000CB);
#define SCI0CR2                         _SCI0CR2.Byte
#define SCI0CR2_SBK                     _SCI0CR2.Bits.SBK
#define SCI0CR2_RWU                     _SCI0CR2.Bits.RWU
#define SCI0CR2_RE                      _SCI0CR2.Bits.RE
#define SCI0CR2_TE                      _SCI0CR2.Bits.TE
#define SCI0CR2_ILIE                    _SCI0CR2.Bits.ILIE
#define SCI0CR2_RIE                     _SCI0CR2.Bits.RIE
#define SCI0CR2_TCIE                    _SCI0CR2.Bits.TCIE
#define SCI0CR2_SCTIE                   _SCI0CR2.Bits.SCTIE

#define SCI0CR2_SBK_MASK                1
#define SCI0CR2_RWU_MASK                2
#define SCI0CR2_RE_MASK                 4
#define SCI0CR2_TE_MASK                 8
#define SCI0CR2_ILIE_MASK               16
#define SCI0CR2_RIE_MASK                32
#define SCI0CR2_TCIE_MASK               64
#define SCI0CR2_SCTIE_MASK              128


 SCI0SR1 - SCI 0 Status Register 1; 0x000000CC 
typedef union {
  byte Byte;
  struct {
    byte PF          1;                                        Parity Error Flag 
    byte FE          1;                                        Framing Error Flag 
    byte NF          1;                                        Noise Flag 
    byte OR          1;                                        Overrun Flag 
    byte IDLE        1;                                        Idle Line Flag 
    byte RDRF        1;                                        Receive Data Register Full Flag 
    byte TC          1;                                        Transmit Complete Flag 
    byte TDRE        1;                                        Transmit Data Register Empty Flag 
  } Bits;
} SCI0SR1STR;
extern volatile SCI0SR1STR _SCI0SR1 @(REG_BASE + 0x000000CC);
#define SCI0SR1                         _SCI0SR1.Byte
#define SCI0SR1_PF                      _SCI0SR1.Bits.PF
#define SCI0SR1_FE                      _SCI0SR1.Bits.FE
#define SCI0SR1_NF                      _SCI0SR1.Bits.NF
#define SCI0SR1_OR                      _SCI0SR1.Bits.OR
#define SCI0SR1_IDLE                    _SCI0SR1.Bits.IDLE
#define SCI0SR1_RDRF                    _SCI0SR1.Bits.RDRF
#define SCI0SR1_TC                      _SCI0SR1.Bits.TC
#define SCI0SR1_TDRE                    _SCI0SR1.Bits.TDRE

#define SCI0SR1_PF_MASK                 1
#define SCI0SR1_FE_MASK                 2
#define SCI0SR1_NF_MASK                 4
#define SCI0SR1_OR_MASK                 8
#define SCI0SR1_IDLE_MASK               16
#define SCI0SR1_RDRF_MASK               32
#define SCI0SR1_TC_MASK                 64
#define SCI0SR1_TDRE_MASK               128


 SCI0SR2 - SCI 0 Status Register 2; 0x000000CD 
typedef union {
  byte Byte;
  struct {
    byte RAF         1;                                        Receiver Active Flag 
    byte TXDIR       1;                                        Transmitter pin data direction in Single-Wire mode 
    byte BRK13       1;                                        Break Transmit character length 
    byte RXPOL       1;                                        Receive Polarity 
    byte TXPOL       1;                                        Transmit Polarity 
    byte             1; 
    byte             1; 
    byte AMAP        1;                                        Alternative Map 
  } Bits;
} SCI0SR2STR;
