gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
        #define SCI1BDH_SBR_8           _SCI1BD.Overlap_STR.SCI1ASR1STR.SameAddr_STR.SCI1BDHSTR.MergedBits.grpSBR_8
        #define SCI1BDH_TNP             _SCI1BD.Overlap_STR.SCI1ASR1STR.SameAddr_STR.SCI1BDHSTR.MergedBits.grpTNP
        #define SCI1BDH_SBR             SCI1BDH_SBR_8
        
        #define SCI1BDH_SBR8_MASK       1
        #define SCI1BDH_SBR9_MASK       2
        #define SCI1BDH_SBR10_MASK      4
        #define SCI1BDH_SBR11_MASK      8
        #define SCI1BDH_SBR12_MASK      16
        #define SCI1BDH_TNP0_MASK       32
        #define SCI1BDH_TNP1_MASK       64
        #define SCI1BDH_IREN_MASK       128
        #define SCI1BDH_SBR_8_MASK      31
        #define SCI1BDH_SBR_8_BITNUM    0
        #define SCI1BDH_TNP_MASK        96
        #define SCI1BDH_TNP_BITNUM      5
    
      } SameAddr_STR; Several registers at the same address 
    
    } SCI1ASR1STR;
    


     SCI1ACR1 - SCI 1 Alternative Control Register 1; 0x000000D1 
    union {
      byte Byte;
      union { Several registers at the same address 
         SCI1ACR1 - SCI 1 Alternative Control Register 1; Several registers at the same address 
        union {
          struct {
            byte BKDIE       1;                                        Break Detect Interrupt Enable 
            byte BERRIE      1;                                        Bit Error Interrupt Enable 
            byte             1; 
            byte             1; 
            byte             1; 
            byte             1; 
            byte             1; 
            byte RXEDGIE     1;                                        Receive Input Active Edge Interrupt Enable 
          } Bits;
        } SCI1ACR1STR;
        #define SCI1ACR1                _SCI1BD.Overlap_STR.SCI1ACR1STR.Byte
        #define SCI1ACR1_BKDIE          _SCI1BD.Overlap_STR.SCI1ACR1STR.SameAddr_STR.SCI1ACR1STR.Bits.BKDIE
        #define SCI1ACR1_BERRIE         _SCI1BD.Overlap_STR.SCI1ACR1STR.SameAddr_STR.SCI1ACR1STR.Bits.BERRIE
        #define SCI1ACR1_RXEDGIE        _SCI1BD.Overlap_STR.SCI1ACR1STR.SameAddr_STR.SCI1ACR1STR.Bits.RXEDGIE
        
        
        #define SCI1ACR1_BKDIE_MASK     1
        #define SCI1ACR1_BERRIE_MASK    2
        #define SCI1ACR1_RXEDGIE_MASK   128
    
         SCI1BDL - SCI 1 Baud Rate Register Low; Several registers at the same address 
        union {
          struct {
            byte SBR0        1;                                        SCI Baud Rate Bit 0 
            byte SBR1        1;                                        SCI Baud Rate Bit 1 
            byte SBR2        1;                                        SCI Baud Rate Bit 2 
            byte SBR3        1;                                        SCI Baud Rate Bit 3 
            byte SBR4        1;                                        SCI Baud Rate Bit 4 
            byte SBR5        1;                                        SCI Baud Rate Bit 5 
            byte SBR6        1;                                        SCI Baud Rate Bit 6 
            byte SBR7        1;                                        SCI Baud Rate Bit 7 
          } Bits;
        } SCI1BDLSTR;
        #define SCI1BDL                 _SCI1BD.Overlap_STR.SCI1ACR1STR.Byte
        #define SCI1BDL_SBR0            _SCI1BD.Overlap_STR.SCI1ACR1STR.SameAddr_STR.SCI1BDLSTR.Bits.SBR0
        #define SCI1BDL_SBR1            _SCI1BD.Overlap_STR.SCI1ACR1STR.SameAddr_STR.SCI1BDLSTR.Bits.SBR1
        #define SCI1BDL_SBR2            _SCI1BD.Overlap_STR.SCI1ACR1STR.SameAddr_STR.SCI1BDLSTR.Bits.SBR2
        #define SCI1BDL_SBR3            _SCI1BD.Overlap_STR.SCI1ACR1STR.SameAddr_STR.SCI1BDLSTR.Bits.SBR3
        #define SCI1BDL_SBR4            _SCI1BD.Overlap_STR.SCI1ACR1STR.SameAddr_STR.SCI1BDLSTR.Bits.SBR4
        #define SCI1BDL_SBR5            _SCI1BD.Overlap_STR.SCI1ACR1STR.SameAddr_STR.SCI1BDLSTR.Bits.SBR5
        #define SCI1BDL_SBR6            _SCI1BD.Overlap_STR.SCI1ACR1STR.SameAddr_STR.SCI1BDLSTR.Bits.SBR6
        #define SCI1BDL_SBR7            _SCI1BD.Overlap_STR.SCI1ACR1STR.SameAddr_STR.SCI1BDLSTR.Bits.SBR7
        
        
        #define SCI1BDL_SBR0_MASK       1
        #define SCI1BDL_SBR1_MASK       2
        #define SCI1BDL_SBR2_MASK       4
        #define SCI1BDL_SBR3_MASK       8
        #define SCI1BDL_SBR4_MASK       16
        #define SCI1BDL_SBR5_MASK       32
        #define SCI1BDL_SBR6_MASK       64
        #define SCI1BDL_SBR7_MASK       128
    
      } SameAddr_STR; Several registers at the same address 
    
    } SCI1ACR1STR;
    

  } Overlap_STR;

  struct {
    word SBR0        1;                                        SCI Baud Rate Bit 0 
    word SBR1        1;                                        SCI Baud Rate Bit 1 
    word SBR2        1;                                        SCI Baud Rate Bit 2 
    word SBR3        1;                                        SCI Baud Rate Bit 3 
    word SBR4        1;                                        SCI Baud Rate Bit 4 
    word SBR5        1;                                        SCI Baud Rate Bit 5 
    word SBR6        1;                                        SCI Baud Rate Bit 6 
    word SBR7        1;                                        SCI Baud Rate Bit 7 
    word SBR8        1;                                        SCI Baud Rate Bit 8 
    word SBR9        1;                                        SCI Baud Rate Bit 9 
    word SBR10       1;                                        SCI Baud Rate Bit 10 
    word SBR11       1;                                        SCI Baud Rate Bit 11 
    word SBR12       1;                                        SCI Baud Rate Bit 12 
    word TNP0        1;                                        Transmitter Narrow Pulse Bit 0 
    word TNP1        1;                                        Transmitter Narrow Pulse Bit 1 
    word IREN        1;                                        Infrared Enable Bit 
  } Bits;
  struct {
    word grpSBR  13;
    word grpTNP  2;
    word         1;
  } MergedBits;
} SCI1BDSTR;
extern volatile SCI1BDSTR _SCI1BD @(REG_BASE + 0x000000D0);
#define SCI1BD                          _SCI1BD.Word
#define SCI1BD_SBR0                     _SCI1BD.Bits.SBR0
#define SCI1BD_SBR1                     _SCI1BD.Bits.SBR1
#define SCI1BD_SBR2                     _SCI1BD.Bits.SBR2
#define SCI1BD_SBR3                     _SCI1BD.Bits.SBR3
#define SCI1BD_SBR4                     _SCI1BD.Bits.SBR4
#define SCI1BD_SBR5                     _SCI1BD.Bits.SBR5
#define SCI1BD_SBR6                     _SCI1BD.Bits.SBR6
#define SCI1BD_SBR7                     _SCI1BD.Bits.SBR7
#define SCI1BD_SBR8                     _SCI1BD.Bits.SBR8
#define SCI1BD_SBR9                     _SCI1BD.Bits.SBR9
#define SCI1BD_SBR10                    _SCI1BD.Bits.SBR10
#define SCI1BD_SBR11                    _SCI1BD.Bits.SBR11
#define SCI1BD_SBR12                    _SCI1BD.Bits.SBR12
#define SCI1BD_TNP0                     _SCI1BD.Bits.TNP0
#define SCI1BD_TNP1                     _SCI1BD.Bits.TNP1
#define SCI1BD_IREN                     _SCI1BD.Bits.IREN
#define SCI1BD_SBR                      _SCI1BD.MergedBits.grpSBR
#define SCI1BD_TNP                      _SCI1BD.MergedBits.grpTNP

#define SCI1BD_SBR0_MASK                1
#define SCI1BD_SBR1_MASK                2
#define SCI1BD_SBR2_MASK                4
#define SCI1BD_SBR3_MASK                8
#define SCI1BD_SBR4_MASK                16
#define SCI1BD_SBR5_MASK                32
#define SCI1BD_SBR6_MASK                64
#define SCI1BD_SBR7_MASK                128
#define SCI1BD_SBR8_MASK                256
#define SCI1BD_SBR9_MASK                512
#define SCI1BD_SBR10_MASK               1024
#define SCI1BD_SBR11_MASK               2048
#define SCI1BD_SBR12_MASK               4096
#define SCI1BD_TNP0_MASK                8192
#define SCI1BD_TNP1_MASK                16384
#define SCI1BD_IREN_MASK                32768
#define SCI1BD_SBR_MASK                 8191
#define SCI1BD_SBR_BITNUM               0
#define SCI1BD_TNP_MASK                 24576
#define SCI1BD_TNP_BITNUM               13


