gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
 SCI1ACR2 - SCI 1 Alternative Control Register 2; 0x000000D2 
typedef union {
  byte Byte;
  union { Several registers at the same address 
     SCI1ACR2 - SCI 1 Alternative Control Register 2; Several registers at the same address 
    union {
      struct {
        byte BKDFE       1;                                        Break Detect Feature Enable 
        byte BERRM0      1;                                        Bit Error Mode Bit 0 
        byte BERRM1      1;                                        Bit Error Mode Bit 1 
        byte             1; 
        byte             1; 
        byte             1; 
        byte             1; 
        byte             1; 
      } Bits;
      struct {
        byte     1;
        byte grpBERRM 2;
        byte     1;
        byte     1;
        byte     1;
        byte     1;
        byte     1;
      } MergedBits;
    } SCI1ACR2STR;
    #define SCI1ACR2                    _SCI1ACR2.Byte
    #define SCI1ACR2_BKDFE              _SCI1ACR2.SameAddr_STR.SCI1ACR2STR.Bits.BKDFE
    #define SCI1ACR2_BERRM0             _SCI1ACR2.SameAddr_STR.SCI1ACR2STR.Bits.BERRM0
    #define SCI1ACR2_BERRM1             _SCI1ACR2.SameAddr_STR.SCI1ACR2STR.Bits.BERRM1
    
    #define SCI1ACR2_BERRM              _SCI1ACR2.SameAddr_STR.SCI1ACR2STR.MergedBits.grpBERRM
    
    #define SCI1ACR2_BKDFE_MASK         1
    #define SCI1ACR2_BERRM0_MASK        2
    #define SCI1ACR2_BERRM1_MASK        4
    #define SCI1ACR2_BERRM_MASK         6
    #define SCI1ACR2_BERRM_BITNUM       1

     SCI1CR1 - SCI 1 Control Register 1; Several registers at the same address 
    union {
      struct {
        byte PT          1;                                        Parity Type Bit 
        byte PE          1;                                        Parity Enable Bit 
        byte ILT         1;                                        Idle Line Type Bit 
        byte WAKE        1;                                        Wakeup Condition Bit 
        byte M           1;                                        Data Format Mode Bit 
        byte RSRC        1;                                        Receiver Source Bit 
        byte SCISWAI     1;                                        SCI Stop in Wait Mode Bit 
        byte LOOPS       1;                                        Loop Select Bit 
      } Bits;
    } SCI1CR1STR;
    #define SCI1CR1                     _SCI1ACR2.Byte
    #define SCI1CR1_PT                  _SCI1ACR2.SameAddr_STR.SCI1CR1STR.Bits.PT
    #define SCI1CR1_PE                  _SCI1ACR2.SameAddr_STR.SCI1CR1STR.Bits.PE
    #define SCI1CR1_ILT                 _SCI1ACR2.SameAddr_STR.SCI1CR1STR.Bits.ILT
    #define SCI1CR1_WAKE                _SCI1ACR2.SameAddr_STR.SCI1CR1STR.Bits.WAKE
    #define SCI1CR1_M                   _SCI1ACR2.SameAddr_STR.SCI1CR1STR.Bits.M
    #define SCI1CR1_RSRC                _SCI1ACR2.SameAddr_STR.SCI1CR1STR.Bits.RSRC
    #define SCI1CR1_SCISWAI             _SCI1ACR2.SameAddr_STR.SCI1CR1STR.Bits.SCISWAI
    #define SCI1CR1_LOOPS               _SCI1ACR2.SameAddr_STR.SCI1CR1STR.Bits.LOOPS
    
    
    #define SCI1CR1_PT_MASK             1
    #define SCI1CR1_PE_MASK             2
    #define SCI1CR1_ILT_MASK            4
    #define SCI1CR1_WAKE_MASK           8
    #define SCI1CR1_M_MASK              16
    #define SCI1CR1_RSRC_MASK           32
    #define SCI1CR1_SCISWAI_MASK        64
    #define SCI1CR1_LOOPS_MASK          128

  } SameAddr_STR; Several registers at the same address 

} SCI1ACR2STR;
extern volatile SCI1ACR2STR _SCI1ACR2 @(REG_BASE + 0x000000D2);



 SCI1CR2 - SCI 1 Control Register 2; 0x000000D3 
typedef union {
  byte Byte;
  struct {
    byte SBK         1;                                        Send Break Bit 
    byte RWU         1;                                        Receiver Wakeup Bit 
    byte RE          1;                                        Receiver Enable Bit 
    byte TE          1;                                        Transmitter Enable Bit 
    byte ILIE        1;                                        Idle Line Interrupt Enable Bit 
    byte RIE         1;                                        Receiver Full Interrupt Enable Bit 
    byte TCIE        1;                                        Transmission Complete Interrupt Enable Bit 
    byte SCTIE       1;                                        Transmitter Interrupt Enable Bit 
  } Bits;
} SCI1CR2STR;
extern volatile SCI1CR2STR _SCI1CR2 @(REG_BASE + 0x000000D3);
#define SCI1CR2                         _SCI1CR2.Byte
#define SCI1CR2_SBK                     _SCI1CR2.Bits.SBK
#define SCI1CR2_RWU                     _SCI1CR2.Bits.RWU
#define SCI1CR2_RE                      _SCI1CR2.Bits.RE
#define SCI1CR2_TE                      _SCI1CR2.Bits.TE
#define SCI1CR2_ILIE                    _SCI1CR2.Bits.ILIE
#define SCI1CR2_RIE                     _SCI1CR2.Bits.RIE
#define SCI1CR2_TCIE                    _SCI1CR2.Bits.TCIE
#define SCI1CR2_SCTIE                   _SCI1CR2.Bits.SCTIE

#define SCI1CR2_SBK_MASK                1
#define SCI1CR2_RWU_MASK                2
#define SCI1CR2_RE_MASK                 4
#define SCI1CR2_TE_MASK                 8
#define SCI1CR2_ILIE_MASK               16
#define SCI1CR2_RIE_MASK                32
#define SCI1CR2_TCIE_MASK               64
#define SCI1CR2_SCTIE_MASK              128


 SCI1SR1 - SCI 1 Status Register 1; 0x000000D4 
typedef union {
  byte Byte;
  struct {
    byte PF          1;                                        Parity Error Flag 
    byte FE          1;                                        Framing Error Flag 
    byte NF          1;                                        Noise Flag 
    byte OR          1;                                        Overrun Flag 
    byte IDLE        1;                                        Idle Line Flag 
    byte RDRF        1;                                        Receive Data Register Full Flag 
    byte TC          1;                                        Transmit Complete Flag 
    byte TDRE        1;                                        Transmit Data Register Empty Flag 
  } Bits;
} SCI1SR1STR;
extern volatile SCI1SR1STR _SCI1SR1 @(REG_BASE + 0x000000D4);
#define SCI1SR1                         _SCI1SR1.Byte
#define SCI1SR1_PF                      _SCI1SR1.Bits.PF
#define SCI1SR1_FE                      _SCI1SR1.Bits.FE
#define SCI1SR1_NF                      _SCI1SR1.Bits.NF
#define SCI1SR1_OR                      _SCI1SR1.Bits.OR
#define SCI1SR1_IDLE                    _SCI1SR1.Bits.IDLE
#define SCI1SR1_RDRF                    _SCI1SR1.Bits.RDRF
#define SCI1SR1_TC                      _SCI1SR1.Bits.TC
#define SCI1SR1_TDRE                    _SCI1SR1.Bits.TDRE

#define SCI1SR1_PF_MASK                 1
#define SCI1SR1_FE_MASK                 2
#define SCI1SR1_NF_MASK                 4
#define SCI1SR1_OR_MASK                 8
#define SCI1SR1_IDLE_MASK               16
#define SCI1SR1_RDRF_MASK               32
#define SCI1SR1_TC_MASK                 64
#define SCI1SR1_TDRE_MASK               128


 SCI1SR2 - SCI 1 Status Register 2; 0x000000D5 
typedef union {
  byte Byte;
  struct {
    byte RAF         1;                                        Receiver Active Flag 
    byte TXDIR       1;                                        Transmitter pin data direction in Single-Wire mode 
    byte BRK13       1;                                        Break Transmit character length 
    byte RXPOL       1;                                        Receive Polarity 
    byte TXPOL       1;                                        Transmit Polarity 
    byte             1; 
    byte             1; 
    byte AMAP        1;                                        Alternative Map 
  } Bits;
} SCI1SR2STR;
