gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
extern volatile SCI1SR2STR _SCI1SR2 @(REG_BASE + 0x000000D5);
#define SCI1SR2                         _SCI1SR2.Byte
#define SCI1SR2_RAF                     _SCI1SR2.Bits.RAF
#define SCI1SR2_TXDIR                   _SCI1SR2.Bits.TXDIR
#define SCI1SR2_BRK13                   _SCI1SR2.Bits.BRK13
#define SCI1SR2_RXPOL                   _SCI1SR2.Bits.RXPOL
#define SCI1SR2_TXPOL                   _SCI1SR2.Bits.TXPOL
#define SCI1SR2_AMAP                    _SCI1SR2.Bits.AMAP

#define SCI1SR2_RAF_MASK                1
#define SCI1SR2_TXDIR_MASK              2
#define SCI1SR2_BRK13_MASK              4
#define SCI1SR2_RXPOL_MASK              8
#define SCI1SR2_TXPOL_MASK              16
#define SCI1SR2_AMAP_MASK               128


 SCI1DRH - SCI 1 Data Register High; 0x000000D6 
typedef union {
  byte Byte;
  struct {
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
    byte T8          1;                                        Transmit Bit 8 
    byte R8          1;                                        Received Bit 8 
  } Bits;
} SCI1DRHSTR;
extern volatile SCI1DRHSTR _SCI1DRH @(REG_BASE + 0x000000D6);
#define SCI1DRH                         _SCI1DRH.Byte
#define SCI1DRH_T8                      _SCI1DRH.Bits.T8
#define SCI1DRH_R8                      _SCI1DRH.Bits.R8

#define SCI1DRH_T8_MASK                 64
#define SCI1DRH_R8_MASK                 128


 SCI1DRL - SCI 1 Data Register Low; 0x000000D7 
typedef union {
  byte Byte;
  struct {
    byte R0_T0       1;                                        Received bit 0 or Transmit bit 0 
    byte R1_T1       1;                                        Received bit 1 or Transmit bit 1 
    byte R2_T2       1;                                        Received bit 2 or Transmit bit 2 
    byte R3_T3       1;                                        Received bit 3 or Transmit bit 3 
    byte R4_T4       1;                                        Received bit 4 or Transmit bit 4 
    byte R5_T5       1;                                        Received bit 5 or Transmit bit 5 
    byte R6_T6       1;                                        Received bit 6 or Transmit bit 6 
    byte R7_T7       1;                                        Received bit 7 or Transmit bit 7 
  } Bits;
} SCI1DRLSTR;
extern volatile SCI1DRLSTR _SCI1DRL @(REG_BASE + 0x000000D7);
#define SCI1DRL                         _SCI1DRL.Byte
#define SCI1DRL_R0_T0                   _SCI1DRL.Bits.R0_T0
#define SCI1DRL_R1_T1                   _SCI1DRL.Bits.R1_T1
#define SCI1DRL_R2_T2                   _SCI1DRL.Bits.R2_T2
#define SCI1DRL_R3_T3                   _SCI1DRL.Bits.R3_T3
#define SCI1DRL_R4_T4                   _SCI1DRL.Bits.R4_T4
#define SCI1DRL_R5_T5                   _SCI1DRL.Bits.R5_T5
#define SCI1DRL_R6_T6                   _SCI1DRL.Bits.R6_T6
#define SCI1DRL_R7_T7                   _SCI1DRL.Bits.R7_T7

#define SCI1DRL_R0_T0_MASK              1
#define SCI1DRL_R1_T1_MASK              2
#define SCI1DRL_R2_T2_MASK              4
#define SCI1DRL_R3_T3_MASK              8
#define SCI1DRL_R4_T4_MASK              16
#define SCI1DRL_R5_T5_MASK              32
#define SCI1DRL_R6_T6_MASK              64
#define SCI1DRL_R7_T7_MASK              128


 SPI0CR1 - SPI 0 Control Register; 0x000000D8 
typedef union {
  byte Byte;
  struct {
    byte LSBFE       1;                                        SPI LSB-First Enable 
    byte SSOE        1;                                        Slave Select Output Enable 
    byte CPHA        1;                                        SPI Clock Phase Bit 
    byte CPOL        1;                                        SPI Clock Polarity Bit 
    byte MSTR        1;                                        SPI MasterSlave Mode Select Bit 
    byte SPTIE       1;                                        SPI Transmit Interrupt Enable 
    byte SPE         1;                                        SPI System Enable Bit 
    byte SPIE        1;                                        SPI Interrupt Enable Bit 
  } Bits;
} SPI0CR1STR;
extern volatile SPI0CR1STR _SPI0CR1 @(REG_BASE + 0x000000D8);
#define SPI0CR1                         _SPI0CR1.Byte
#define SPI0CR1_LSBFE                   _SPI0CR1.Bits.LSBFE
#define SPI0CR1_SSOE                    _SPI0CR1.Bits.SSOE
#define SPI0CR1_CPHA                    _SPI0CR1.Bits.CPHA
#define SPI0CR1_CPOL                    _SPI0CR1.Bits.CPOL
#define SPI0CR1_MSTR                    _SPI0CR1.Bits.MSTR
#define SPI0CR1_SPTIE                   _SPI0CR1.Bits.SPTIE
#define SPI0CR1_SPE                     _SPI0CR1.Bits.SPE
#define SPI0CR1_SPIE                    _SPI0CR1.Bits.SPIE

#define SPI0CR1_LSBFE_MASK              1
#define SPI0CR1_SSOE_MASK               2
#define SPI0CR1_CPHA_MASK               4
#define SPI0CR1_CPOL_MASK               8
#define SPI0CR1_MSTR_MASK               16
#define SPI0CR1_SPTIE_MASK              32
#define SPI0CR1_SPE_MASK                64
#define SPI0CR1_SPIE_MASK               128


 SPI0CR2 - SPI 0 Control Register 2; 0x000000D9 
typedef union {
  byte Byte;
  struct {
    byte SPC0        1;                                        Serial Pin Control Bit 0 
    byte SPISWAI     1;                                        SPI Stop in Wait Mode Bit 
    byte             1; 
    byte BIDIROE     1;                                        Output enable in the Bidirectional mode of operation 
    byte MODFEN      1;                                        Mode Fault Enable Bit 
    byte             1; 
    byte             1; 
    byte             1; 
  } Bits;
} SPI0CR2STR;
extern volatile SPI0CR2STR _SPI0CR2 @(REG_BASE + 0x000000D9);
#define SPI0CR2                         _SPI0CR2.Byte
#define SPI0CR2_SPC0                    _SPI0CR2.Bits.SPC0
#define SPI0CR2_SPISWAI                 _SPI0CR2.Bits.SPISWAI
#define SPI0CR2_BIDIROE                 _SPI0CR2.Bits.BIDIROE
#define SPI0CR2_MODFEN                  _SPI0CR2.Bits.MODFEN

#define SPI0CR2_SPC0_MASK               1
#define SPI0CR2_SPISWAI_MASK            2
#define SPI0CR2_BIDIROE_MASK            8
#define SPI0CR2_MODFEN_MASK             16


 SPI0BR - SPI 0 Baud Rate Register; 0x000000DA 
typedef union {
  byte Byte;
  struct {
    byte SPR0        1;                                        SPI Baud Rate Selection Bit 0 
    byte SPR1        1;                                        SPI Baud Rate Selection Bit 1 
    byte SPR2        1;                                        SPI Baud Rate Selection Bit 2 
    byte             1; 
    byte SPPR0       1;                                        SPI Baud Rate Preselection Bits 0 
    byte SPPR1       1;                                        SPI Baud Rate Preselection Bits 1 
    byte SPPR2       1;                                        SPI Baud Rate Preselection Bits 2 
    byte             1; 
  } Bits;
  struct {
    byte grpSPR  3;
    byte         1;
    byte grpSPPR 3;
    byte         1;
  } MergedBits;
} SPI0BRSTR;
