gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
extern volatile SPI0BRSTR _SPI0BR @(REG_BASE + 0x000000DA);
#define SPI0BR                          _SPI0BR.Byte
#define SPI0BR_SPR0                     _SPI0BR.Bits.SPR0
#define SPI0BR_SPR1                     _SPI0BR.Bits.SPR1
#define SPI0BR_SPR2                     _SPI0BR.Bits.SPR2
#define SPI0BR_SPPR0                    _SPI0BR.Bits.SPPR0
#define SPI0BR_SPPR1                    _SPI0BR.Bits.SPPR1
#define SPI0BR_SPPR2                    _SPI0BR.Bits.SPPR2
#define SPI0BR_SPR                      _SPI0BR.MergedBits.grpSPR
#define SPI0BR_SPPR                     _SPI0BR.MergedBits.grpSPPR

#define SPI0BR_SPR0_MASK                1
#define SPI0BR_SPR1_MASK                2
#define SPI0BR_SPR2_MASK                4
#define SPI0BR_SPPR0_MASK               16
#define SPI0BR_SPPR1_MASK               32
#define SPI0BR_SPPR2_MASK               64
#define SPI0BR_SPR_MASK                 7
#define SPI0BR_SPR_BITNUM               0
#define SPI0BR_SPPR_MASK                112
#define SPI0BR_SPPR_BITNUM              4


 SPI0SR - SPI 0 Status Register; 0x000000DB 
typedef union {
  byte Byte;
  struct {
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
    byte MODF        1;                                        Mode Fault Flag 
    byte SPTEF       1;                                        SPI Transmit Empty Interrupt Flag 
    byte             1; 
    byte SPIF        1;                                        SPIF Receive Interrupt Flag 
  } Bits;
} SPI0SRSTR;
extern volatile SPI0SRSTR _SPI0SR @(REG_BASE + 0x000000DB);
#define SPI0SR                          _SPI0SR.Byte
#define SPI0SR_MODF                     _SPI0SR.Bits.MODF
#define SPI0SR_SPTEF                    _SPI0SR.Bits.SPTEF
#define SPI0SR_SPIF                     _SPI0SR.Bits.SPIF

#define SPI0SR_MODF_MASK                16
#define SPI0SR_SPTEF_MASK               32
#define SPI0SR_SPIF_MASK                128


 SPI0DR - SPI 0 Data Register; 0x000000DD 
typedef union {
  byte Byte;
} SPI0DRSTR;
extern volatile SPI0DRSTR _SPI0DR @(REG_BASE + 0x000000DD);
#define SPI0DR                          _SPI0DR.Byte



 IIC0_IBAD - IIC 0 Address Register; 0x000000E0 
typedef union {
  byte Byte;
  struct {
    byte             1; 
    byte ADR1        1;                                        Slave Address Bit 1 
    byte ADR2        1;                                        Slave Address Bit 2 
    byte ADR3        1;                                        Slave Address Bit 3 
    byte ADR4        1;                                        Slave Address Bit 4 
    byte ADR5        1;                                        Slave Address Bit 5 
    byte ADR6        1;                                        Slave Address Bit 6 
    byte ADR7        1;                                        Slave Address Bit 7 
  } Bits;
  struct {
    byte         1;
    byte grpADR_1 7;
  } MergedBits;
} IIC0_IBADSTR;
extern volatile IIC0_IBADSTR _IIC0_IBAD @(REG_BASE + 0x000000E0);
#define IIC0_IBAD                       _IIC0_IBAD.Byte
#define IIC0_IBAD_ADR1                  _IIC0_IBAD.Bits.ADR1
#define IIC0_IBAD_ADR2                  _IIC0_IBAD.Bits.ADR2
#define IIC0_IBAD_ADR3                  _IIC0_IBAD.Bits.ADR3
#define IIC0_IBAD_ADR4                  _IIC0_IBAD.Bits.ADR4
#define IIC0_IBAD_ADR5                  _IIC0_IBAD.Bits.ADR5
#define IIC0_IBAD_ADR6                  _IIC0_IBAD.Bits.ADR6
#define IIC0_IBAD_ADR7                  _IIC0_IBAD.Bits.ADR7
#define IIC0_IBAD_ADR_1                 _IIC0_IBAD.MergedBits.grpADR_1
#define IIC0_IBAD_ADR                   IIC0_IBAD_ADR_1

#define IIC0_IBAD_ADR1_MASK             2
#define IIC0_IBAD_ADR2_MASK             4
#define IIC0_IBAD_ADR3_MASK             8
#define IIC0_IBAD_ADR4_MASK             16
#define IIC0_IBAD_ADR5_MASK             32
#define IIC0_IBAD_ADR6_MASK             64
#define IIC0_IBAD_ADR7_MASK             128
#define IIC0_IBAD_ADR_1_MASK            254
#define IIC0_IBAD_ADR_1_BITNUM          1


 IIC0_IBFD - IIC 0 Frequency Divider Register; 0x000000E1 
typedef union {
  byte Byte;
  struct {
    byte IBC0        1;                                        I-Bus Clock Rate 0 
    byte IBC1        1;                                        I-Bus Clock Rate 1 
    byte IBC2        1;                                        I-Bus Clock Rate 2 
    byte IBC3        1;                                        I-Bus Clock Rate 3 
    byte IBC4        1;                                        I-Bus Clock Rate 4 
    byte IBC5        1;                                        I-Bus Clock Rate 5 
    byte IBC6        1;                                        I-Bus Clock Rate 6 
    byte IBC7        1;                                        I-Bus Clock Rate 7 
  } Bits;
} IIC0_IBFDSTR;
extern volatile IIC0_IBFDSTR _IIC0_IBFD @(REG_BASE + 0x000000E1);
#define IIC0_IBFD                       _IIC0_IBFD.Byte
#define IIC0_IBFD_IBC0                  _IIC0_IBFD.Bits.IBC0
#define IIC0_IBFD_IBC1                  _IIC0_IBFD.Bits.IBC1
#define IIC0_IBFD_IBC2                  _IIC0_IBFD.Bits.IBC2
#define IIC0_IBFD_IBC3                  _IIC0_IBFD.Bits.IBC3
#define IIC0_IBFD_IBC4                  _IIC0_IBFD.Bits.IBC4
#define IIC0_IBFD_IBC5                  _IIC0_IBFD.Bits.IBC5
#define IIC0_IBFD_IBC6                  _IIC0_IBFD.Bits.IBC6
#define IIC0_IBFD_IBC7                  _IIC0_IBFD.Bits.IBC7

#define IIC0_IBFD_IBC0_MASK             1
#define IIC0_IBFD_IBC1_MASK             2
#define IIC0_IBFD_IBC2_MASK             4
#define IIC0_IBFD_IBC3_MASK             8
#define IIC0_IBFD_IBC4_MASK             16
#define IIC0_IBFD_IBC5_MASK             32
#define IIC0_IBFD_IBC6_MASK             64
#define IIC0_IBFD_IBC7_MASK             128


 IIC0_IBCR - IIC 0 Control Register; 0x000000E2 
typedef union {
  byte Byte;
  struct {
    byte IBSWAI      1;                                        I-Bus Interface Stop in WAIT mode 
    byte             1; 
    byte RSTA        1;                                        Repeat Start 
    byte TXAK        1;                                        Transmit Acknowledge enable 
    byte TX_RX       1;                                        TransmitReceive mode select bit 
    byte MS_SL       1;                                        MasterSlave mode select bit 
    byte IBIE        1;                                        I-Bus Interrupt Enable 
    byte IBEN        1;                                        I-Bus Enable 
  } Bits;
} IIC0_IBCRSTR;
extern volatile IIC0_IBCRSTR _IIC0_IBCR @(REG_BASE + 0x000000E2);
#define IIC0_IBCR                       _IIC0_IBCR.Byte
#define IIC0_IBCR_IBSWAI                _IIC0_IBCR.Bits.IBSWAI
#define IIC0_IBCR_RSTA                  _IIC0_IBCR.Bits.RSTA
#define IIC0_IBCR_TXAK                  _IIC0_IBCR.Bits.TXAK
#define IIC0_IBCR_TX_RX                 _IIC0_IBCR.Bits.TX_RX
#define IIC0_IBCR_MS_SL                 _IIC0_IBCR.Bits.MS_SL
#define IIC0_IBCR_IBIE                  _IIC0_IBCR.Bits.IBIE
#define IIC0_IBCR_IBEN                  _IIC0_IBCR.Bits.IBEN

