gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
#define IIC0_IBCR_IBSWAI_MASK           1
#define IIC0_IBCR_RSTA_MASK             4
#define IIC0_IBCR_TXAK_MASK             8
#define IIC0_IBCR_TX_RX_MASK            16
#define IIC0_IBCR_MS_SL_MASK            32
#define IIC0_IBCR_IBIE_MASK             64
#define IIC0_IBCR_IBEN_MASK             128


 IIC0_IBSR - IIC 0 Status Register; 0x000000E3 
typedef union {
  byte Byte;
  struct {
    byte RXAK        1;                                        Received Acknowledge 
    byte IBIF        1;                                        I-Bus Interrupt 
    byte SRW         1;                                        Slave ReadWrite 
    byte             1; 
    byte IBAL        1;                                        Arbitration Lost 
    byte IBB         1;                                        Bus busy bit 
    byte IAAS        1;                                        Addressed as a slave bit 
    byte TCF         1;                                        Data transferring bit 
  } Bits;
} IIC0_IBSRSTR;
extern volatile IIC0_IBSRSTR _IIC0_IBSR @(REG_BASE + 0x000000E3);
#define IIC0_IBSR                       _IIC0_IBSR.Byte
#define IIC0_IBSR_RXAK                  _IIC0_IBSR.Bits.RXAK
#define IIC0_IBSR_IBIF                  _IIC0_IBSR.Bits.IBIF
#define IIC0_IBSR_SRW                   _IIC0_IBSR.Bits.SRW
#define IIC0_IBSR_IBAL                  _IIC0_IBSR.Bits.IBAL
#define IIC0_IBSR_IBB                   _IIC0_IBSR.Bits.IBB
#define IIC0_IBSR_IAAS                  _IIC0_IBSR.Bits.IAAS
#define IIC0_IBSR_TCF                   _IIC0_IBSR.Bits.TCF

#define IIC0_IBSR_RXAK_MASK             1
#define IIC0_IBSR_IBIF_MASK             2
#define IIC0_IBSR_SRW_MASK              4
#define IIC0_IBSR_IBAL_MASK             16
#define IIC0_IBSR_IBB_MASK              32
#define IIC0_IBSR_IAAS_MASK             64
#define IIC0_IBSR_TCF_MASK              128


 IIC0_IBDR - IIC 0 Data IO Register; 0x000000E4 
typedef union {
  byte Byte;
  struct {
    byte D0          1;                                        IIC Data Bit 0 
    byte D1          1;                                        IIC Data Bit 1 
    byte D2          1;                                        IIC Data Bit 2 
    byte D3          1;                                        IIC Data Bit 3 
    byte D4          1;                                        IIC Data Bit 4 
    byte D5          1;                                        IIC Data Bit 5 
    byte D6          1;                                        IIC Data Bit 6 
    byte D7          1;                                        IIC Data Bit 7 
  } Bits;
} IIC0_IBDRSTR;
extern volatile IIC0_IBDRSTR _IIC0_IBDR @(REG_BASE + 0x000000E4);
#define IIC0_IBDR                       _IIC0_IBDR.Byte
#define IIC0_IBDR_D0                    _IIC0_IBDR.Bits.D0
#define IIC0_IBDR_D1                    _IIC0_IBDR.Bits.D1
#define IIC0_IBDR_D2                    _IIC0_IBDR.Bits.D2
#define IIC0_IBDR_D3                    _IIC0_IBDR.Bits.D3
#define IIC0_IBDR_D4                    _IIC0_IBDR.Bits.D4
#define IIC0_IBDR_D5                    _IIC0_IBDR.Bits.D5
#define IIC0_IBDR_D6                    _IIC0_IBDR.Bits.D6
#define IIC0_IBDR_D7                    _IIC0_IBDR.Bits.D7

#define IIC0_IBDR_D0_MASK               1
#define IIC0_IBDR_D1_MASK               2
#define IIC0_IBDR_D2_MASK               4
#define IIC0_IBDR_D3_MASK               8
#define IIC0_IBDR_D4_MASK               16
#define IIC0_IBDR_D5_MASK               32
#define IIC0_IBDR_D6_MASK               64
#define IIC0_IBDR_D7_MASK               128


 SPI1CR1 - SPI 1 Control Register; 0x000000F0 
typedef union {
  byte Byte;
  struct {
    byte LSBFE       1;                                        SPI LSB-First Enable 
    byte SSOE        1;                                        Slave Select Output Enable 
    byte CPHA        1;                                        SPI Clock Phase Bit 
    byte CPOL        1;                                        SPI Clock Polarity Bit 
    byte MSTR        1;                                        SPI MasterSlave Mode Select Bit 
    byte SPTIE       1;                                        SPI Transmit Interrupt Enable 
    byte SPE         1;                                        SPI System Enable Bit 
    byte SPIE        1;                                        SPI Interrupt Enable Bit 
  } Bits;
} SPI1CR1STR;
extern volatile SPI1CR1STR _SPI1CR1 @(REG_BASE + 0x000000F0);
#define SPI1CR1                         _SPI1CR1.Byte
#define SPI1CR1_LSBFE                   _SPI1CR1.Bits.LSBFE
#define SPI1CR1_SSOE                    _SPI1CR1.Bits.SSOE
#define SPI1CR1_CPHA                    _SPI1CR1.Bits.CPHA
#define SPI1CR1_CPOL                    _SPI1CR1.Bits.CPOL
#define SPI1CR1_MSTR                    _SPI1CR1.Bits.MSTR
#define SPI1CR1_SPTIE                   _SPI1CR1.Bits.SPTIE
#define SPI1CR1_SPE                     _SPI1CR1.Bits.SPE
#define SPI1CR1_SPIE                    _SPI1CR1.Bits.SPIE

#define SPI1CR1_LSBFE_MASK              1
#define SPI1CR1_SSOE_MASK               2
#define SPI1CR1_CPHA_MASK               4
#define SPI1CR1_CPOL_MASK               8
#define SPI1CR1_MSTR_MASK               16
#define SPI1CR1_SPTIE_MASK              32
#define SPI1CR1_SPE_MASK                64
#define SPI1CR1_SPIE_MASK               128


 SPI1CR2 - SPI 1 Control Register 2; 0x000000F1 
typedef union {
  byte Byte;
  struct {
    byte SPC0        1;                                        Serial Pin Control Bit 0 
    byte SPISWAI     1;                                        SPI Stop in Wait Mode Bit 
    byte             1; 
    byte BIDIROE     1;                                        Output enable in the Bidirectional mode of operation 
    byte MODFEN      1;                                        Mode Fault Enable Bit 
    byte             1; 
    byte             1; 
    byte             1; 
  } Bits;
} SPI1CR2STR;
extern volatile SPI1CR2STR _SPI1CR2 @(REG_BASE + 0x000000F1);
#define SPI1CR2                         _SPI1CR2.Byte
#define SPI1CR2_SPC0                    _SPI1CR2.Bits.SPC0
#define SPI1CR2_SPISWAI                 _SPI1CR2.Bits.SPISWAI
#define SPI1CR2_BIDIROE                 _SPI1CR2.Bits.BIDIROE
#define SPI1CR2_MODFEN                  _SPI1CR2.Bits.MODFEN

#define SPI1CR2_SPC0_MASK               1
#define SPI1CR2_SPISWAI_MASK            2
#define SPI1CR2_BIDIROE_MASK            8
#define SPI1CR2_MODFEN_MASK             16


 SPI1BR - SPI 1 Baud Rate Register; 0x000000F2 
typedef union {
  byte Byte;
  struct {
    byte SPR0        1;                                        SPI Baud Rate Selection Bit 0 
    byte SPR1        1;                                        SPI Baud Rate Selection Bit 1 
    byte SPR2        1;                                        SPI Baud Rate Selection Bit 2 
    byte             1; 
    byte SPPR0       1;                                        SPI Baud Rate Preselection Bits 0 
    byte SPPR1       1;                                        SPI Baud Rate Preselection Bits 1 
    byte SPPR2       1;                                        SPI Baud Rate Preselection Bits 2 
    byte             1; 
  } Bits;
  struct {
    byte grpSPR  3;
    byte         1;
    byte grpSPPR 3;
    byte         1;
  } MergedBits;
} SPI1BRSTR;
extern volatile SPI1BRSTR _SPI1BR @(REG_BASE + 0x000000F2);
#define SPI1BR                          _SPI1BR.Byte
#define SPI1BR_SPR0                     _SPI1BR.Bits.SPR0
#define SPI1BR_SPR1                     _SPI1BR.Bits.SPR1
#define SPI1BR_SPR2                     _SPI1BR.Bits.SPR2
#define SPI1BR_SPPR0                    _SPI1BR.Bits.SPPR0
#define SPI1BR_SPPR1                    _SPI1BR.Bits.SPPR1
#define SPI1BR_SPPR2                    _SPI1BR.Bits.SPPR2
#define SPI1BR_SPR                      _SPI1BR.MergedBits.grpSPR
#define SPI1BR_SPPR                     _SPI1BR.MergedBits.grpSPPR

#define SPI1BR_SPR0_MASK                1
#define SPI1BR_SPR1_MASK                2
#define SPI1BR_SPR2_MASK                4
#define SPI1BR_SPPR0_MASK               16
#define SPI1BR_SPPR1_MASK               32
#define SPI1BR_SPPR2_MASK               64
#define SPI1BR_SPR_MASK                 7
#define SPI1BR_SPR_BITNUM               0
#define SPI1BR_SPPR_MASK                112
#define SPI1BR_SPPR_BITNUM              4


 SPI1SR - SPI 1 Status Register; 0x000000F3 
typedef union {
  byte Byte;
  struct {
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
    byte MODF        1;                                        Mode Fault Flag 
    byte SPTEF       1;                                        SPI Transmit Empty Interrupt Flag 
    byte             1; 
    byte SPIF        1;                                        SPIF Receive Interrupt Flag 
  } Bits;
} SPI1SRSTR;
