gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
extern volatile SPI1SRSTR _SPI1SR @(REG_BASE + 0x000000F3);
#define SPI1SR                          _SPI1SR.Byte
#define SPI1SR_MODF                     _SPI1SR.Bits.MODF
#define SPI1SR_SPTEF                    _SPI1SR.Bits.SPTEF
#define SPI1SR_SPIF                     _SPI1SR.Bits.SPIF

#define SPI1SR_MODF_MASK                16
#define SPI1SR_SPTEF_MASK               32
#define SPI1SR_SPIF_MASK                128


 SPI1DR - SPI 1 Data Register; 0x000000F5 
typedef union {
  byte Byte;
} SPI1DRSTR;
extern volatile SPI1DRSTR _SPI1DR @(REG_BASE + 0x000000F5);
#define SPI1DR                          _SPI1DR.Byte



 SPI2CR1 - SPI 2 Control Register; 0x000000F8 
typedef union {
  byte Byte;
  struct {
    byte LSBFE       1;                                        SPI LSB-First Enable 
    byte SSOE        1;                                        Slave Select Output Enable 
    byte CPHA        1;                                        SPI Clock Phase Bit 
    byte CPOL        1;                                        SPI Clock Polarity Bit 
    byte MSTR        1;                                        SPI MasterSlave Mode Select Bit 
    byte SPTIE       1;                                        SPI Transmit Interrupt Enable 
    byte SPE         1;                                        SPI System Enable Bit 
    byte SPIE        1;                                        SPI Interrupt Enable Bit 
  } Bits;
} SPI2CR1STR;
extern volatile SPI2CR1STR _SPI2CR1 @(REG_BASE + 0x000000F8);
#define SPI2CR1                         _SPI2CR1.Byte
#define SPI2CR1_LSBFE                   _SPI2CR1.Bits.LSBFE
#define SPI2CR1_SSOE                    _SPI2CR1.Bits.SSOE
#define SPI2CR1_CPHA                    _SPI2CR1.Bits.CPHA
#define SPI2CR1_CPOL                    _SPI2CR1.Bits.CPOL
#define SPI2CR1_MSTR                    _SPI2CR1.Bits.MSTR
#define SPI2CR1_SPTIE                   _SPI2CR1.Bits.SPTIE
#define SPI2CR1_SPE                     _SPI2CR1.Bits.SPE
#define SPI2CR1_SPIE                    _SPI2CR1.Bits.SPIE

#define SPI2CR1_LSBFE_MASK              1
#define SPI2CR1_SSOE_MASK               2
#define SPI2CR1_CPHA_MASK               4
#define SPI2CR1_CPOL_MASK               8
#define SPI2CR1_MSTR_MASK               16
#define SPI2CR1_SPTIE_MASK              32
#define SPI2CR1_SPE_MASK                64
#define SPI2CR1_SPIE_MASK               128


 SPI2CR2 - SPI 2 Control Register 2; 0x000000F9 
typedef union {
  byte Byte;
  struct {
    byte SPC0        1;                                        Serial Pin Control Bit 0 
    byte SPISWAI     1;                                        SPI Stop in Wait Mode Bit 
    byte             1; 
    byte BIDIROE     1;                                        Output enable in the Bidirectional mode of operation 
    byte MODFEN      1;                                        Mode Fault Enable Bit 
    byte             1; 
    byte             1; 
    byte             1; 
  } Bits;
} SPI2CR2STR;
extern volatile SPI2CR2STR _SPI2CR2 @(REG_BASE + 0x000000F9);
#define SPI2CR2                         _SPI2CR2.Byte
#define SPI2CR2_SPC0                    _SPI2CR2.Bits.SPC0
#define SPI2CR2_SPISWAI                 _SPI2CR2.Bits.SPISWAI
#define SPI2CR2_BIDIROE                 _SPI2CR2.Bits.BIDIROE
#define SPI2CR2_MODFEN                  _SPI2CR2.Bits.MODFEN

#define SPI2CR2_SPC0_MASK               1
#define SPI2CR2_SPISWAI_MASK            2
#define SPI2CR2_BIDIROE_MASK            8
#define SPI2CR2_MODFEN_MASK             16


 SPI2BR - SPI 2 Baud Rate Register; 0x000000FA 
typedef union {
  byte Byte;
  struct {
    byte SPR0        1;                                        SPI Baud Rate Selection Bit 0 
    byte SPR1        1;                                        SPI Baud Rate Selection Bit 1 
    byte SPR2        1;                                        SPI Baud Rate Selection Bit 2 
    byte             1; 
    byte SPPR0       1;                                        SPI Baud Rate Preselection Bits 0 
    byte SPPR1       1;                                        SPI Baud Rate Preselection Bits 1 
    byte SPPR2       1;                                        SPI Baud Rate Preselection Bits 2 
    byte             1; 
  } Bits;
  struct {
    byte grpSPR  3;
    byte         1;
    byte grpSPPR 3;
    byte         1;
  } MergedBits;
} SPI2BRSTR;
extern volatile SPI2BRSTR _SPI2BR @(REG_BASE + 0x000000FA);
#define SPI2BR                          _SPI2BR.Byte
#define SPI2BR_SPR0                     _SPI2BR.Bits.SPR0
#define SPI2BR_SPR1                     _SPI2BR.Bits.SPR1
#define SPI2BR_SPR2                     _SPI2BR.Bits.SPR2
#define SPI2BR_SPPR0                    _SPI2BR.Bits.SPPR0
#define SPI2BR_SPPR1                    _SPI2BR.Bits.SPPR1
#define SPI2BR_SPPR2                    _SPI2BR.Bits.SPPR2
#define SPI2BR_SPR                      _SPI2BR.MergedBits.grpSPR
#define SPI2BR_SPPR                     _SPI2BR.MergedBits.grpSPPR

#define SPI2BR_SPR0_MASK                1
#define SPI2BR_SPR1_MASK                2
#define SPI2BR_SPR2_MASK                4
#define SPI2BR_SPPR0_MASK               16
#define SPI2BR_SPPR1_MASK               32
#define SPI2BR_SPPR2_MASK               64
#define SPI2BR_SPR_MASK                 7
#define SPI2BR_SPR_BITNUM               0
#define SPI2BR_SPPR_MASK                112
#define SPI2BR_SPPR_BITNUM              4


 SPI2SR - SPI 2 Status Register; 0x000000FB 
typedef union {
  byte Byte;
  struct {
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
    byte MODF        1;                                        Mode Fault Flag 
    byte SPTEF       1;                                        SPI Transmit Empty Interrupt Flag 
    byte             1; 
    byte SPIF        1;                                        SPIF Receive Interrupt Flag 
  } Bits;
} SPI2SRSTR;
extern volatile SPI2SRSTR _SPI2SR @(REG_BASE + 0x000000FB);
#define SPI2SR                          _SPI2SR.Byte
#define SPI2SR_MODF                     _SPI2SR.Bits.MODF
#define SPI2SR_SPTEF                    _SPI2SR.Bits.SPTEF
#define SPI2SR_SPIF                     _SPI2SR.Bits.SPIF

#define SPI2SR_MODF_MASK                16
#define SPI2SR_SPTEF_MASK               32
#define SPI2SR_SPIF_MASK                128


 SPI2DR - SPI 2 Data Register; 0x000000FD 
typedef union {
  byte Byte;
} SPI2DRSTR;
extern volatile SPI2DRSTR _SPI2DR @(REG_BASE + 0x000000FD);
#define SPI2DR                          _SPI2DR.Byte



 FCLKDIV - Flash Clock Divider Register; 0x00000100 
typedef union {
  byte Byte;
  struct {
    byte FDIV0       1;                                        Flash Clock Divider Bit 0 
    byte FDIV1       1;                                        Flash Clock Divider Bit 1 
    byte FDIV2       1;                                        Flash Clock Divider Bit 2 
    byte FDIV3       1;                                        Flash Clock Divider Bit 3 
    byte FDIV4       1;                                        Flash Clock Divider Bit 4 
    byte FDIV5       1;                                        Flash Clock Divider Bit 5 
    byte PRDIV8      1;                                        Enable Prescaler by 8 
    byte FDIVLD      1;                                        Flash Clock Divider Loaded 
  } Bits;
  struct {
    byte grpFDIV 6;
    byte grpPRDIV_8 1;
    byte         1;
  } MergedBits;
} FCLKDIVSTR;
