gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
extern volatile FCLKDIVSTR _FCLKDIV @(REG_BASE + 0x00000100);
#define FCLKDIV                         _FCLKDIV.Byte
#define FCLKDIV_FDIV0                   _FCLKDIV.Bits.FDIV0
#define FCLKDIV_FDIV1                   _FCLKDIV.Bits.FDIV1
#define FCLKDIV_FDIV2                   _FCLKDIV.Bits.FDIV2
#define FCLKDIV_FDIV3                   _FCLKDIV.Bits.FDIV3
#define FCLKDIV_FDIV4                   _FCLKDIV.Bits.FDIV4
#define FCLKDIV_FDIV5                   _FCLKDIV.Bits.FDIV5
#define FCLKDIV_PRDIV8                  _FCLKDIV.Bits.PRDIV8
#define FCLKDIV_FDIVLD                  _FCLKDIV.Bits.FDIVLD
#define FCLKDIV_FDIV                    _FCLKDIV.MergedBits.grpFDIV

#define FCLKDIV_FDIV0_MASK              1
#define FCLKDIV_FDIV1_MASK              2
#define FCLKDIV_FDIV2_MASK              4
#define FCLKDIV_FDIV3_MASK              8
#define FCLKDIV_FDIV4_MASK              16
#define FCLKDIV_FDIV5_MASK              32
#define FCLKDIV_PRDIV8_MASK             64
#define FCLKDIV_FDIVLD_MASK             128
#define FCLKDIV_FDIV_MASK               63
#define FCLKDIV_FDIV_BITNUM             0


 FSEC - Flash Security Register; 0x00000101 
typedef union {
  byte Byte;
  struct {
    byte SEC0        1;                                        Memory security bit 0 
    byte SEC1        1;                                        Memory security bit 1 
    byte RNV2        1;                                        Reserved Non Volatile flag bit 2 
    byte RNV3        1;                                        Reserved Non Volatile flag bit 3 
    byte RNV4        1;                                        Reserved Non Volatile flag bit 4 
    byte RNV5        1;                                        Reserved Non Volatile flag bit 5 
    byte KEYEN0      1;                                        Backdoor Key Security Enable Bit 0 
    byte KEYEN1      1;                                        Backdoor Key Security Enable Bit 1 
  } Bits;
  struct {
    byte grpSEC  2;
    byte grpRNV_2 4;
    byte grpKEYEN 2;
  } MergedBits;
} FSECSTR;
extern volatile FSECSTR _FSEC @(REG_BASE + 0x00000101);
#define FSEC                            _FSEC.Byte
#define FSEC_SEC0                       _FSEC.Bits.SEC0
#define FSEC_SEC1                       _FSEC.Bits.SEC1
#define FSEC_RNV2                       _FSEC.Bits.RNV2
#define FSEC_RNV3                       _FSEC.Bits.RNV3
#define FSEC_RNV4                       _FSEC.Bits.RNV4
#define FSEC_RNV5                       _FSEC.Bits.RNV5
#define FSEC_KEYEN0                     _FSEC.Bits.KEYEN0
#define FSEC_KEYEN1                     _FSEC.Bits.KEYEN1
#define FSEC_SEC                        _FSEC.MergedBits.grpSEC
#define FSEC_RNV_2                      _FSEC.MergedBits.grpRNV_2
#define FSEC_KEYEN                      _FSEC.MergedBits.grpKEYEN
#define FSEC_RNV                        FSEC_RNV_2

#define FSEC_SEC0_MASK                  1
#define FSEC_SEC1_MASK                  2
#define FSEC_RNV2_MASK                  4
#define FSEC_RNV3_MASK                  8
#define FSEC_RNV4_MASK                  16
#define FSEC_RNV5_MASK                  32
#define FSEC_KEYEN0_MASK                64
#define FSEC_KEYEN1_MASK                128
#define FSEC_SEC_MASK                   3
#define FSEC_SEC_BITNUM                 0
#define FSEC_RNV_2_MASK                 60
#define FSEC_RNV_2_BITNUM               2
#define FSEC_KEYEN_MASK                 192
#define FSEC_KEYEN_BITNUM               6


 FTSTMOD - Flash Test Mode Register; 0x00000102 
typedef union {
  byte Byte;
  struct {
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
    byte WRALL       1;                                        Write to all register banks 
    byte MRDS        2;                                        Margin Read Setting 
    byte             1; 
  } Bits;
} FTSTMODSTR;
extern volatile FTSTMODSTR _FTSTMOD @(REG_BASE + 0x00000102);
#define FTSTMOD                         _FTSTMOD.Byte
#define FTSTMOD_WRALL                   _FTSTMOD.Bits.WRALL
#define FTSTMOD_MRDS                    _FTSTMOD.Bits.MRDS

#define FTSTMOD_WRALL_MASK              16
#define FTSTMOD_MRDS_MASK               96
#define FTSTMOD_MRDS_BITNUM             5


 FCNFG - Flash Configuration Register; 0x00000103 
typedef union {
  byte Byte;
  struct {
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
    byte KEYACC      1;                                        Enable Security Key Writing 
    byte CCIE        1;                                        Command Complete Interrupt Enable 
    byte CBEIE       1;                                        Command Buffers Empty Interrupt Enable 
  } Bits;
} FCNFGSTR;
extern volatile FCNFGSTR _FCNFG @(REG_BASE + 0x00000103);
#define FCNFG                           _FCNFG.Byte
#define FCNFG_KEYACC                    _FCNFG.Bits.KEYACC
#define FCNFG_CCIE                      _FCNFG.Bits.CCIE
#define FCNFG_CBEIE                     _FCNFG.Bits.CBEIE

#define FCNFG_KEYACC_MASK               32
#define FCNFG_CCIE_MASK                 64
#define FCNFG_CBEIE_MASK                128


 FPROT - Flash Protection Register; 0x00000104 
typedef union {
  byte Byte;
  struct {
    byte FPLS0       1;                                        Flash Protection Lower Address size 0 
    byte FPLS1       1;                                        Flash Protection Lower Address size 1 
    byte FPLDIS      1;                                        Flash Protection Lower address range disable 
    byte FPHS0       1;                                        Flash Protection Higher address size 0 
    byte FPHS1       1;                                        Flash Protection Higher address size 1 
    byte FPHDIS      1;                                        Flash Protection Higher address range disable 
    byte RNV6        1;                                        Reserved Non-Volatile Bit 
    byte FPOPEN      1;                                        Opens the flash block or subsections of it for program or erase 
  } Bits;
  struct {
    byte grpFPLS 2;
    byte         1;
    byte grpFPHS 2;
    byte         1;
    byte grpRNV_6 1;
    byte         1;
  } MergedBits;
} FPROTSTR;
extern volatile FPROTSTR _FPROT @(REG_BASE + 0x00000104);
#define FPROT                           _FPROT.Byte
#define FPROT_FPLS0                     _FPROT.Bits.FPLS0
#define FPROT_FPLS1                     _FPROT.Bits.FPLS1
#define FPROT_FPLDIS                    _FPROT.Bits.FPLDIS
#define FPROT_FPHS0                     _FPROT.Bits.FPHS0
#define FPROT_FPHS1                     _FPROT.Bits.FPHS1
#define FPROT_FPHDIS                    _FPROT.Bits.FPHDIS
#define FPROT_RNV6                      _FPROT.Bits.RNV6
#define FPROT_FPOPEN                    _FPROT.Bits.FPOPEN
#define FPROT_FPLS                      _FPROT.MergedBits.grpFPLS
#define FPROT_FPHS                      _FPROT.MergedBits.grpFPHS

