gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
#define FPROT_FPLS0_MASK                1
#define FPROT_FPLS1_MASK                2
#define FPROT_FPLDIS_MASK               4
#define FPROT_FPHS0_MASK                8
#define FPROT_FPHS1_MASK                16
#define FPROT_FPHDIS_MASK               32
#define FPROT_RNV6_MASK                 64
#define FPROT_FPOPEN_MASK               128
#define FPROT_FPLS_MASK                 3
#define FPROT_FPLS_BITNUM               0
#define FPROT_FPHS_MASK                 24
#define FPROT_FPHS_BITNUM               3


 FSTAT - Flash Status Register; 0x00000105 
typedef union {
  byte Byte;
  struct {
    byte             1; 
    byte             1; 
    byte BLANK       1;                                        Blank Verify Flag 
    byte             1; 
    byte ACCERR      1;                                        Access error 
    byte PVIOL       1;                                        Protection violation 
    byte CCIF        1;                                        Command Complete Interrupt Flag 
    byte CBEIF       1;                                        Command Buffers Empty Interrupt Flag 
  } Bits;
} FSTATSTR;
extern volatile FSTATSTR _FSTAT @(REG_BASE + 0x00000105);
#define FSTAT                           _FSTAT.Byte
#define FSTAT_BLANK                     _FSTAT.Bits.BLANK
#define FSTAT_ACCERR                    _FSTAT.Bits.ACCERR
#define FSTAT_PVIOL                     _FSTAT.Bits.PVIOL
#define FSTAT_CCIF                      _FSTAT.Bits.CCIF
#define FSTAT_CBEIF                     _FSTAT.Bits.CBEIF

#define FSTAT_BLANK_MASK                4
#define FSTAT_ACCERR_MASK               16
#define FSTAT_PVIOL_MASK                32
#define FSTAT_CCIF_MASK                 64
#define FSTAT_CBEIF_MASK                128


 FCMD - Flash Command Buffer and Register; 0x00000106 
typedef union {
  byte Byte;
  struct {
    byte CMDB0       1;                                        NVM User Mode Command Bit 0 
    byte CMDB1       1;                                        NVM User Mode Command Bit 1 
    byte CMDB2       1;                                        NVM User Mode Command Bit 2 
    byte CMDB3       1;                                        NVM User Mode Command Bit 3 
    byte CMDB4       1;                                        NVM User Mode Command Bit 4 
    byte CMDB5       1;                                        NVM User Mode Command Bit 5 
    byte CMDB6       1;                                        NVM User Mode Command Bit 6 
    byte             1; 
  } Bits;
  struct {
    byte grpCMDB 7;
    byte         1;
  } MergedBits;
} FCMDSTR;
extern volatile FCMDSTR _FCMD @(REG_BASE + 0x00000106);
#define FCMD                            _FCMD.Byte
#define FCMD_CMDB0                      _FCMD.Bits.CMDB0
#define FCMD_CMDB1                      _FCMD.Bits.CMDB1
#define FCMD_CMDB2                      _FCMD.Bits.CMDB2
#define FCMD_CMDB3                      _FCMD.Bits.CMDB3
#define FCMD_CMDB4                      _FCMD.Bits.CMDB4
#define FCMD_CMDB5                      _FCMD.Bits.CMDB5
#define FCMD_CMDB6                      _FCMD.Bits.CMDB6
#define FCMD_CMDB                       _FCMD.MergedBits.grpCMDB

#define FCMD_CMDB0_MASK                 1
#define FCMD_CMDB1_MASK                 2
#define FCMD_CMDB2_MASK                 4
#define FCMD_CMDB3_MASK                 8
#define FCMD_CMDB4_MASK                 16
#define FCMD_CMDB5_MASK                 32
#define FCMD_CMDB6_MASK                 64
#define FCMD_CMDB_MASK                  127
#define FCMD_CMDB_BITNUM                0


 FADDRHI - Flash Address High Register; 0x00000108 
typedef union {
  byte Byte;
} FADDRHISTR;
extern volatile FADDRHISTR _FADDRHI @(REG_BASE + 0x00000108);
#define FADDRHI                         _FADDRHI.Byte



 FADDRLO - Flash Address Low Register; 0x00000109 
typedef union {
  byte Byte;
} FADDRLOSTR;
extern volatile FADDRLOSTR _FADDRLO @(REG_BASE + 0x00000109);
#define FADDRLO                         _FADDRLO.Byte



 FDATAHI - Flash Data High Register; 0x0000010A 
typedef union {
  byte Byte;
} FDATAHISTR;
extern volatile FDATAHISTR _FDATAHI @(REG_BASE + 0x0000010A);
#define FDATAHI                         _FDATAHI.Byte



 FDATALO - Flash Data Low Register; 0x0000010B 
typedef union {
  byte Byte;
} FDATALOSTR;
extern volatile FDATALOSTR _FDATALO @(REG_BASE + 0x0000010B);
#define FDATALO                         _FDATALO.Byte



 ECLKDIV - EEPROM Clock Divider Register; 0x00000110 
typedef union {
  byte Byte;
  struct {
    byte EDIV0       1;                                        EEPROM Clock Divider 0 
    byte EDIV1       1;                                        EEPROM Clock Divider 1 
    byte EDIV2       1;                                        EEPROM Clock Divider 2 
    byte EDIV3       1;                                        EEPROM Clock Divider 3 
    byte EDIV4       1;                                        EEPROM Clock Divider 4 
    byte EDIV5       1;                                        EEPROM Clock Divider 5 
    byte PRDIV8      1;                                        Enable Prescaler by 8 
    byte EDIVLD      1;                                        EEPROM Clock Divider Loaded 
  } Bits;
  struct {
    byte grpEDIV 6;
    byte grpPRDIV_8 1;
    byte         1;
  } MergedBits;
} ECLKDIVSTR;
extern volatile ECLKDIVSTR _ECLKDIV @(REG_BASE + 0x00000110);
#define ECLKDIV                         _ECLKDIV.Byte
#define ECLKDIV_EDIV0                   _ECLKDIV.Bits.EDIV0
#define ECLKDIV_EDIV1                   _ECLKDIV.Bits.EDIV1
#define ECLKDIV_EDIV2                   _ECLKDIV.Bits.EDIV2
#define ECLKDIV_EDIV3                   _ECLKDIV.Bits.EDIV3
#define ECLKDIV_EDIV4                   _ECLKDIV.Bits.EDIV4
#define ECLKDIV_EDIV5                   _ECLKDIV.Bits.EDIV5
#define ECLKDIV_PRDIV8                  _ECLKDIV.Bits.PRDIV8
#define ECLKDIV_EDIVLD                  _ECLKDIV.Bits.EDIVLD
#define ECLKDIV_EDIV                    _ECLKDIV.MergedBits.grpEDIV

#define ECLKDIV_EDIV0_MASK              1
#define ECLKDIV_EDIV1_MASK              2
#define ECLKDIV_EDIV2_MASK              4
#define ECLKDIV_EDIV3_MASK              8
#define ECLKDIV_EDIV4_MASK              16
#define ECLKDIV_EDIV5_MASK              32
#define ECLKDIV_PRDIV8_MASK             64
#define ECLKDIV_EDIVLD_MASK             128
#define ECLKDIV_EDIV_MASK               63
#define ECLKDIV_EDIV_BITNUM             0


 ECNFG - EEPROM Configuration Register; 0x00000113 
typedef union {
  byte Byte;
  struct {
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
    byte CCIE        1;                                        Command Complete Interrupt Enable 
    byte CBEIE       1;                                        Command Buffers Empty Interrupt Enable 
  } Bits;
} ECNFGSTR;
