gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
 RAMXGU - RAM XGATE Upper Boundary Register; 0x0000011D 
typedef union {
  byte Byte;
  struct {
    byte XGU0        1;                                        XGATE Region Upper Boundary Bit 0 
    byte XGU1        1;                                        XGATE Region Upper Boundary Bit 1 
    byte XGU2        1;                                        XGATE Region Upper Boundary Bit 2 
    byte XGU3        1;                                        XGATE Region Upper Boundary Bit 3 
    byte XGU4        1;                                        XGATE Region Upper Boundary Bit 4 
    byte XGU5        1;                                        XGATE Region Upper Boundary Bit 5 
    byte XGU6        1;                                        XGATE Region Upper Boundary Bit 6 
    byte             1; 
  } Bits;
  struct {
    byte grpXGU  7;
    byte         1;
  } MergedBits;
} RAMXGUSTR;
extern volatile RAMXGUSTR _RAMXGU @(REG_BASE + 0x0000011D);
#define RAMXGU                          _RAMXGU.Byte
#define RAMXGU_XGU0                     _RAMXGU.Bits.XGU0
#define RAMXGU_XGU1                     _RAMXGU.Bits.XGU1
#define RAMXGU_XGU2                     _RAMXGU.Bits.XGU2
#define RAMXGU_XGU3                     _RAMXGU.Bits.XGU3
#define RAMXGU_XGU4                     _RAMXGU.Bits.XGU4
#define RAMXGU_XGU5                     _RAMXGU.Bits.XGU5
#define RAMXGU_XGU6                     _RAMXGU.Bits.XGU6
#define RAMXGU_XGU                      _RAMXGU.MergedBits.grpXGU

#define RAMXGU_XGU0_MASK                1
#define RAMXGU_XGU1_MASK                2
#define RAMXGU_XGU2_MASK                4
#define RAMXGU_XGU3_MASK                8
#define RAMXGU_XGU4_MASK                16
#define RAMXGU_XGU5_MASK                32
#define RAMXGU_XGU6_MASK                64
#define RAMXGU_XGU_MASK                 127
#define RAMXGU_XGU_BITNUM               0


 RAMSHL - RAM Shared Region Lower Boundary Register; 0x0000011E 
typedef union {
  byte Byte;
  struct {
    byte SHL0        1;                                        RAM Shared Region Lower Boundary Bit 0 
    byte SHL1        1;                                        RAM Shared Region Lower Boundary Bit 1 
    byte SHL2        1;                                        RAM Shared Region Lower Boundary Bit 2 
    byte SHL3        1;                                        RAM Shared Region Lower Boundary Bit 3 
    byte SHL4        1;                                        RAM Shared Region Lower Boundary Bit 4 
    byte SHL5        1;                                        RAM Shared Region Lower Boundary Bit 5 
    byte SHL6        1;                                        RAM Shared Region Lower Boundary Bit 6 
    byte             1; 
  } Bits;
  struct {
    byte grpSHL  7;
    byte         1;
  } MergedBits;
} RAMSHLSTR;
extern volatile RAMSHLSTR _RAMSHL @(REG_BASE + 0x0000011E);
#define RAMSHL                          _RAMSHL.Byte
#define RAMSHL_SHL0                     _RAMSHL.Bits.SHL0
#define RAMSHL_SHL1                     _RAMSHL.Bits.SHL1
#define RAMSHL_SHL2                     _RAMSHL.Bits.SHL2
#define RAMSHL_SHL3                     _RAMSHL.Bits.SHL3
#define RAMSHL_SHL4                     _RAMSHL.Bits.SHL4
#define RAMSHL_SHL5                     _RAMSHL.Bits.SHL5
#define RAMSHL_SHL6                     _RAMSHL.Bits.SHL6
#define RAMSHL_SHL                      _RAMSHL.MergedBits.grpSHL

#define RAMSHL_SHL0_MASK                1
#define RAMSHL_SHL1_MASK                2
#define RAMSHL_SHL2_MASK                4
#define RAMSHL_SHL3_MASK                8
#define RAMSHL_SHL4_MASK                16
#define RAMSHL_SHL5_MASK                32
#define RAMSHL_SHL6_MASK                64
#define RAMSHL_SHL_MASK                 127
#define RAMSHL_SHL_BITNUM               0


 RAMSHU - RAM Shared Region Upper Boundary Register; 0x0000011F 
typedef union {
  byte Byte;
  struct {
    byte SHU0        1;                                        RAM Shared Region Upper Boundary Bit 0 
    byte SHU1        1;                                        RAM Shared Region Upper Boundary Bit 1 
    byte SHU2        1;                                        RAM Shared Region Upper Boundary Bit 2 
    byte SHU3        1;                                        RAM Shared Region Upper Boundary Bit 3 
    byte SHU4        1;                                        RAM Shared Region Upper Boundary Bit 4 
    byte SHU5        1;                                        RAM Shared Region Upper Boundary Bit 5 
    byte SHU6        1;                                        RAM Shared Region Upper Boundary Bit 6 
    byte             1; 
  } Bits;
  struct {
    byte grpSHU  7;
    byte         1;
  } MergedBits;
} RAMSHUSTR;
extern volatile RAMSHUSTR _RAMSHU @(REG_BASE + 0x0000011F);
#define RAMSHU                          _RAMSHU.Byte
#define RAMSHU_SHU0                     _RAMSHU.Bits.SHU0
#define RAMSHU_SHU1                     _RAMSHU.Bits.SHU1
#define RAMSHU_SHU2                     _RAMSHU.Bits.SHU2
#define RAMSHU_SHU3                     _RAMSHU.Bits.SHU3
#define RAMSHU_SHU4                     _RAMSHU.Bits.SHU4
#define RAMSHU_SHU5                     _RAMSHU.Bits.SHU5
#define RAMSHU_SHU6                     _RAMSHU.Bits.SHU6
#define RAMSHU_SHU                      _RAMSHU.MergedBits.grpSHU

#define RAMSHU_SHU0_MASK                1
#define RAMSHU_SHU1_MASK                2
#define RAMSHU_SHU2_MASK                4
#define RAMSHU_SHU3_MASK                8
#define RAMSHU_SHU4_MASK                16
#define RAMSHU_SHU5_MASK                32
#define RAMSHU_SHU6_MASK                64
#define RAMSHU_SHU_MASK                 127
#define RAMSHU_SHU_BITNUM               0


 IVBR - Interrupt Vector Base Register; 0x00000121 
typedef union {
  byte Byte;
  struct {
    byte IVB_ADDR    8;                                        Interrupt vector base address bits 
  } Bits;
} IVBRSTR;
extern volatile IVBRSTR _IVBR @(REG_BASE + 0x00000121);
#define IVBR                            _IVBR.Byte
#define IVBR_IVB_ADDR                   _IVBR.Bits.IVB_ADDR

#define IVBR_IVB_ADDR_MASK              255
#define IVBR_IVB_ADDR_BITNUM            0


