gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
 INT_CFDATA6 - Interrupt Configuration Data Register 6; 0x0000012E 
typedef union {
  byte Byte;
  struct {
    byte PRIOLVL     3;                                        Interrupt Request Priority Level Bits 
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
    byte RQST        1;                                        XGATE Request Enable 
  } Bits;
} INT_CFDATA6STR;
extern volatile INT_CFDATA6STR _INT_CFDATA6 @(REG_BASE + 0x0000012E);
#define INT_CFDATA6                     _INT_CFDATA6.Byte
#define INT_CFDATA6_PRIOLVL             _INT_CFDATA6.Bits.PRIOLVL
#define INT_CFDATA6_RQST                _INT_CFDATA6.Bits.RQST

#define INT_CFDATA6_PRIOLVL_MASK        7
#define INT_CFDATA6_PRIOLVL_BITNUM      0
#define INT_CFDATA6_RQST_MASK           128


 INT_CFDATA7 - Interrupt Configuration Data Register 7; 0x0000012F 
typedef union {
  byte Byte;
  struct {
    byte PRIOLVL     3;                                        Interrupt Request Priority Level Bits 
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
    byte RQST        1;                                        XGATE Request Enable 
  } Bits;
} INT_CFDATA7STR;
extern volatile INT_CFDATA7STR _INT_CFDATA7 @(REG_BASE + 0x0000012F);
#define INT_CFDATA7                     _INT_CFDATA7.Byte
#define INT_CFDATA7_PRIOLVL             _INT_CFDATA7.Bits.PRIOLVL
#define INT_CFDATA7_RQST                _INT_CFDATA7.Bits.RQST

#define INT_CFDATA7_PRIOLVL_MASK        7
#define INT_CFDATA7_PRIOLVL_BITNUM      0
#define INT_CFDATA7_RQST_MASK           128


 SCI4BD - SCI 4 Baud Rate Register; 0x00000130 
typedef union {
  word Word;
    Overlapped registers 
  struct {
     SCI4ASR1 - SCI 4 Alternative Status Register 1; 0x00000130 
    union {
      byte Byte;
      union { Several registers at the same address 
         SCI4ASR1 - SCI 4 Alternative Status Register 1; Several registers at the same address 
        union {
          struct {
            byte BKDIF       1;                                        Break Detect Interrupt Flag 
            byte BERRIF      1;                                        Bit Error Interrupt Flag 
            byte BERRV       1;                                        Bit Error Value 
            byte             1; 
            byte             1; 
            byte             1; 
            byte             1; 
            byte RXEDGIF     1;                                        Receive Input Active Edge Interrupt Flag 
          } Bits;
        } SCI4ASR1STR;
        #define SCI4ASR1                _SCI4BD.Overlap_STR.SCI4ASR1STR.Byte
        #define SCI4ASR1_BKDIF          _SCI4BD.Overlap_STR.SCI4ASR1STR.SameAddr_STR.SCI4ASR1STR.Bits.BKDIF
        #define SCI4ASR1_BERRIF         _SCI4BD.Overlap_STR.SCI4ASR1STR.SameAddr_STR.SCI4ASR1STR.Bits.BERRIF
        #define SCI4ASR1_BERRV          _SCI4BD.Overlap_STR.SCI4ASR1STR.SameAddr_STR.SCI4ASR1STR.Bits.BERRV
        #define SCI4ASR1_RXEDGIF        _SCI4BD.Overlap_STR.SCI4ASR1STR.SameAddr_STR.SCI4ASR1STR.Bits.RXEDGIF
        
        
        #define SCI4ASR1_BKDIF_MASK     1
        #define SCI4ASR1_BERRIF_MASK    2
        #define SCI4ASR1_BERRV_MASK     4
        #define SCI4ASR1_RXEDGIF_MASK   128
    
         SCI4BDH - SCI 4 Baud Rate Register High; Several registers at the same address 
        union {
          struct {
            byte SBR8        1;                                        SCI Baud Rate Bit 8 
            byte SBR9        1;                                        SCI Baud Rate Bit 9 
            byte SBR10       1;                                        SCI Baud Rate Bit 10 
            byte SBR11       1;                                        SCI Baud Rate Bit 11 
            byte SBR12       1;                                        SCI Baud Rate Bit 12 
            byte TNP0        1;                                        Transmitter Narrow Pulse Bit 0 
            byte TNP1        1;                                        Transmitter Narrow Pulse Bit 1 
            byte IREN        1;                                        Infrared Enable Bit 
          } Bits;
          struct {
            byte grpSBR_8 5;
            byte grpTNP 2;
            byte 1;
          } MergedBits;
        } SCI4BDHSTR;
        #define SCI4BDH                 _SCI4BD.Overlap_STR.SCI4ASR1STR.Byte
        #define SCI4BDH_SBR8            _SCI4BD.Overlap_STR.SCI4ASR1STR.SameAddr_STR.SCI4BDHSTR.Bits.SBR8
        #define SCI4BDH_SBR9            _SCI4BD.Overlap_STR.SCI4ASR1STR.SameAddr_STR.SCI4BDHSTR.Bits.SBR9
        #define SCI4BDH_SBR10           _SCI4BD.Overlap_STR.SCI4ASR1STR.SameAddr_STR.SCI4BDHSTR.Bits.SBR10
        #define SCI4BDH_SBR11           _SCI4BD.Overlap_STR.SCI4ASR1STR.SameAddr_STR.SCI4BDHSTR.Bits.SBR11
        #define SCI4BDH_SBR12           _SCI4BD.Overlap_STR.SCI4ASR1STR.SameAddr_STR.SCI4BDHSTR.Bits.SBR12
        #define SCI4BDH_TNP0            _SCI4BD.Overlap_STR.SCI4ASR1STR.SameAddr_STR.SCI4BDHSTR.Bits.TNP0
        #define SCI4BDH_TNP1            _SCI4BD.Overlap_STR.SCI4ASR1STR.SameAddr_STR.SCI4BDHSTR.Bits.TNP1
        #define SCI4BDH_IREN            _SCI4BD.Overlap_STR.SCI4ASR1STR.SameAddr_STR.SCI4BDHSTR.Bits.IREN
        
        #define SCI4BDH_SBR_8           _SCI4BD.Overlap_STR.SCI4ASR1STR.SameAddr_STR.SCI4BDHSTR.MergedBits.grpSBR_8
        #define SCI4BDH_TNP             _SCI4BD.Overlap_STR.SCI4ASR1STR.SameAddr_STR.SCI4BDHSTR.MergedBits.grpTNP
        #define SCI4BDH_SBR             SCI4BDH_SBR_8
        
        #define SCI4BDH_SBR8_MASK       1
        #define SCI4BDH_SBR9_MASK       2
        #define SCI4BDH_SBR10_MASK      4
        #define SCI4BDH_SBR11_MASK      8
        #define SCI4BDH_SBR12_MASK      16
        #define SCI4BDH_TNP0_MASK       32
        #define SCI4BDH_TNP1_MASK       64
        #define SCI4BDH_IREN_MASK       128
        #define SCI4BDH_SBR_8_MASK      31
        #define SCI4BDH_SBR_8_BITNUM    0
        #define SCI4BDH_TNP_MASK        96
        #define SCI4BDH_TNP_BITNUM      5
    
      } SameAddr_STR; Several registers at the same address 
    
    } SCI4ASR1STR;
    


