gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
     SCI4ACR1 - SCI 4 Alternative Control Register 1; 0x00000131 
    union {
      byte Byte;
      union { Several registers at the same address 
         SCI4ACR1 - SCI 4 Alternative Control Register 1; Several registers at the same address 
        union {
          struct {
            byte BKDIE       1;                                        Break Detect Interrupt Enable 
            byte BERRIE      1;                                        Bit Error Interrupt Enable 
            byte             1; 
            byte             1; 
            byte             1; 
            byte             1; 
            byte             1; 
            byte RXEDGIE     1;                                        Receive Input Active Edge Interrupt Enable 
          } Bits;
        } SCI4ACR1STR;
        #define SCI4ACR1                _SCI4BD.Overlap_STR.SCI4ACR1STR.Byte
        #define SCI4ACR1_BKDIE          _SCI4BD.Overlap_STR.SCI4ACR1STR.SameAddr_STR.SCI4ACR1STR.Bits.BKDIE
        #define SCI4ACR1_BERRIE         _SCI4BD.Overlap_STR.SCI4ACR1STR.SameAddr_STR.SCI4ACR1STR.Bits.BERRIE
        #define SCI4ACR1_RXEDGIE        _SCI4BD.Overlap_STR.SCI4ACR1STR.SameAddr_STR.SCI4ACR1STR.Bits.RXEDGIE
        
        
        #define SCI4ACR1_BKDIE_MASK     1
        #define SCI4ACR1_BERRIE_MASK    2
        #define SCI4ACR1_RXEDGIE_MASK   128
    
         SCI4BDL - SCI 4 Baud Rate Register Low; Several registers at the same address 
        union {
          struct {
            byte SBR0        1;                                        SCI Baud Rate Bit 0 
            byte SBR1        1;                                        SCI Baud Rate Bit 1 
            byte SBR2        1;                                        SCI Baud Rate Bit 2 
            byte SBR3        1;                                        SCI Baud Rate Bit 3 
            byte SBR4        1;                                        SCI Baud Rate Bit 4 
            byte SBR5        1;                                        SCI Baud Rate Bit 5 
            byte SBR6        1;                                        SCI Baud Rate Bit 6 
            byte SBR7        1;                                        SCI Baud Rate Bit 7 
          } Bits;
        } SCI4BDLSTR;
        #define SCI4BDL                 _SCI4BD.Overlap_STR.SCI4ACR1STR.Byte
        #define SCI4BDL_SBR0            _SCI4BD.Overlap_STR.SCI4ACR1STR.SameAddr_STR.SCI4BDLSTR.Bits.SBR0
        #define SCI4BDL_SBR1            _SCI4BD.Overlap_STR.SCI4ACR1STR.SameAddr_STR.SCI4BDLSTR.Bits.SBR1
        #define SCI4BDL_SBR2            _SCI4BD.Overlap_STR.SCI4ACR1STR.SameAddr_STR.SCI4BDLSTR.Bits.SBR2
        #define SCI4BDL_SBR3            _SCI4BD.Overlap_STR.SCI4ACR1STR.SameAddr_STR.SCI4BDLSTR.Bits.SBR3
        #define SCI4BDL_SBR4            _SCI4BD.Overlap_STR.SCI4ACR1STR.SameAddr_STR.SCI4BDLSTR.Bits.SBR4
        #define SCI4BDL_SBR5            _SCI4BD.Overlap_STR.SCI4ACR1STR.SameAddr_STR.SCI4BDLSTR.Bits.SBR5
        #define SCI4BDL_SBR6            _SCI4BD.Overlap_STR.SCI4ACR1STR.SameAddr_STR.SCI4BDLSTR.Bits.SBR6
        #define SCI4BDL_SBR7            _SCI4BD.Overlap_STR.SCI4ACR1STR.SameAddr_STR.SCI4BDLSTR.Bits.SBR7
        
        
        #define SCI4BDL_SBR0_MASK       1
        #define SCI4BDL_SBR1_MASK       2
        #define SCI4BDL_SBR2_MASK       4
        #define SCI4BDL_SBR3_MASK       8
        #define SCI4BDL_SBR4_MASK       16
        #define SCI4BDL_SBR5_MASK       32
        #define SCI4BDL_SBR6_MASK       64
        #define SCI4BDL_SBR7_MASK       128
    
      } SameAddr_STR; Several registers at the same address 
    
    } SCI4ACR1STR;
    

  } Overlap_STR;

  struct {
    word SBR0        1;                                        SCI Baud Rate Bit 0 
    word SBR1        1;                                        SCI Baud Rate Bit 1 
    word SBR2        1;                                        SCI Baud Rate Bit 2 
    word SBR3        1;                                        SCI Baud Rate Bit 3 
    word SBR4        1;                                        SCI Baud Rate Bit 4 
    word SBR5        1;                                        SCI Baud Rate Bit 5 
    word SBR6        1;                                        SCI Baud Rate Bit 6 
    word SBR7        1;                                        SCI Baud Rate Bit 7 
    word SBR8        1;                                        SCI Baud Rate Bit 8 
    word SBR9        1;                                        SCI Baud Rate Bit 9 
    word SBR10       1;                                        SCI Baud Rate Bit 10 
    word SBR11       1;                                        SCI Baud Rate Bit 11 
    word SBR12       1;                                        SCI Baud Rate Bit 12 
    word TNP0        1;                                        Transmitter Narrow Pulse Bit 0 
    word TNP1        1;                                        Transmitter Narrow Pulse Bit 1 
    word IREN        1;                                        Infrared Enable Bit 
  } Bits;
  struct {
    word grpSBR  13;
    word grpTNP  2;
    word         1;
  } MergedBits;
} SCI4BDSTR;
extern volatile SCI4BDSTR _SCI4BD @(REG_BASE + 0x00000130);
#define SCI4BD                          _SCI4BD.Word
#define SCI4BD_SBR0                     _SCI4BD.Bits.SBR0
#define SCI4BD_SBR1                     _SCI4BD.Bits.SBR1
#define SCI4BD_SBR2                     _SCI4BD.Bits.SBR2
#define SCI4BD_SBR3                     _SCI4BD.Bits.SBR3
#define SCI4BD_SBR4                     _SCI4BD.Bits.SBR4
#define SCI4BD_SBR5                     _SCI4BD.Bits.SBR5
#define SCI4BD_SBR6                     _SCI4BD.Bits.SBR6
#define SCI4BD_SBR7                     _SCI4BD.Bits.SBR7
#define SCI4BD_SBR8                     _SCI4BD.Bits.SBR8
#define SCI4BD_SBR9                     _SCI4BD.Bits.SBR9
#define SCI4BD_SBR10                    _SCI4BD.Bits.SBR10
#define SCI4BD_SBR11                    _SCI4BD.Bits.SBR11
#define SCI4BD_SBR12                    _SCI4BD.Bits.SBR12
#define SCI4BD_TNP0                     _SCI4BD.Bits.TNP0
#define SCI4BD_TNP1                     _SCI4BD.Bits.TNP1
#define SCI4BD_IREN                     _SCI4BD.Bits.IREN
#define SCI4BD_SBR                      _SCI4BD.MergedBits.grpSBR
#define SCI4BD_TNP                      _SCI4BD.MergedBits.grpTNP

#define SCI4BD_SBR0_MASK                1
#define SCI4BD_SBR1_MASK                2
#define SCI4BD_SBR2_MASK                4
#define SCI4BD_SBR3_MASK                8
#define SCI4BD_SBR4_MASK                16
#define SCI4BD_SBR5_MASK                32
#define SCI4BD_SBR6_MASK                64
#define SCI4BD_SBR7_MASK                128
#define SCI4BD_SBR8_MASK                256
#define SCI4BD_SBR9_MASK                512
#define SCI4BD_SBR10_MASK               1024
#define SCI4BD_SBR11_MASK               2048
#define SCI4BD_SBR12_MASK               4096
#define SCI4BD_TNP0_MASK                8192
#define SCI4BD_TNP1_MASK                16384
#define SCI4BD_IREN_MASK                32768
#define SCI4BD_SBR_MASK                 8191
#define SCI4BD_SBR_BITNUM               0
#define SCI4BD_TNP_MASK                 24576
#define SCI4BD_TNP_BITNUM               13


 SCI4ACR2 - SCI 4 Alternative Control Register 2; 0x00000132 
typedef union {
  byte Byte;
  union { Several registers at the same address 
     SCI4ACR2 - SCI 4 Alternative Control Register 2; Several registers at the same address 
    union {
      struct {
        byte BKDFE       1;                                        Break Detect Feature Enable 
        byte BERRM0      1;                                        Bit Error Mode Bit 0 
        byte BERRM1      1;                                        Bit Error Mode Bit 1 
        byte             1; 
        byte             1; 
        byte             1; 
        byte             1; 
        byte             1; 
      } Bits;
      struct {
        byte     1;
        byte grpBERRM 2;
        byte     1;
        byte     1;
        byte     1;
        byte     1;
        byte     1;
      } MergedBits;
    } SCI4ACR2STR;
    #define SCI4ACR2                    _SCI4ACR2.Byte
    #define SCI4ACR2_BKDFE              _SCI4ACR2.SameAddr_STR.SCI4ACR2STR.Bits.BKDFE
    #define SCI4ACR2_BERRM0             _SCI4ACR2.SameAddr_STR.SCI4ACR2STR.Bits.BERRM0
    #define SCI4ACR2_BERRM1             _SCI4ACR2.SameAddr_STR.SCI4ACR2STR.Bits.BERRM1
    
    #define SCI4ACR2_BERRM              _SCI4ACR2.SameAddr_STR.SCI4ACR2STR.MergedBits.grpBERRM
    
