gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
    #define SCI4ACR2_BKDFE_MASK         1
    #define SCI4ACR2_BERRM0_MASK        2
    #define SCI4ACR2_BERRM1_MASK        4
    #define SCI4ACR2_BERRM_MASK         6
    #define SCI4ACR2_BERRM_BITNUM       1

     SCI4CR1 - SCI 4 Control Register 1; Several registers at the same address 
    union {
      struct {
        byte PT          1;                                        Parity Type Bit 
        byte PE          1;                                        Parity Enable Bit 
        byte ILT         1;                                        Idle Line Type Bit 
        byte WAKE        1;                                        Wakeup Condition Bit 
        byte M           1;                                        Data Format Mode Bit 
        byte RSRC        1;                                        Receiver Source Bit 
        byte SCISWAI     1;                                        SCI Stop in Wait Mode Bit 
        byte LOOPS       1;                                        Loop Select Bit 
      } Bits;
    } SCI4CR1STR;
    #define SCI4CR1                     _SCI4ACR2.Byte
    #define SCI4CR1_PT                  _SCI4ACR2.SameAddr_STR.SCI4CR1STR.Bits.PT
    #define SCI4CR1_PE                  _SCI4ACR2.SameAddr_STR.SCI4CR1STR.Bits.PE
    #define SCI4CR1_ILT                 _SCI4ACR2.SameAddr_STR.SCI4CR1STR.Bits.ILT
    #define SCI4CR1_WAKE                _SCI4ACR2.SameAddr_STR.SCI4CR1STR.Bits.WAKE
    #define SCI4CR1_M                   _SCI4ACR2.SameAddr_STR.SCI4CR1STR.Bits.M
    #define SCI4CR1_RSRC                _SCI4ACR2.SameAddr_STR.SCI4CR1STR.Bits.RSRC
    #define SCI4CR1_SCISWAI             _SCI4ACR2.SameAddr_STR.SCI4CR1STR.Bits.SCISWAI
    #define SCI4CR1_LOOPS               _SCI4ACR2.SameAddr_STR.SCI4CR1STR.Bits.LOOPS
    
    
    #define SCI4CR1_PT_MASK             1
    #define SCI4CR1_PE_MASK             2
    #define SCI4CR1_ILT_MASK            4
    #define SCI4CR1_WAKE_MASK           8
    #define SCI4CR1_M_MASK              16
    #define SCI4CR1_RSRC_MASK           32
    #define SCI4CR1_SCISWAI_MASK        64
    #define SCI4CR1_LOOPS_MASK          128

  } SameAddr_STR; Several registers at the same address 

} SCI4ACR2STR;
extern volatile SCI4ACR2STR _SCI4ACR2 @(REG_BASE + 0x00000132);



 SCI4CR2 - SCI 4 Control Register 2; 0x00000133 
typedef union {
  byte Byte;
  struct {
    byte SBK         1;                                        Send Break Bit 
    byte RWU         1;                                        Receiver Wakeup Bit 
    byte RE          1;                                        Receiver Enable Bit 
    byte TE          1;                                        Transmitter Enable Bit 
    byte ILIE        1;                                        Idle Line Interrupt Enable Bit 
    byte RIE         1;                                        Receiver Full Interrupt Enable Bit 
    byte TCIE        1;                                        Transmission Complete Interrupt Enable Bit 
    byte SCTIE       1;                                        Transmitter Interrupt Enable Bit 
  } Bits;
} SCI4CR2STR;
extern volatile SCI4CR2STR _SCI4CR2 @(REG_BASE + 0x00000133);
#define SCI4CR2                         _SCI4CR2.Byte
#define SCI4CR2_SBK                     _SCI4CR2.Bits.SBK
#define SCI4CR2_RWU                     _SCI4CR2.Bits.RWU
#define SCI4CR2_RE                      _SCI4CR2.Bits.RE
#define SCI4CR2_TE                      _SCI4CR2.Bits.TE
#define SCI4CR2_ILIE                    _SCI4CR2.Bits.ILIE
#define SCI4CR2_RIE                     _SCI4CR2.Bits.RIE
#define SCI4CR2_TCIE                    _SCI4CR2.Bits.TCIE
#define SCI4CR2_SCTIE                   _SCI4CR2.Bits.SCTIE

#define SCI4CR2_SBK_MASK                1
#define SCI4CR2_RWU_MASK                2
#define SCI4CR2_RE_MASK                 4
#define SCI4CR2_TE_MASK                 8
#define SCI4CR2_ILIE_MASK               16
#define SCI4CR2_RIE_MASK                32
#define SCI4CR2_TCIE_MASK               64
#define SCI4CR2_SCTIE_MASK              128


 SCI4SR1 - SCI 4 Status Register 1; 0x00000134 
typedef union {
  byte Byte;
  struct {
    byte PF          1;                                        Parity Error Flag 
    byte FE          1;                                        Framing Error Flag 
    byte NF          1;                                        Noise Flag 
    byte OR          1;                                        Overrun Flag 
    byte IDLE        1;                                        Idle Line Flag 
    byte RDRF        1;                                        Receive Data Register Full Flag 
    byte TC          1;                                        Transmit Complete Flag 
    byte TDRE        1;                                        Transmit Data Register Empty Flag 
  } Bits;
} SCI4SR1STR;
extern volatile SCI4SR1STR _SCI4SR1 @(REG_BASE + 0x00000134);
#define SCI4SR1                         _SCI4SR1.Byte
#define SCI4SR1_PF                      _SCI4SR1.Bits.PF
#define SCI4SR1_FE                      _SCI4SR1.Bits.FE
#define SCI4SR1_NF                      _SCI4SR1.Bits.NF
#define SCI4SR1_OR                      _SCI4SR1.Bits.OR
#define SCI4SR1_IDLE                    _SCI4SR1.Bits.IDLE
#define SCI4SR1_RDRF                    _SCI4SR1.Bits.RDRF
#define SCI4SR1_TC                      _SCI4SR1.Bits.TC
#define SCI4SR1_TDRE                    _SCI4SR1.Bits.TDRE

#define SCI4SR1_PF_MASK                 1
#define SCI4SR1_FE_MASK                 2
#define SCI4SR1_NF_MASK                 4
#define SCI4SR1_OR_MASK                 8
#define SCI4SR1_IDLE_MASK               16
#define SCI4SR1_RDRF_MASK               32
#define SCI4SR1_TC_MASK                 64
#define SCI4SR1_TDRE_MASK               128


 SCI4SR2 - SCI 4 Status Register 2; 0x00000135 
typedef union {
  byte Byte;
  struct {
    byte RAF         1;                                        Receiver Active Flag 
    byte TXDIR       1;                                        Transmitter pin data direction in Single-Wire mode 
    byte BRK13       1;                                        Break Transmit character length 
    byte RXPOL       1;                                        Receive Polarity 
    byte TXPOL       1;                                        Transmit Polarity 
    byte             1; 
    byte             1; 
    byte AMAP        1;                                        Alternative Map 
  } Bits;
} SCI4SR2STR;
