gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
extern volatile SCI4SR2STR _SCI4SR2 @(REG_BASE + 0x00000135);
#define SCI4SR2                         _SCI4SR2.Byte
#define SCI4SR2_RAF                     _SCI4SR2.Bits.RAF
#define SCI4SR2_TXDIR                   _SCI4SR2.Bits.TXDIR
#define SCI4SR2_BRK13                   _SCI4SR2.Bits.BRK13
#define SCI4SR2_RXPOL                   _SCI4SR2.Bits.RXPOL
#define SCI4SR2_TXPOL                   _SCI4SR2.Bits.TXPOL
#define SCI4SR2_AMAP                    _SCI4SR2.Bits.AMAP

#define SCI4SR2_RAF_MASK                1
#define SCI4SR2_TXDIR_MASK              2
#define SCI4SR2_BRK13_MASK              4
#define SCI4SR2_RXPOL_MASK              8
#define SCI4SR2_TXPOL_MASK              16
#define SCI4SR2_AMAP_MASK               128


 SCI4DRH - SCI 4 Data Register High; 0x00000136 
typedef union {
  byte Byte;
  struct {
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
    byte T8          1;                                        Transmit Bit 8 
    byte R8          1;                                        Received Bit 8 
  } Bits;
} SCI4DRHSTR;
extern volatile SCI4DRHSTR _SCI4DRH @(REG_BASE + 0x00000136);
#define SCI4DRH                         _SCI4DRH.Byte
#define SCI4DRH_T8                      _SCI4DRH.Bits.T8
#define SCI4DRH_R8                      _SCI4DRH.Bits.R8

#define SCI4DRH_T8_MASK                 64
#define SCI4DRH_R8_MASK                 128


 SCI4DRL - SCI 4 Data Register Low; 0x00000137 
typedef union {
  byte Byte;
  struct {
    byte R0_T0       1;                                        Received bit 0 or Transmit bit 0 
    byte R1_T1       1;                                        Received bit 1 or Transmit bit 1 
    byte R2_T2       1;                                        Received bit 2 or Transmit bit 2 
    byte R3_T3       1;                                        Received bit 3 or Transmit bit 3 
    byte R4_T4       1;                                        Received bit 4 or Transmit bit 4 
    byte R5_T5       1;                                        Received bit 5 or Transmit bit 5 
    byte R6_T6       1;                                        Received bit 6 or Transmit bit 6 
    byte R7_T7       1;                                        Received bit 7 or Transmit bit 7 
  } Bits;
} SCI4DRLSTR;
extern volatile SCI4DRLSTR _SCI4DRL @(REG_BASE + 0x00000137);
#define SCI4DRL                         _SCI4DRL.Byte
#define SCI4DRL_R0_T0                   _SCI4DRL.Bits.R0_T0
#define SCI4DRL_R1_T1                   _SCI4DRL.Bits.R1_T1
#define SCI4DRL_R2_T2                   _SCI4DRL.Bits.R2_T2
#define SCI4DRL_R3_T3                   _SCI4DRL.Bits.R3_T3
#define SCI4DRL_R4_T4                   _SCI4DRL.Bits.R4_T4
#define SCI4DRL_R5_T5                   _SCI4DRL.Bits.R5_T5
#define SCI4DRL_R6_T6                   _SCI4DRL.Bits.R6_T6
#define SCI4DRL_R7_T7                   _SCI4DRL.Bits.R7_T7

#define SCI4DRL_R0_T0_MASK              1
#define SCI4DRL_R1_T1_MASK              2
#define SCI4DRL_R2_T2_MASK              4
#define SCI4DRL_R3_T3_MASK              8
#define SCI4DRL_R4_T4_MASK              16
#define SCI4DRL_R5_T5_MASK              32
#define SCI4DRL_R6_T6_MASK              64
#define SCI4DRL_R7_T7_MASK              128


 CAN0CTL0 - MSCAN 0 Control 0 Register; 0x00000140 
typedef union {
  byte Byte;
  struct {
    byte INITRQ      1;                                        Initialization Mode Request 
    byte SLPRQ       1;                                        Sleep Mode Request 
    byte WUPE        1;                                        Wake-Up Enable 
    byte TIME        1;                                        Timer Enable 
    byte SYNCH       1;                                        Synchronized Status 
    byte CSWAI       1;                                        CAN Stops in Wait Mode 
    byte RXACT       1;                                        Receiver Active Status 
    byte RXFRM       1;                                        Received Frame Flag 
  } Bits;
} CAN0CTL0STR;
extern volatile CAN0CTL0STR _CAN0CTL0 @(REG_BASE + 0x00000140);
#define CAN0CTL0                        _CAN0CTL0.Byte
#define CAN0CTL0_INITRQ                 _CAN0CTL0.Bits.INITRQ
#define CAN0CTL0_SLPRQ                  _CAN0CTL0.Bits.SLPRQ
#define CAN0CTL0_WUPE                   _CAN0CTL0.Bits.WUPE
#define CAN0CTL0_TIME                   _CAN0CTL0.Bits.TIME
#define CAN0CTL0_SYNCH                  _CAN0CTL0.Bits.SYNCH
#define CAN0CTL0_CSWAI                  _CAN0CTL0.Bits.CSWAI
#define CAN0CTL0_RXACT                  _CAN0CTL0.Bits.RXACT
#define CAN0CTL0_RXFRM                  _CAN0CTL0.Bits.RXFRM
 CAN0CTL_ARR Access 2 CAN0CTLx registers in an array 
#define CAN0CTL_ARR                     ((volatile byte ) &CAN0CTL0)

#define CAN0CTL0_INITRQ_MASK            1
#define CAN0CTL0_SLPRQ_MASK             2
#define CAN0CTL0_WUPE_MASK              4
#define CAN0CTL0_TIME_MASK              8
#define CAN0CTL0_SYNCH_MASK             16
#define CAN0CTL0_CSWAI_MASK             32
#define CAN0CTL0_RXACT_MASK             64
#define CAN0CTL0_RXFRM_MASK             128


 CAN0CTL1 - MSCAN 0 Control 1 Register; 0x00000141 
typedef union {
  byte Byte;
  struct {
    byte INITAK      1;                                        Initialization Mode Acknowledge 
    byte SLPAK       1;                                        Sleep Mode Acknowledge 
    byte WUPM        1;                                        Wake-Up Mode 
    byte BORM        1;                                        Bus-Off Recovery Mode 
    byte LISTEN      1;                                        Listen Only Mode 
    byte LOOPB       1;                                        Loop Back Self Test Mode 
    byte CLKSRC      1;                                        MSCAN 0 Clock Source 
    byte CANE        1;                                        MSCAN 0 Enable 
  } Bits;
} CAN0CTL1STR;
extern volatile CAN0CTL1STR _CAN0CTL1 @(REG_BASE + 0x00000141);
#define CAN0CTL1                        _CAN0CTL1.Byte
#define CAN0CTL1_INITAK                 _CAN0CTL1.Bits.INITAK
#define CAN0CTL1_SLPAK                  _CAN0CTL1.Bits.SLPAK
#define CAN0CTL1_WUPM                   _CAN0CTL1.Bits.WUPM
#define CAN0CTL1_BORM                   _CAN0CTL1.Bits.BORM
#define CAN0CTL1_LISTEN                 _CAN0CTL1.Bits.LISTEN
#define CAN0CTL1_LOOPB                  _CAN0CTL1.Bits.LOOPB
#define CAN0CTL1_CLKSRC                 _CAN0CTL1.Bits.CLKSRC
#define CAN0CTL1_CANE                   _CAN0CTL1.Bits.CANE

#define CAN0CTL1_INITAK_MASK            1
#define CAN0CTL1_SLPAK_MASK             2
#define CAN0CTL1_WUPM_MASK              4
#define CAN0CTL1_BORM_MASK              8
#define CAN0CTL1_LISTEN_MASK            16
#define CAN0CTL1_LOOPB_MASK             32
#define CAN0CTL1_CLKSRC_MASK            64
#define CAN0CTL1_CANE_MASK              128


