gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
extern volatile CAN0TBSELSTR _CAN0TBSEL @(REG_BASE + 0x0000014A);
#define CAN0TBSEL                       _CAN0TBSEL.Byte
#define CAN0TBSEL_TX0                   _CAN0TBSEL.Bits.TX0
#define CAN0TBSEL_TX1                   _CAN0TBSEL.Bits.TX1
#define CAN0TBSEL_TX2                   _CAN0TBSEL.Bits.TX2
#define CAN0TBSEL_TX                    _CAN0TBSEL.MergedBits.grpTX

#define CAN0TBSEL_TX0_MASK              1
#define CAN0TBSEL_TX1_MASK              2
#define CAN0TBSEL_TX2_MASK              4
#define CAN0TBSEL_TX_MASK               7
#define CAN0TBSEL_TX_BITNUM             0


 CAN0IDAC - MSCAN 0 Identifier Acceptance Control Register; 0x0000014B 
typedef union {
  byte Byte;
  struct {
    byte IDHIT0      1;                                        Identifier Acceptance Hit Indicator 0 
    byte IDHIT1      1;                                        Identifier Acceptance Hit Indicator 1 
    byte IDHIT2      1;                                        Identifier Acceptance Hit Indicator 2 
    byte             1; 
    byte IDAM0       1;                                        Identifier Acceptance Mode 0 
    byte IDAM1       1;                                        Identifier Acceptance Mode 1 
    byte             1; 
    byte             1; 
  } Bits;
  struct {
    byte grpIDHIT 3;
    byte         1;
    byte grpIDAM 2;
    byte         1;
    byte         1;
  } MergedBits;
} CAN0IDACSTR;
extern volatile CAN0IDACSTR _CAN0IDAC @(REG_BASE + 0x0000014B);
#define CAN0IDAC                        _CAN0IDAC.Byte
#define CAN0IDAC_IDHIT0                 _CAN0IDAC.Bits.IDHIT0
#define CAN0IDAC_IDHIT1                 _CAN0IDAC.Bits.IDHIT1
#define CAN0IDAC_IDHIT2                 _CAN0IDAC.Bits.IDHIT2
#define CAN0IDAC_IDAM0                  _CAN0IDAC.Bits.IDAM0
#define CAN0IDAC_IDAM1                  _CAN0IDAC.Bits.IDAM1
#define CAN0IDAC_IDHIT                  _CAN0IDAC.MergedBits.grpIDHIT
#define CAN0IDAC_IDAM                   _CAN0IDAC.MergedBits.grpIDAM

#define CAN0IDAC_IDHIT0_MASK            1
#define CAN0IDAC_IDHIT1_MASK            2
#define CAN0IDAC_IDHIT2_MASK            4
#define CAN0IDAC_IDAM0_MASK             16
#define CAN0IDAC_IDAM1_MASK             32
#define CAN0IDAC_IDHIT_MASK             7
#define CAN0IDAC_IDHIT_BITNUM           0
#define CAN0IDAC_IDAM_MASK              48
#define CAN0IDAC_IDAM_BITNUM            4


 CAN0MISC - MSCAN 0 Miscellaneous Register; 0x0000014D 
typedef union {
  byte Byte;
  struct {
    byte BOHOLD      1;                                        Bus-Off state Hold until user request 
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
  } Bits;
} CAN0MISCSTR;
extern volatile CAN0MISCSTR _CAN0MISC @(REG_BASE + 0x0000014D);
#define CAN0MISC                        _CAN0MISC.Byte
#define CAN0MISC_BOHOLD                 _CAN0MISC.Bits.BOHOLD

#define CAN0MISC_BOHOLD_MASK            1


 CAN0RXERR - MSCAN 0 Receive Error Counter Register; 0x0000014E 
typedef union {
  byte Byte;
  struct {
    byte RXERR0      1;                                        Bit 0 
    byte RXERR1      1;                                        Bit 1 
    byte RXERR2      1;                                        Bit 2 
    byte RXERR3      1;                                        Bit 3 
    byte RXERR4      1;                                        Bit 4 
    byte RXERR5      1;                                        Bit 5 
    byte RXERR6      1;                                        Bit 6 
    byte RXERR7      1;                                        Bit 7 
  } Bits;
} CAN0RXERRSTR;
extern volatile CAN0RXERRSTR _CAN0RXERR @(REG_BASE + 0x0000014E);
#define CAN0RXERR                       _CAN0RXERR.Byte
#define CAN0RXERR_RXERR0                _CAN0RXERR.Bits.RXERR0
#define CAN0RXERR_RXERR1                _CAN0RXERR.Bits.RXERR1
#define CAN0RXERR_RXERR2                _CAN0RXERR.Bits.RXERR2
#define CAN0RXERR_RXERR3                _CAN0RXERR.Bits.RXERR3
#define CAN0RXERR_RXERR4                _CAN0RXERR.Bits.RXERR4
#define CAN0RXERR_RXERR5                _CAN0RXERR.Bits.RXERR5
#define CAN0RXERR_RXERR6                _CAN0RXERR.Bits.RXERR6
#define CAN0RXERR_RXERR7                _CAN0RXERR.Bits.RXERR7

#define CAN0RXERR_RXERR0_MASK           1
#define CAN0RXERR_RXERR1_MASK           2
#define CAN0RXERR_RXERR2_MASK           4
#define CAN0RXERR_RXERR3_MASK           8
#define CAN0RXERR_RXERR4_MASK           16
#define CAN0RXERR_RXERR5_MASK           32
#define CAN0RXERR_RXERR6_MASK           64
#define CAN0RXERR_RXERR7_MASK           128


 CAN0TXERR - MSCAN 0 Transmit Error Counter Register; 0x0000014F 
typedef union {
  byte Byte;
  struct {
    byte TXERR0      1;                                        Bit 0 
    byte TXERR1      1;                                        Bit 1 
    byte TXERR2      1;                                        Bit 2 
    byte TXERR3      1;                                        Bit 3 
    byte TXERR4      1;                                        Bit 4 
    byte TXERR5      1;                                        Bit 5 
    byte TXERR6      1;                                        Bit 6 
    byte TXERR7      1;                                        Bit 7 
  } Bits;
} CAN0TXERRSTR;
extern volatile CAN0TXERRSTR _CAN0TXERR @(REG_BASE + 0x0000014F);
#define CAN0TXERR                       _CAN0TXERR.Byte
#define CAN0TXERR_TXERR0                _CAN0TXERR.Bits.TXERR0
#define CAN0TXERR_TXERR1                _CAN0TXERR.Bits.TXERR1
#define CAN0TXERR_TXERR2                _CAN0TXERR.Bits.TXERR2
#define CAN0TXERR_TXERR3                _CAN0TXERR.Bits.TXERR3
#define CAN0TXERR_TXERR4                _CAN0TXERR.Bits.TXERR4
#define CAN0TXERR_TXERR5                _CAN0TXERR.Bits.TXERR5
#define CAN0TXERR_TXERR6                _CAN0TXERR.Bits.TXERR6
#define CAN0TXERR_TXERR7                _CAN0TXERR.Bits.TXERR7

#define CAN0TXERR_TXERR0_MASK           1
#define CAN0TXERR_TXERR1_MASK           2
#define CAN0TXERR_TXERR2_MASK           4
#define CAN0TXERR_TXERR3_MASK           8
#define CAN0TXERR_TXERR4_MASK           16
#define CAN0TXERR_TXERR5_MASK           32
#define CAN0TXERR_TXERR6_MASK           64
#define CAN0TXERR_TXERR7_MASK           128


 CAN0IDAR0 - MSCAN 0 Identifier Acceptance Register 0; 0x00000150 
typedef union {
  byte Byte;
  struct {
    byte AC0         1;                                        Acceptance Code Bit 0 
    byte AC1         1;                                        Acceptance Code Bit 1 
    byte AC2         1;                                        Acceptance Code Bit 2 
    byte AC3         1;                                        Acceptance Code Bit 3 
    byte AC4         1;                                        Acceptance Code Bit 4 
    byte AC5         1;                                        Acceptance Code Bit 5 
    byte AC6         1;                                        Acceptance Code Bit 6 
    byte AC7         1;                                        Acceptance Code Bit 7 
  } Bits;
} CAN0IDAR0STR;
extern volatile CAN0IDAR0STR _CAN0IDAR0 @(REG_BASE + 0x00000150);
#define CAN0IDAR0                       _CAN0IDAR0.Byte
#define CAN0IDAR0_AC0                   _CAN0IDAR0.Bits.AC0
#define CAN0IDAR0_AC1                   _CAN0IDAR0.Bits.AC1
#define CAN0IDAR0_AC2                   _CAN0IDAR0.Bits.AC2
#define CAN0IDAR0_AC3                   _CAN0IDAR0.Bits.AC3
#define CAN0IDAR0_AC4                   _CAN0IDAR0.Bits.AC4
#define CAN0IDAR0_AC5                   _CAN0IDAR0.Bits.AC5
#define CAN0IDAR0_AC6                   _CAN0IDAR0.Bits.AC6
#define CAN0IDAR0_AC7                   _CAN0IDAR0.Bits.AC7
 CAN0IDAR_ARR Access 4 CAN0IDARx registers in an array 
#define CAN0IDAR_ARR                    ((volatile byte ) &CAN0IDAR0)

#define CAN0IDAR0_AC0_MASK              1
#define CAN0IDAR0_AC1_MASK              2
#define CAN0IDAR0_AC2_MASK              4
#define CAN0IDAR0_AC3_MASK              8
#define CAN0IDAR0_AC4_MASK              16
#define CAN0IDAR0_AC5_MASK              32
#define CAN0IDAR0_AC6_MASK              64
#define CAN0IDAR0_AC7_MASK              128


 CAN0IDAR1 - MSCAN 0 Identifier Acceptance Register 1; 0x00000151 
typedef union {
  byte Byte;
  struct {
    byte AC0         1;                                        Acceptance Code Bit 0 
    byte AC1         1;                                        Acceptance Code Bit 1 
    byte AC2         1;                                        Acceptance Code Bit 2 
    byte AC3         1;                                        Acceptance Code Bit 3 
    byte AC4         1;                                        Acceptance Code Bit 4 
    byte AC5         1;                                        Acceptance Code Bit 5 
    byte AC6         1;                                        Acceptance Code Bit 6 
    byte AC7         1;                                        Acceptance Code Bit 7 
  } Bits;
} CAN0IDAR1STR;
