gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
  struct {
    word TSR0        1;                                        Time Stamp Bit 0 
    word TSR1        1;                                        Time Stamp Bit 1 
    word TSR2        1;                                        Time Stamp Bit 2 
    word TSR3        1;                                        Time Stamp Bit 3 
    word TSR4        1;                                        Time Stamp Bit 4 
    word TSR5        1;                                        Time Stamp Bit 5 
    word TSR6        1;                                        Time Stamp Bit 6 
    word TSR7        1;                                        Time Stamp Bit 7 
    word TSR8        1;                                        Time Stamp Bit 8 
    word TSR9        1;                                        Time Stamp Bit 9 
    word TSR10       1;                                        Time Stamp Bit 10 
    word TSR11       1;                                        Time Stamp Bit 11 
    word TSR12       1;                                        Time Stamp Bit 12 
    word TSR13       1;                                        Time Stamp Bit 13 
    word TSR14       1;                                        Time Stamp Bit 14 
    word TSR15       1;                                        Time Stamp Bit 15 
  } Bits;
} CAN0RXTSRSTR;
extern volatile CAN0RXTSRSTR _CAN0RXTSR @(REG_BASE + 0x0000016E);
#define CAN0RXTSR                       _CAN0RXTSR.Word
#define CAN0RXTSR_TSR0                  _CAN0RXTSR.Bits.TSR0
#define CAN0RXTSR_TSR1                  _CAN0RXTSR.Bits.TSR1
#define CAN0RXTSR_TSR2                  _CAN0RXTSR.Bits.TSR2
#define CAN0RXTSR_TSR3                  _CAN0RXTSR.Bits.TSR3
#define CAN0RXTSR_TSR4                  _CAN0RXTSR.Bits.TSR4
#define CAN0RXTSR_TSR5                  _CAN0RXTSR.Bits.TSR5
#define CAN0RXTSR_TSR6                  _CAN0RXTSR.Bits.TSR6
#define CAN0RXTSR_TSR7                  _CAN0RXTSR.Bits.TSR7
#define CAN0RXTSR_TSR8                  _CAN0RXTSR.Bits.TSR8
#define CAN0RXTSR_TSR9                  _CAN0RXTSR.Bits.TSR9
#define CAN0RXTSR_TSR10                 _CAN0RXTSR.Bits.TSR10
#define CAN0RXTSR_TSR11                 _CAN0RXTSR.Bits.TSR11
#define CAN0RXTSR_TSR12                 _CAN0RXTSR.Bits.TSR12
#define CAN0RXTSR_TSR13                 _CAN0RXTSR.Bits.TSR13
#define CAN0RXTSR_TSR14                 _CAN0RXTSR.Bits.TSR14
#define CAN0RXTSR_TSR15                 _CAN0RXTSR.Bits.TSR15

#define CAN0RXTSR_TSR0_MASK             1
#define CAN0RXTSR_TSR1_MASK             2
#define CAN0RXTSR_TSR2_MASK             4
#define CAN0RXTSR_TSR3_MASK             8
#define CAN0RXTSR_TSR4_MASK             16
#define CAN0RXTSR_TSR5_MASK             32
#define CAN0RXTSR_TSR6_MASK             64
#define CAN0RXTSR_TSR7_MASK             128
#define CAN0RXTSR_TSR8_MASK             256
#define CAN0RXTSR_TSR9_MASK             512
#define CAN0RXTSR_TSR10_MASK            1024
#define CAN0RXTSR_TSR11_MASK            2048
#define CAN0RXTSR_TSR12_MASK            4096
#define CAN0RXTSR_TSR13_MASK            8192
#define CAN0RXTSR_TSR14_MASK            16384
#define CAN0RXTSR_TSR15_MASK            32768


 CAN0TXIDR0 - MSCAN 0 Transmit Identifier Register 0; 0x00000170 
typedef union {
  byte Byte;
  struct {
    byte ID21        1;                                        Extended format identifier Bit 21 
    byte ID22        1;                                        Extended format identifier Bit 22 
    byte ID23        1;                                        Extended format identifier Bit 23 
    byte ID24        1;                                        Extended format identifier Bit 24 
    byte ID25        1;                                        Extended format identifier Bit 25 
    byte ID26        1;                                        Extended format identifier Bit 26 
    byte ID27        1;                                        Extended format identifier Bit 27 
    byte ID28        1;                                        Extended format identifier Bit 28 
  } Bits;
} CAN0TXIDR0STR;
extern volatile CAN0TXIDR0STR _CAN0TXIDR0 @(REG_BASE + 0x00000170);
#define CAN0TXIDR0                      _CAN0TXIDR0.Byte
#define CAN0TXIDR0_ID21                 _CAN0TXIDR0.Bits.ID21
#define CAN0TXIDR0_ID22                 _CAN0TXIDR0.Bits.ID22
#define CAN0TXIDR0_ID23                 _CAN0TXIDR0.Bits.ID23
#define CAN0TXIDR0_ID24                 _CAN0TXIDR0.Bits.ID24
#define CAN0TXIDR0_ID25                 _CAN0TXIDR0.Bits.ID25
#define CAN0TXIDR0_ID26                 _CAN0TXIDR0.Bits.ID26
#define CAN0TXIDR0_ID27                 _CAN0TXIDR0.Bits.ID27
#define CAN0TXIDR0_ID28                 _CAN0TXIDR0.Bits.ID28
 CAN0TXIDR_ARR Access 4 CAN0TXIDRx registers in an array 
#define CAN0TXIDR_ARR                   ((volatile byte ) &CAN0TXIDR0)

#define CAN0TXIDR0_ID21_MASK            1
#define CAN0TXIDR0_ID22_MASK            2
#define CAN0TXIDR0_ID23_MASK            4
#define CAN0TXIDR0_ID24_MASK            8
#define CAN0TXIDR0_ID25_MASK            16
#define CAN0TXIDR0_ID26_MASK            32
#define CAN0TXIDR0_ID27_MASK            64
#define CAN0TXIDR0_ID28_MASK            128


 CAN0TXIDR1 - MSCAN 0 Transmit Identifier Register 1; 0x00000171 
typedef union {
  byte Byte;
  struct {
    byte ID15        1;                                        Extended format identifier Bit 15 
    byte ID16        1;                                        Extended format identifier Bit 16 
    byte ID17        1;                                        Extended format identifier Bit 17 
    byte IDE         1;                                        ID Extended 
    byte SRR         1;                                        Substitute Remote Request 
    byte ID18        1;                                        Extended format identifier Bit 18 
    byte ID19        1;                                        Extended format identifier Bit 19 
    byte ID20        1;                                        Extended format identifier Bit 20 
  } Bits;
  struct {
    byte grpID_15 3;
    byte         1;
    byte         1;
    byte grpID_18 3;
  } MergedBits;
} CAN0TXIDR1STR;
extern volatile CAN0TXIDR1STR _CAN0TXIDR1 @(REG_BASE + 0x00000171);
#define CAN0TXIDR1                      _CAN0TXIDR1.Byte
#define CAN0TXIDR1_ID15                 _CAN0TXIDR1.Bits.ID15
#define CAN0TXIDR1_ID16                 _CAN0TXIDR1.Bits.ID16
#define CAN0TXIDR1_ID17                 _CAN0TXIDR1.Bits.ID17
#define CAN0TXIDR1_IDE                  _CAN0TXIDR1.Bits.IDE
#define CAN0TXIDR1_SRR                  _CAN0TXIDR1.Bits.SRR
#define CAN0TXIDR1_ID18                 _CAN0TXIDR1.Bits.ID18
#define CAN0TXIDR1_ID19                 _CAN0TXIDR1.Bits.ID19
#define CAN0TXIDR1_ID20                 _CAN0TXIDR1.Bits.ID20
#define CAN0TXIDR1_ID_15                _CAN0TXIDR1.MergedBits.grpID_15
#define CAN0TXIDR1_ID_18                _CAN0TXIDR1.MergedBits.grpID_18
#define CAN0TXIDR1_ID                   CAN0TXIDR1_ID_15

#define CAN0TXIDR1_ID15_MASK            1
#define CAN0TXIDR1_ID16_MASK            2
#define CAN0TXIDR1_ID17_MASK            4
#define CAN0TXIDR1_IDE_MASK             8
#define CAN0TXIDR1_SRR_MASK             16
#define CAN0TXIDR1_ID18_MASK            32
#define CAN0TXIDR1_ID19_MASK            64
#define CAN0TXIDR1_ID20_MASK            128
#define CAN0TXIDR1_ID_15_MASK           7
#define CAN0TXIDR1_ID_15_BITNUM         0
#define CAN0TXIDR1_ID_18_MASK           224
#define CAN0TXIDR1_ID_18_BITNUM         5


 CAN0TXIDR2 - MSCAN 0 Transmit Identifier Register 2; 0x00000172 
typedef union {
  byte Byte;
  struct {
    byte ID7         1;                                        Extended format identifier Bit 7 
    byte ID8         1;                                        Extended format identifier Bit 8 
    byte ID9         1;                                        Extended format identifier Bit 9 
    byte ID10        1;                                        Extended format identifier Bit 10 
    byte ID11        1;                                        Extended format identifier Bit 11 
    byte ID12        1;                                        Extended format identifier Bit 12 
    byte ID13        1;                                        Extended format identifier Bit 13 
    byte ID14        1;                                        Extended format identifier Bit 14 
  } Bits;
} CAN0TXIDR2STR;
extern volatile CAN0TXIDR2STR _CAN0TXIDR2 @(REG_BASE + 0x00000172);
#define CAN0TXIDR2                      _CAN0TXIDR2.Byte
#define CAN0TXIDR2_ID7                  _CAN0TXIDR2.Bits.ID7
#define CAN0TXIDR2_ID8                  _CAN0TXIDR2.Bits.ID8
#define CAN0TXIDR2_ID9                  _CAN0TXIDR2.Bits.ID9
#define CAN0TXIDR2_ID10                 _CAN0TXIDR2.Bits.ID10
#define CAN0TXIDR2_ID11                 _CAN0TXIDR2.Bits.ID11
#define CAN0TXIDR2_ID12                 _CAN0TXIDR2.Bits.ID12
#define CAN0TXIDR2_ID13                 _CAN0TXIDR2.Bits.ID13
#define CAN0TXIDR2_ID14                 _CAN0TXIDR2.Bits.ID14

#define CAN0TXIDR2_ID7_MASK             1
#define CAN0TXIDR2_ID8_MASK             2
#define CAN0TXIDR2_ID9_MASK             4
#define CAN0TXIDR2_ID10_MASK            8
#define CAN0TXIDR2_ID11_MASK            16
#define CAN0TXIDR2_ID12_MASK            32
#define CAN0TXIDR2_ID13_MASK            64
#define CAN0TXIDR2_ID14_MASK            128


 CAN0TXIDR3 - MSCAN 0 Transmit Identifier Register 3; 0x00000173 
typedef union {
  byte Byte;
  struct {
    byte RTR         1;                                        Remote Transmission Request 
    byte ID0         1;                                        Extended format identifier Bit 0 
    byte ID1         1;                                        Extended format identifier Bit 1 
    byte ID2         1;                                        Extended format identifier Bit 2 
    byte ID3         1;                                        Extended format identifier Bit 3 
    byte ID4         1;                                        Extended format identifier Bit 4 
    byte ID5         1;                                        Extended format identifier Bit 5 
    byte ID6         1;                                        Extended format identifier Bit 6 
  } Bits;
  struct {
    byte         1;
    byte grpID   7;
  } MergedBits;
} CAN0TXIDR3STR;
extern volatile CAN0TXIDR3STR _CAN0TXIDR3 @(REG_BASE + 0x00000173);
#define CAN0TXIDR3                      _CAN0TXIDR3.Byte
#define CAN0TXIDR3_RTR                  _CAN0TXIDR3.Bits.RTR
#define CAN0TXIDR3_ID0                  _CAN0TXIDR3.Bits.ID0
#define CAN0TXIDR3_ID1                  _CAN0TXIDR3.Bits.ID1
#define CAN0TXIDR3_ID2                  _CAN0TXIDR3.Bits.ID2
#define CAN0TXIDR3_ID3                  _CAN0TXIDR3.Bits.ID3
#define CAN0TXIDR3_ID4                  _CAN0TXIDR3.Bits.ID4
#define CAN0TXIDR3_ID5                  _CAN0TXIDR3.Bits.ID5
#define CAN0TXIDR3_ID6                  _CAN0TXIDR3.Bits.ID6
#define CAN0TXIDR3_ID                   _CAN0TXIDR3.MergedBits.grpID

#define CAN0TXIDR3_RTR_MASK             1
#define CAN0TXIDR3_ID0_MASK             2
#define CAN0TXIDR3_ID1_MASK             4
#define CAN0TXIDR3_ID2_MASK             8
#define CAN0TXIDR3_ID3_MASK             16
#define CAN0TXIDR3_ID4_MASK             32
#define CAN0TXIDR3_ID5_MASK             64
#define CAN0TXIDR3_ID6_MASK             128
#define CAN0TXIDR3_ID_MASK              254
#define CAN0TXIDR3_ID_BITNUM            1


 CAN0TXDSR0 - MSCAN 0 Transmit Data Segment Register 0; 0x00000174 
typedef union {
  byte Byte;
  struct {
    byte DB0         1;                                        Data Bit 0 
    byte DB1         1;                                        Data Bit 1 
    byte DB2         1;                                        Data Bit 2 
    byte DB3         1;                                        Data Bit 3 
    byte DB4         1;                                        Data Bit 4 
    byte DB5         1;                                        Data Bit 5 
    byte DB6         1;                                        Data Bit 6 
    byte DB7         1;                                        Data Bit 7 
  } Bits;
} CAN0TXDSR0STR;
extern volatile CAN0TXDSR0STR _CAN0TXDSR0 @(REG_BASE + 0x00000174);
#define CAN0TXDSR0                      _CAN0TXDSR0.Byte
#define CAN0TXDSR0_DB0                  _CAN0TXDSR0.Bits.DB0
#define CAN0TXDSR0_DB1                  _CAN0TXDSR0.Bits.DB1
#define CAN0TXDSR0_DB2                  _CAN0TXDSR0.Bits.DB2
#define CAN0TXDSR0_DB3                  _CAN0TXDSR0.Bits.DB3
#define CAN0TXDSR0_DB4                  _CAN0TXDSR0.Bits.DB4
#define CAN0TXDSR0_DB5                  _CAN0TXDSR0.Bits.DB5
#define CAN0TXDSR0_DB6                  _CAN0TXDSR0.Bits.DB6
#define CAN0TXDSR0_DB7                  _CAN0TXDSR0.Bits.DB7
 CAN0TXDSR_ARR Access 8 CAN0TXDSRx registers in an array 
#define CAN0TXDSR_ARR                   ((volatile byte ) &CAN0TXDSR0)

#define CAN0TXDSR0_DB0_MASK             1
#define CAN0TXDSR0_DB1_MASK             2
#define CAN0TXDSR0_DB2_MASK             4
#define CAN0TXDSR0_DB3_MASK             8
#define CAN0TXDSR0_DB4_MASK             16
#define CAN0TXDSR0_DB5_MASK             32
#define CAN0TXDSR0_DB6_MASK             64
#define CAN0TXDSR0_DB7_MASK             128


 CAN0TXDSR1 - MSCAN 0 Transmit Data Segment Register 1; 0x00000175 
typedef union {
  byte Byte;
  struct {
    byte DB0         1;                                        Data Bit 0 
    byte DB1         1;                                        Data Bit 1 
    byte DB2         1;                                        Data Bit 2 
    byte DB3         1;                                        Data Bit 3 
    byte DB4         1;                                        Data Bit 4 
    byte DB5         1;                                        Data Bit 5 
    byte DB6         1;                                        Data Bit 6 
    byte DB7         1;                                        Data Bit 7 
  } Bits;
} CAN0TXDSR1STR;
extern volatile CAN0TXDSR1STR _CAN0TXDSR1 @(REG_BASE + 0x00000175);
#define CAN0TXDSR1                      _CAN0TXDSR1.Byte
#define CAN0TXDSR1_DB0                  _CAN0TXDSR1.Bits.DB0
#define CAN0TXDSR1_DB1                  _CAN0TXDSR1.Bits.DB1
#define CAN0TXDSR1_DB2                  _CAN0TXDSR1.Bits.DB2
#define CAN0TXDSR1_DB3                  _CAN0TXDSR1.Bits.DB3
#define CAN0TXDSR1_DB4                  _CAN0TXDSR1.Bits.DB4
#define CAN0TXDSR1_DB5                  _CAN0TXDSR1.Bits.DB5
#define CAN0TXDSR1_DB6                  _CAN0TXDSR1.Bits.DB6
#define CAN0TXDSR1_DB7                  _CAN0TXDSR1.Bits.DB7

