gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
#define CAN0TXDSR7_DB0_MASK             1
#define CAN0TXDSR7_DB1_MASK             2
#define CAN0TXDSR7_DB2_MASK             4
#define CAN0TXDSR7_DB3_MASK             8
#define CAN0TXDSR7_DB4_MASK             16
#define CAN0TXDSR7_DB5_MASK             32
#define CAN0TXDSR7_DB6_MASK             64
#define CAN0TXDSR7_DB7_MASK             128


 CAN0TXDLR - MSCAN 0 Transmit Data Length Register; 0x0000017C 
typedef union {
  byte Byte;
  struct {
    byte DLC0        1;                                        Data Length Code Bit 0 
    byte DLC1        1;                                        Data Length Code Bit 1 
    byte DLC2        1;                                        Data Length Code Bit 2 
    byte DLC3        1;                                        Data Length Code Bit 3 
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
  } Bits;
  struct {
    byte grpDLC  4;
    byte         1;
    byte         1;
    byte         1;
    byte         1;
  } MergedBits;
} CAN0TXDLRSTR;
extern volatile CAN0TXDLRSTR _CAN0TXDLR @(REG_BASE + 0x0000017C);
#define CAN0TXDLR                       _CAN0TXDLR.Byte
#define CAN0TXDLR_DLC0                  _CAN0TXDLR.Bits.DLC0
#define CAN0TXDLR_DLC1                  _CAN0TXDLR.Bits.DLC1
#define CAN0TXDLR_DLC2                  _CAN0TXDLR.Bits.DLC2
#define CAN0TXDLR_DLC3                  _CAN0TXDLR.Bits.DLC3
#define CAN0TXDLR_DLC                   _CAN0TXDLR.MergedBits.grpDLC

#define CAN0TXDLR_DLC0_MASK             1
#define CAN0TXDLR_DLC1_MASK             2
#define CAN0TXDLR_DLC2_MASK             4
#define CAN0TXDLR_DLC3_MASK             8
#define CAN0TXDLR_DLC_MASK              15
#define CAN0TXDLR_DLC_BITNUM            0


 CAN0TXTBPR - MSCAN 0 Transmit Buffer Priority; 0x0000017D 
typedef union {
  byte Byte;
  struct {
    byte PRIO0       1;                                        Transmit Buffer Priority Bit 0 
    byte PRIO1       1;                                        Transmit Buffer Priority Bit 1 
    byte PRIO2       1;                                        Transmit Buffer Priority Bit 2 
    byte PRIO3       1;                                        Transmit Buffer Priority Bit 3 
    byte PRIO4       1;                                        Transmit Buffer Priority Bit 4 
    byte PRIO5       1;                                        Transmit Buffer Priority Bit 5 
    byte PRIO6       1;                                        Transmit Buffer Priority Bit 6 
    byte PRIO7       1;                                        Transmit Buffer Priority Bit 7 
  } Bits;
} CAN0TXTBPRSTR;
extern volatile CAN0TXTBPRSTR _CAN0TXTBPR @(REG_BASE + 0x0000017D);
#define CAN0TXTBPR                      _CAN0TXTBPR.Byte
#define CAN0TXTBPR_PRIO0                _CAN0TXTBPR.Bits.PRIO0
#define CAN0TXTBPR_PRIO1                _CAN0TXTBPR.Bits.PRIO1
#define CAN0TXTBPR_PRIO2                _CAN0TXTBPR.Bits.PRIO2
#define CAN0TXTBPR_PRIO3                _CAN0TXTBPR.Bits.PRIO3
#define CAN0TXTBPR_PRIO4                _CAN0TXTBPR.Bits.PRIO4
#define CAN0TXTBPR_PRIO5                _CAN0TXTBPR.Bits.PRIO5
#define CAN0TXTBPR_PRIO6                _CAN0TXTBPR.Bits.PRIO6
#define CAN0TXTBPR_PRIO7                _CAN0TXTBPR.Bits.PRIO7

#define CAN0TXTBPR_PRIO0_MASK           1
#define CAN0TXTBPR_PRIO1_MASK           2
#define CAN0TXTBPR_PRIO2_MASK           4
#define CAN0TXTBPR_PRIO3_MASK           8
#define CAN0TXTBPR_PRIO4_MASK           16
#define CAN0TXTBPR_PRIO5_MASK           32
#define CAN0TXTBPR_PRIO6_MASK           64
#define CAN0TXTBPR_PRIO7_MASK           128


 CAN0TXTSR - MSCAN 0 Transmit Time Stamp Register; 0x0000017E 
typedef union {
  word Word;
    Overlapped registers 
  struct {
     CAN0TXTSRH - MSCAN 0 Transmit Time Stamp Register High; 0x0000017E 
    union {
      byte Byte;
      struct {
        byte TSR8        1;                                        Time Stamp Bit 8 
        byte TSR9        1;                                        Time Stamp Bit 9 
        byte TSR10       1;                                        Time Stamp Bit 10 
        byte TSR11       1;                                        Time Stamp Bit 11 
        byte TSR12       1;                                        Time Stamp Bit 12 
        byte TSR13       1;                                        Time Stamp Bit 13 
        byte TSR14       1;                                        Time Stamp Bit 14 
        byte TSR15       1;                                        Time Stamp Bit 15 
      } Bits;
    } CAN0TXTSRHSTR;
    #define CAN0TXTSRH                  _CAN0TXTSR.Overlap_STR.CAN0TXTSRHSTR.Byte
    #define CAN0TXTSRH_TSR8             _CAN0TXTSR.Overlap_STR.CAN0TXTSRHSTR.Bits.TSR8
    #define CAN0TXTSRH_TSR9             _CAN0TXTSR.Overlap_STR.CAN0TXTSRHSTR.Bits.TSR9
    #define CAN0TXTSRH_TSR10            _CAN0TXTSR.Overlap_STR.CAN0TXTSRHSTR.Bits.TSR10
    #define CAN0TXTSRH_TSR11            _CAN0TXTSR.Overlap_STR.CAN0TXTSRHSTR.Bits.TSR11
    #define CAN0TXTSRH_TSR12            _CAN0TXTSR.Overlap_STR.CAN0TXTSRHSTR.Bits.TSR12
    #define CAN0TXTSRH_TSR13            _CAN0TXTSR.Overlap_STR.CAN0TXTSRHSTR.Bits.TSR13
    #define CAN0TXTSRH_TSR14            _CAN0TXTSR.Overlap_STR.CAN0TXTSRHSTR.Bits.TSR14
    #define CAN0TXTSRH_TSR15            _CAN0TXTSR.Overlap_STR.CAN0TXTSRHSTR.Bits.TSR15
    
    
    #define CAN0TXTSRH_TSR8_MASK        1
    #define CAN0TXTSRH_TSR9_MASK        2
    #define CAN0TXTSRH_TSR10_MASK       4
    #define CAN0TXTSRH_TSR11_MASK       8
    #define CAN0TXTSRH_TSR12_MASK       16
    #define CAN0TXTSRH_TSR13_MASK       32
    #define CAN0TXTSRH_TSR14_MASK       64
    #define CAN0TXTSRH_TSR15_MASK       128


     CAN0TXTSRL - MSCAN 0 Transmit Time Stamp Register Low; 0x0000017F 
    union {
      byte Byte;
      struct {
        byte TSR0        1;                                        Time Stamp Bit 0 
        byte TSR1        1;                                        Time Stamp Bit 1 
        byte TSR2        1;                                        Time Stamp Bit 2 
        byte TSR3        1;                                        Time Stamp Bit 3 
        byte TSR4        1;                                        Time Stamp Bit 4 
        byte TSR5        1;                                        Time Stamp Bit 5 
        byte TSR6        1;                                        Time Stamp Bit 6 
        byte TSR7        1;                                        Time Stamp Bit 7 
      } Bits;
    } CAN0TXTSRLSTR;
    #define CAN0TXTSRL                  _CAN0TXTSR.Overlap_STR.CAN0TXTSRLSTR.Byte
    #define CAN0TXTSRL_TSR0             _CAN0TXTSR.Overlap_STR.CAN0TXTSRLSTR.Bits.TSR0
    #define CAN0TXTSRL_TSR1             _CAN0TXTSR.Overlap_STR.CAN0TXTSRLSTR.Bits.TSR1
    #define CAN0TXTSRL_TSR2             _CAN0TXTSR.Overlap_STR.CAN0TXTSRLSTR.Bits.TSR2
    #define CAN0TXTSRL_TSR3             _CAN0TXTSR.Overlap_STR.CAN0TXTSRLSTR.Bits.TSR3
    #define CAN0TXTSRL_TSR4             _CAN0TXTSR.Overlap_STR.CAN0TXTSRLSTR.Bits.TSR4
    #define CAN0TXTSRL_TSR5             _CAN0TXTSR.Overlap_STR.CAN0TXTSRLSTR.Bits.TSR5
    #define CAN0TXTSRL_TSR6             _CAN0TXTSR.Overlap_STR.CAN0TXTSRLSTR.Bits.TSR6
    #define CAN0TXTSRL_TSR7             _CAN0TXTSR.Overlap_STR.CAN0TXTSRLSTR.Bits.TSR7
    
    
    #define CAN0TXTSRL_TSR0_MASK        1
    #define CAN0TXTSRL_TSR1_MASK        2
    #define CAN0TXTSRL_TSR2_MASK        4
    #define CAN0TXTSRL_TSR3_MASK        8
    #define CAN0TXTSRL_TSR4_MASK        16
    #define CAN0TXTSRL_TSR5_MASK        32
    #define CAN0TXTSRL_TSR6_MASK        64
    #define CAN0TXTSRL_TSR7_MASK        128

  } Overlap_STR;

