gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
  struct {
    word TSR0        1;                                        Time Stamp Bit 0 
    word TSR1        1;                                        Time Stamp Bit 1 
    word TSR2        1;                                        Time Stamp Bit 2 
    word TSR3        1;                                        Time Stamp Bit 3 
    word TSR4        1;                                        Time Stamp Bit 4 
    word TSR5        1;                                        Time Stamp Bit 5 
    word TSR6        1;                                        Time Stamp Bit 6 
    word TSR7        1;                                        Time Stamp Bit 7 
    word TSR8        1;                                        Time Stamp Bit 8 
    word TSR9        1;                                        Time Stamp Bit 9 
    word TSR10       1;                                        Time Stamp Bit 10 
    word TSR11       1;                                        Time Stamp Bit 11 
    word TSR12       1;                                        Time Stamp Bit 12 
    word TSR13       1;                                        Time Stamp Bit 13 
    word TSR14       1;                                        Time Stamp Bit 14 
    word TSR15       1;                                        Time Stamp Bit 15 
  } Bits;
} CAN0TXTSRSTR;
extern volatile CAN0TXTSRSTR _CAN0TXTSR @(REG_BASE + 0x0000017E);
#define CAN0TXTSR                       _CAN0TXTSR.Word
#define CAN0TXTSR_TSR0                  _CAN0TXTSR.Bits.TSR0
#define CAN0TXTSR_TSR1                  _CAN0TXTSR.Bits.TSR1
#define CAN0TXTSR_TSR2                  _CAN0TXTSR.Bits.TSR2
#define CAN0TXTSR_TSR3                  _CAN0TXTSR.Bits.TSR3
#define CAN0TXTSR_TSR4                  _CAN0TXTSR.Bits.TSR4
#define CAN0TXTSR_TSR5                  _CAN0TXTSR.Bits.TSR5
#define CAN0TXTSR_TSR6                  _CAN0TXTSR.Bits.TSR6
#define CAN0TXTSR_TSR7                  _CAN0TXTSR.Bits.TSR7
#define CAN0TXTSR_TSR8                  _CAN0TXTSR.Bits.TSR8
#define CAN0TXTSR_TSR9                  _CAN0TXTSR.Bits.TSR9
#define CAN0TXTSR_TSR10                 _CAN0TXTSR.Bits.TSR10
#define CAN0TXTSR_TSR11                 _CAN0TXTSR.Bits.TSR11
#define CAN0TXTSR_TSR12                 _CAN0TXTSR.Bits.TSR12
#define CAN0TXTSR_TSR13                 _CAN0TXTSR.Bits.TSR13
#define CAN0TXTSR_TSR14                 _CAN0TXTSR.Bits.TSR14
#define CAN0TXTSR_TSR15                 _CAN0TXTSR.Bits.TSR15

#define CAN0TXTSR_TSR0_MASK             1
#define CAN0TXTSR_TSR1_MASK             2
#define CAN0TXTSR_TSR2_MASK             4
#define CAN0TXTSR_TSR3_MASK             8
#define CAN0TXTSR_TSR4_MASK             16
#define CAN0TXTSR_TSR5_MASK             32
#define CAN0TXTSR_TSR6_MASK             64
#define CAN0TXTSR_TSR7_MASK             128
#define CAN0TXTSR_TSR8_MASK             256
#define CAN0TXTSR_TSR9_MASK             512
#define CAN0TXTSR_TSR10_MASK            1024
#define CAN0TXTSR_TSR11_MASK            2048
#define CAN0TXTSR_TSR12_MASK            4096
#define CAN0TXTSR_TSR13_MASK            8192
#define CAN0TXTSR_TSR14_MASK            16384
#define CAN0TXTSR_TSR15_MASK            32768


 PTT - Port T IO Register; 0x00000240 
typedef union {
  byte Byte;
  struct {
    byte PTT0        1;                                        Port T Bit 0 
    byte PTT1        1;                                        Port T Bit 1 
    byte PTT2        1;                                        Port T Bit 2 
    byte PTT3        1;                                        Port T Bit 3 
    byte PTT4        1;                                        Port T Bit 4 
    byte PTT5        1;                                        Port T Bit 5 
    byte PTT6        1;                                        Port T Bit 6 
    byte PTT7        1;                                        Port T Bit 7 
  } Bits;
} PTTSTR;
extern volatile PTTSTR _PTT @(REG_BASE + 0x00000240);
#define PTT                             _PTT.Byte
#define PTT_PTT0                        _PTT.Bits.PTT0
#define PTT_PTT1                        _PTT.Bits.PTT1
#define PTT_PTT2                        _PTT.Bits.PTT2
#define PTT_PTT3                        _PTT.Bits.PTT3
#define PTT_PTT4                        _PTT.Bits.PTT4
#define PTT_PTT5                        _PTT.Bits.PTT5
#define PTT_PTT6                        _PTT.Bits.PTT6
#define PTT_PTT7                        _PTT.Bits.PTT7

#define PTT_PTT0_MASK                   1
#define PTT_PTT1_MASK                   2
#define PTT_PTT2_MASK                   4
#define PTT_PTT3_MASK                   8
#define PTT_PTT4_MASK                   16
#define PTT_PTT5_MASK                   32
#define PTT_PTT6_MASK                   64
#define PTT_PTT7_MASK                   128


 PTIT - Port T Input Register; 0x00000241 
typedef union {
  byte Byte;
  struct {
    byte PTIT0       1;                                        Port T Bit 0 
    byte PTIT1       1;                                        Port T Bit 1 
    byte PTIT2       1;                                        Port T Bit 2 
    byte PTIT3       1;                                        Port T Bit 3 
    byte PTIT4       1;                                        Port T Bit 4 
    byte PTIT5       1;                                        Port T Bit 5 
    byte PTIT6       1;                                        Port T Bit 6 
    byte PTIT7       1;                                        Port T Bit 7 
  } Bits;
} PTITSTR;
extern volatile PTITSTR _PTIT @(REG_BASE + 0x00000241);
#define PTIT                            _PTIT.Byte
#define PTIT_PTIT0                      _PTIT.Bits.PTIT0
#define PTIT_PTIT1                      _PTIT.Bits.PTIT1
#define PTIT_PTIT2                      _PTIT.Bits.PTIT2
#define PTIT_PTIT3                      _PTIT.Bits.PTIT3
#define PTIT_PTIT4                      _PTIT.Bits.PTIT4
#define PTIT_PTIT5                      _PTIT.Bits.PTIT5
#define PTIT_PTIT6                      _PTIT.Bits.PTIT6
#define PTIT_PTIT7                      _PTIT.Bits.PTIT7

#define PTIT_PTIT0_MASK                 1
#define PTIT_PTIT1_MASK                 2
#define PTIT_PTIT2_MASK                 4
#define PTIT_PTIT3_MASK                 8
#define PTIT_PTIT4_MASK                 16
#define PTIT_PTIT5_MASK                 32
#define PTIT_PTIT6_MASK                 64
#define PTIT_PTIT7_MASK                 128


 DDRT - Port T Data Direction Register; 0x00000242 
typedef union {
  byte Byte;
  struct {
    byte DDRT0       1;                                        Data Direction Port T Bit 0 
    byte DDRT1       1;                                        Data Direction Port T Bit 1 
    byte DDRT2       1;                                        Data Direction Port T Bit 2 
    byte DDRT3       1;                                        Data Direction Port T Bit 3 
    byte DDRT4       1;                                        Data Direction Port T Bit 4 
    byte DDRT5       1;                                        Data Direction Port T Bit 5 
    byte DDRT6       1;                                        Data Direction Port T Bit 6 
    byte DDRT7       1;                                        Data Direction Port T Bit 7 
  } Bits;
} DDRTSTR;
extern volatile DDRTSTR _DDRT @(REG_BASE + 0x00000242);
#define DDRT                            _DDRT.Byte
#define DDRT_DDRT0                      _DDRT.Bits.DDRT0
#define DDRT_DDRT1                      _DDRT.Bits.DDRT1
#define DDRT_DDRT2                      _DDRT.Bits.DDRT2
#define DDRT_DDRT3                      _DDRT.Bits.DDRT3
#define DDRT_DDRT4                      _DDRT.Bits.DDRT4
#define DDRT_DDRT5                      _DDRT.Bits.DDRT5
#define DDRT_DDRT6                      _DDRT.Bits.DDRT6
#define DDRT_DDRT7                      _DDRT.Bits.DDRT7

