gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
#define DDRT_DDRT0_MASK                 1
#define DDRT_DDRT1_MASK                 2
#define DDRT_DDRT2_MASK                 4
#define DDRT_DDRT3_MASK                 8
#define DDRT_DDRT4_MASK                 16
#define DDRT_DDRT5_MASK                 32
#define DDRT_DDRT6_MASK                 64
#define DDRT_DDRT7_MASK                 128


 RDRT - Port T Reduced Drive Register; 0x00000243 
typedef union {
  byte Byte;
  struct {
    byte RDRT0       1;                                        Reduced Drive Port T Bit 0 
    byte RDRT1       1;                                        Reduced Drive Port T Bit 1 
    byte RDRT2       1;                                        Reduced Drive Port T Bit 2 
    byte RDRT3       1;                                        Reduced Drive Port T Bit 3 
    byte RDRT4       1;                                        Reduced Drive Port T Bit 4 
    byte RDRT5       1;                                        Reduced Drive Port T Bit 5 
    byte RDRT6       1;                                        Reduced Drive Port T Bit 6 
    byte RDRT7       1;                                        Reduced Drive Port T Bit 7 
  } Bits;
} RDRTSTR;
extern volatile RDRTSTR _RDRT @(REG_BASE + 0x00000243);
#define RDRT                            _RDRT.Byte
#define RDRT_RDRT0                      _RDRT.Bits.RDRT0
#define RDRT_RDRT1                      _RDRT.Bits.RDRT1
#define RDRT_RDRT2                      _RDRT.Bits.RDRT2
#define RDRT_RDRT3                      _RDRT.Bits.RDRT3
#define RDRT_RDRT4                      _RDRT.Bits.RDRT4
#define RDRT_RDRT5                      _RDRT.Bits.RDRT5
#define RDRT_RDRT6                      _RDRT.Bits.RDRT6
#define RDRT_RDRT7                      _RDRT.Bits.RDRT7

#define RDRT_RDRT0_MASK                 1
#define RDRT_RDRT1_MASK                 2
#define RDRT_RDRT2_MASK                 4
#define RDRT_RDRT3_MASK                 8
#define RDRT_RDRT4_MASK                 16
#define RDRT_RDRT5_MASK                 32
#define RDRT_RDRT6_MASK                 64
#define RDRT_RDRT7_MASK                 128


 PERT - Port T Pull Device Enable Register; 0x00000244 
typedef union {
  byte Byte;
  struct {
    byte PERT0       1;                                        Pull Device Enable Port T Bit 0 
    byte PERT1       1;                                        Pull Device Enable Port T Bit 1 
    byte PERT2       1;                                        Pull Device Enable Port T Bit 2 
    byte PERT3       1;                                        Pull Device Enable Port T Bit 3 
    byte PERT4       1;                                        Pull Device Enable Port T Bit 4 
    byte PERT5       1;                                        Pull Device Enable Port T Bit 5 
    byte PERT6       1;                                        Pull Device Enable Port T Bit 6 
    byte PERT7       1;                                        Pull Device Enable Port T Bit 7 
  } Bits;
} PERTSTR;
extern volatile PERTSTR _PERT @(REG_BASE + 0x00000244);
#define PERT                            _PERT.Byte
#define PERT_PERT0                      _PERT.Bits.PERT0
#define PERT_PERT1                      _PERT.Bits.PERT1
#define PERT_PERT2                      _PERT.Bits.PERT2
#define PERT_PERT3                      _PERT.Bits.PERT3
#define PERT_PERT4                      _PERT.Bits.PERT4
#define PERT_PERT5                      _PERT.Bits.PERT5
#define PERT_PERT6                      _PERT.Bits.PERT6
#define PERT_PERT7                      _PERT.Bits.PERT7

#define PERT_PERT0_MASK                 1
#define PERT_PERT1_MASK                 2
#define PERT_PERT2_MASK                 4
#define PERT_PERT3_MASK                 8
#define PERT_PERT4_MASK                 16
#define PERT_PERT5_MASK                 32
#define PERT_PERT6_MASK                 64
#define PERT_PERT7_MASK                 128


 PPST - Port T Polarity Select Register; 0x00000245 
typedef union {
  byte Byte;
  struct {
    byte PPST0       1;                                        Pull Select Port T Bit 0 
    byte PPST1       1;                                        Pull Select Port T Bit 1 
    byte PPST2       1;                                        Pull Select Port T Bit 2 
    byte PPST3       1;                                        Pull Select Port T Bit 3 
    byte PPST4       1;                                        Pull Select Port T Bit 4 
    byte PPST5       1;                                        Pull Select Port T Bit 5 
    byte PPST6       1;                                        Pull Select Port T Bit 6 
    byte PPST7       1;                                        Pull Select Port T Bit 7 
  } Bits;
} PPSTSTR;
extern volatile PPSTSTR _PPST @(REG_BASE + 0x00000245);
#define PPST                            _PPST.Byte
#define PPST_PPST0                      _PPST.Bits.PPST0
#define PPST_PPST1                      _PPST.Bits.PPST1
#define PPST_PPST2                      _PPST.Bits.PPST2
#define PPST_PPST3                      _PPST.Bits.PPST3
#define PPST_PPST4                      _PPST.Bits.PPST4
#define PPST_PPST5                      _PPST.Bits.PPST5
#define PPST_PPST6                      _PPST.Bits.PPST6
#define PPST_PPST7                      _PPST.Bits.PPST7

#define PPST_PPST0_MASK                 1
#define PPST_PPST1_MASK                 2
#define PPST_PPST2_MASK                 4
#define PPST_PPST3_MASK                 8
#define PPST_PPST4_MASK                 16
#define PPST_PPST5_MASK                 32
#define PPST_PPST6_MASK                 64
#define PPST_PPST7_MASK                 128


 PTS - Port S IO Register; 0x00000248 
typedef union {
  byte Byte;
  struct {
    byte PTS0        1;                                        Port S Bit 0 
    byte PTS1        1;                                        Port S Bit 1 
    byte PTS2        1;                                        Port S Bit 2 
    byte PTS3        1;                                        Port S Bit 3 
    byte PTS4        1;                                        Port S Bit 4 
    byte PTS5        1;                                        Port S Bit 5 
    byte PTS6        1;                                        Port S Bit 6 
    byte PTS7        1;                                        Port S Bit 7 
  } Bits;
} PTSSTR;
