gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
extern volatile PTSSTR _PTS @(REG_BASE + 0x00000248);
#define PTS                             _PTS.Byte
#define PTS_PTS0                        _PTS.Bits.PTS0
#define PTS_PTS1                        _PTS.Bits.PTS1
#define PTS_PTS2                        _PTS.Bits.PTS2
#define PTS_PTS3                        _PTS.Bits.PTS3
#define PTS_PTS4                        _PTS.Bits.PTS4
#define PTS_PTS5                        _PTS.Bits.PTS5
#define PTS_PTS6                        _PTS.Bits.PTS6
#define PTS_PTS7                        _PTS.Bits.PTS7

#define PTS_PTS0_MASK                   1
#define PTS_PTS1_MASK                   2
#define PTS_PTS2_MASK                   4
#define PTS_PTS3_MASK                   8
#define PTS_PTS4_MASK                   16
#define PTS_PTS5_MASK                   32
#define PTS_PTS6_MASK                   64
#define PTS_PTS7_MASK                   128


 PTIS - Port S Input Register; 0x00000249 
typedef union {
  byte Byte;
  struct {
    byte PTIS0       1;                                        Port S Bit 0 
    byte PTIS1       1;                                        Port S Bit 1 
    byte PTIS2       1;                                        Port S Bit 2 
    byte PTIS3       1;                                        Port S Bit 3 
    byte PTIS4       1;                                        Port S Bit 4 
    byte PTIS5       1;                                        Port S Bit 5 
    byte PTIS6       1;                                        Port S Bit 6 
    byte PTIS7       1;                                        Port S Bit 7 
  } Bits;
} PTISSTR;
extern volatile PTISSTR _PTIS @(REG_BASE + 0x00000249);
#define PTIS                            _PTIS.Byte
#define PTIS_PTIS0                      _PTIS.Bits.PTIS0
#define PTIS_PTIS1                      _PTIS.Bits.PTIS1
#define PTIS_PTIS2                      _PTIS.Bits.PTIS2
#define PTIS_PTIS3                      _PTIS.Bits.PTIS3
#define PTIS_PTIS4                      _PTIS.Bits.PTIS4
#define PTIS_PTIS5                      _PTIS.Bits.PTIS5
#define PTIS_PTIS6                      _PTIS.Bits.PTIS6
#define PTIS_PTIS7                      _PTIS.Bits.PTIS7

#define PTIS_PTIS0_MASK                 1
#define PTIS_PTIS1_MASK                 2
#define PTIS_PTIS2_MASK                 4
#define PTIS_PTIS3_MASK                 8
#define PTIS_PTIS4_MASK                 16
#define PTIS_PTIS5_MASK                 32
#define PTIS_PTIS6_MASK                 64
#define PTIS_PTIS7_MASK                 128


 DDRS - Port S Data Direction Register; 0x0000024A 
typedef union {
  byte Byte;
  struct {
    byte DDRS0       1;                                        Data Direction Port S Bit 0 
    byte DDRS1       1;                                        Data Direction Port S Bit 1 
    byte DDRS2       1;                                        Data Direction Port S Bit 2 
    byte DDRS3       1;                                        Data Direction Port S Bit 3 
    byte DDRS4       1;                                        Data Direction Port S Bit 4 
    byte DDRS5       1;                                        Data Direction Port S Bit 5 
    byte DDRS6       1;                                        Data Direction Port S Bit 6 
    byte DDRS7       1;                                        Data Direction Port S Bit 7 
  } Bits;
} DDRSSTR;
extern volatile DDRSSTR _DDRS @(REG_BASE + 0x0000024A);
#define DDRS                            _DDRS.Byte
#define DDRS_DDRS0                      _DDRS.Bits.DDRS0
#define DDRS_DDRS1                      _DDRS.Bits.DDRS1
#define DDRS_DDRS2                      _DDRS.Bits.DDRS2
#define DDRS_DDRS3                      _DDRS.Bits.DDRS3
#define DDRS_DDRS4                      _DDRS.Bits.DDRS4
#define DDRS_DDRS5                      _DDRS.Bits.DDRS5
#define DDRS_DDRS6                      _DDRS.Bits.DDRS6
#define DDRS_DDRS7                      _DDRS.Bits.DDRS7

#define DDRS_DDRS0_MASK                 1
#define DDRS_DDRS1_MASK                 2
#define DDRS_DDRS2_MASK                 4
#define DDRS_DDRS3_MASK                 8
#define DDRS_DDRS4_MASK                 16
#define DDRS_DDRS5_MASK                 32
#define DDRS_DDRS6_MASK                 64
#define DDRS_DDRS7_MASK                 128


 RDRS - Port S Reduced Drive Register; 0x0000024B 
typedef union {
  byte Byte;
  struct {
    byte RDRS0       1;                                        Reduced Drive Port S Bit 0 
    byte RDRS1       1;                                        Reduced Drive Port S Bit 1 
    byte RDRS2       1;                                        Reduced Drive Port S Bit 2 
    byte RDRS3       1;                                        Reduced Drive Port S Bit 3 
    byte RDRS4       1;                                        Reduced Drive Port S Bit 4 
    byte RDRS5       1;                                        Reduced Drive Port S Bit 5 
    byte RDRS6       1;                                        Reduced Drive Port S Bit 6 
    byte RDRS7       1;                                        Reduced Drive Port S Bit 7 
  } Bits;
} RDRSSTR;
extern volatile RDRSSTR _RDRS @(REG_BASE + 0x0000024B);
#define RDRS                            _RDRS.Byte
#define RDRS_RDRS0                      _RDRS.Bits.RDRS0
#define RDRS_RDRS1                      _RDRS.Bits.RDRS1
#define RDRS_RDRS2                      _RDRS.Bits.RDRS2
#define RDRS_RDRS3                      _RDRS.Bits.RDRS3
#define RDRS_RDRS4                      _RDRS.Bits.RDRS4
#define RDRS_RDRS5                      _RDRS.Bits.RDRS5
#define RDRS_RDRS6                      _RDRS.Bits.RDRS6
#define RDRS_RDRS7                      _RDRS.Bits.RDRS7

#define RDRS_RDRS0_MASK                 1
#define RDRS_RDRS1_MASK                 2
#define RDRS_RDRS2_MASK                 4
#define RDRS_RDRS3_MASK                 8
#define RDRS_RDRS4_MASK                 16
#define RDRS_RDRS5_MASK                 32
#define RDRS_RDRS6_MASK                 64
#define RDRS_RDRS7_MASK                 128


