gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
 PERS - Port S Pull Device Enable Register; 0x0000024C 
typedef union {
  byte Byte;
  struct {
    byte PERS0       1;                                        Pull Device Enable Port S Bit 0 
    byte PERS1       1;                                        Pull Device Enable Port S Bit 1 
    byte PERS2       1;                                        Pull Device Enable Port S Bit 2 
    byte PERS3       1;                                        Pull Device Enable Port S Bit 3 
    byte PERS4       1;                                        Pull Device Enable Port S Bit 4 
    byte PERS5       1;                                        Pull Device Enable Port S Bit 5 
    byte PERS6       1;                                        Pull Device Enable Port S Bit 6 
    byte PERS7       1;                                        Pull Device Enable Port S Bit 7 
  } Bits;
} PERSSTR;
extern volatile PERSSTR _PERS @(REG_BASE + 0x0000024C);
#define PERS                            _PERS.Byte
#define PERS_PERS0                      _PERS.Bits.PERS0
#define PERS_PERS1                      _PERS.Bits.PERS1
#define PERS_PERS2                      _PERS.Bits.PERS2
#define PERS_PERS3                      _PERS.Bits.PERS3
#define PERS_PERS4                      _PERS.Bits.PERS4
#define PERS_PERS5                      _PERS.Bits.PERS5
#define PERS_PERS6                      _PERS.Bits.PERS6
#define PERS_PERS7                      _PERS.Bits.PERS7

#define PERS_PERS0_MASK                 1
#define PERS_PERS1_MASK                 2
#define PERS_PERS2_MASK                 4
#define PERS_PERS3_MASK                 8
#define PERS_PERS4_MASK                 16
#define PERS_PERS5_MASK                 32
#define PERS_PERS6_MASK                 64
#define PERS_PERS7_MASK                 128


 PPSS - Port S Polarity Select Register; 0x0000024D 
typedef union {
  byte Byte;
  struct {
    byte PPSS0       1;                                        Pull Select Port S Bit 0 
    byte PPSS1       1;                                        Pull Select Port S Bit 1 
    byte PPSS2       1;                                        Pull Select Port S Bit 2 
    byte PPSS3       1;                                        Pull Select Port S Bit 3 
    byte PPSS4       1;                                        Pull Select Port S Bit 4 
    byte PPSS5       1;                                        Pull Select Port S Bit 5 
    byte PPSS6       1;                                        Pull Select Port S Bit 6 
    byte PPSS7       1;                                        Pull Select Port S Bit 7 
  } Bits;
} PPSSSTR;
extern volatile PPSSSTR _PPSS @(REG_BASE + 0x0000024D);
#define PPSS                            _PPSS.Byte
#define PPSS_PPSS0                      _PPSS.Bits.PPSS0
#define PPSS_PPSS1                      _PPSS.Bits.PPSS1
#define PPSS_PPSS2                      _PPSS.Bits.PPSS2
#define PPSS_PPSS3                      _PPSS.Bits.PPSS3
#define PPSS_PPSS4                      _PPSS.Bits.PPSS4
#define PPSS_PPSS5                      _PPSS.Bits.PPSS5
#define PPSS_PPSS6                      _PPSS.Bits.PPSS6
#define PPSS_PPSS7                      _PPSS.Bits.PPSS7

#define PPSS_PPSS0_MASK                 1
#define PPSS_PPSS1_MASK                 2
#define PPSS_PPSS2_MASK                 4
#define PPSS_PPSS3_MASK                 8
#define PPSS_PPSS4_MASK                 16
#define PPSS_PPSS5_MASK                 32
#define PPSS_PPSS6_MASK                 64
#define PPSS_PPSS7_MASK                 128


 WOMS - Port S Wired-Or Mode Register; 0x0000024E 
typedef union {
  byte Byte;
  struct {
    byte WOMS0       1;                                        Wired-Or Mode Port S Bit 0 
    byte WOMS1       1;                                        Wired-Or Mode Port S Bit 1 
    byte WOMS2       1;                                        Wired-Or Mode Port S Bit 2 
    byte WOMS3       1;                                        Wired-Or Mode Port S Bit 3 
    byte WOMS4       1;                                        Wired-Or Mode Port S Bit 4 
    byte WOMS5       1;                                        Wired-Or Mode Port S Bit 5 
    byte WOMS6       1;                                        Wired-Or Mode Port S Bit 6 
    byte WOMS7       1;                                        Wired-Or Mode Port S Bit 7 
  } Bits;
} WOMSSTR;
extern volatile WOMSSTR _WOMS @(REG_BASE + 0x0000024E);
#define WOMS                            _WOMS.Byte
#define WOMS_WOMS0                      _WOMS.Bits.WOMS0
#define WOMS_WOMS1                      _WOMS.Bits.WOMS1
#define WOMS_WOMS2                      _WOMS.Bits.WOMS2
#define WOMS_WOMS3                      _WOMS.Bits.WOMS3
#define WOMS_WOMS4                      _WOMS.Bits.WOMS4
#define WOMS_WOMS5                      _WOMS.Bits.WOMS5
#define WOMS_WOMS6                      _WOMS.Bits.WOMS6
#define WOMS_WOMS7                      _WOMS.Bits.WOMS7

#define WOMS_WOMS0_MASK                 1
#define WOMS_WOMS1_MASK                 2
#define WOMS_WOMS2_MASK                 4
#define WOMS_WOMS3_MASK                 8
#define WOMS_WOMS4_MASK                 16
#define WOMS_WOMS5_MASK                 32
#define WOMS_WOMS6_MASK                 64
#define WOMS_WOMS7_MASK                 128


 PTM - Port M IO Register; 0x00000250 
typedef union {
  byte Byte;
  struct {
    byte PTM0        1;                                        Port M Bit 0 
    byte PTM1        1;                                        Port M Bit 1 
    byte PTM2        1;                                        Port M Bit 2 
    byte PTM3        1;                                        Port M Bit 3 
    byte PTM4        1;                                        Port M Bit 4 
    byte PTM5        1;                                        Port M Bit 5 
    byte PTM6        1;                                        Port M Bit 6 
    byte PTM7        1;                                        Port M Bit 7 
  } Bits;
} PTMSTR;
extern volatile PTMSTR _PTM @(REG_BASE + 0x00000250);
#define PTM                             _PTM.Byte
#define PTM_PTM0                        _PTM.Bits.PTM0
#define PTM_PTM1                        _PTM.Bits.PTM1
#define PTM_PTM2                        _PTM.Bits.PTM2
#define PTM_PTM3                        _PTM.Bits.PTM3
#define PTM_PTM4                        _PTM.Bits.PTM4
#define PTM_PTM5                        _PTM.Bits.PTM5
#define PTM_PTM6                        _PTM.Bits.PTM6
#define PTM_PTM7                        _PTM.Bits.PTM7

