gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
#define PTM_PTM0_MASK                   1
#define PTM_PTM1_MASK                   2
#define PTM_PTM2_MASK                   4
#define PTM_PTM3_MASK                   8
#define PTM_PTM4_MASK                   16
#define PTM_PTM5_MASK                   32
#define PTM_PTM6_MASK                   64
#define PTM_PTM7_MASK                   128


 PTIM - Port M Input Register; 0x00000251 
typedef union {
  byte Byte;
  struct {
    byte PTIM0       1;                                        Port M Bit 0 
    byte PTIM1       1;                                        Port M Bit 1 
    byte PTIM2       1;                                        Port M Bit 2 
    byte PTIM3       1;                                        Port M Bit 3 
    byte PTIM4       1;                                        Port M Bit 4 
    byte PTIM5       1;                                        Port M Bit 5 
    byte PTIM6       1;                                        Port M Bit 6 
    byte PTIM7       1;                                        Port M Bit 7 
  } Bits;
} PTIMSTR;
extern volatile PTIMSTR _PTIM @(REG_BASE + 0x00000251);
#define PTIM                            _PTIM.Byte
#define PTIM_PTIM0                      _PTIM.Bits.PTIM0
#define PTIM_PTIM1                      _PTIM.Bits.PTIM1
#define PTIM_PTIM2                      _PTIM.Bits.PTIM2
#define PTIM_PTIM3                      _PTIM.Bits.PTIM3
#define PTIM_PTIM4                      _PTIM.Bits.PTIM4
#define PTIM_PTIM5                      _PTIM.Bits.PTIM5
#define PTIM_PTIM6                      _PTIM.Bits.PTIM6
#define PTIM_PTIM7                      _PTIM.Bits.PTIM7

#define PTIM_PTIM0_MASK                 1
#define PTIM_PTIM1_MASK                 2
#define PTIM_PTIM2_MASK                 4
#define PTIM_PTIM3_MASK                 8
#define PTIM_PTIM4_MASK                 16
#define PTIM_PTIM5_MASK                 32
#define PTIM_PTIM6_MASK                 64
#define PTIM_PTIM7_MASK                 128


 DDRM - Port M Data Direction Register; 0x00000252 
typedef union {
  byte Byte;
  struct {
    byte DDRM0       1;                                        Data Direction Port M Bit 0 
    byte DDRM1       1;                                        Data Direction Port M Bit 1 
    byte DDRM2       1;                                        Data Direction Port M Bit 2 
    byte DDRM3       1;                                        Data Direction Port M Bit 3 
    byte DDRM4       1;                                        Data Direction Port M Bit 4 
    byte DDRM5       1;                                        Data Direction Port M Bit 5 
    byte DDRM6       1;                                        Data Direction Port M Bit 6 
    byte DDRM7       1;                                        Data Direction Port M Bit 7 
  } Bits;
} DDRMSTR;
extern volatile DDRMSTR _DDRM @(REG_BASE + 0x00000252);
#define DDRM                            _DDRM.Byte
#define DDRM_DDRM0                      _DDRM.Bits.DDRM0
#define DDRM_DDRM1                      _DDRM.Bits.DDRM1
#define DDRM_DDRM2                      _DDRM.Bits.DDRM2
#define DDRM_DDRM3                      _DDRM.Bits.DDRM3
#define DDRM_DDRM4                      _DDRM.Bits.DDRM4
#define DDRM_DDRM5                      _DDRM.Bits.DDRM5
#define DDRM_DDRM6                      _DDRM.Bits.DDRM6
#define DDRM_DDRM7                      _DDRM.Bits.DDRM7

#define DDRM_DDRM0_MASK                 1
#define DDRM_DDRM1_MASK                 2
#define DDRM_DDRM2_MASK                 4
#define DDRM_DDRM3_MASK                 8
#define DDRM_DDRM4_MASK                 16
#define DDRM_DDRM5_MASK                 32
#define DDRM_DDRM6_MASK                 64
#define DDRM_DDRM7_MASK                 128


 RDRM - Port M Reduced Drive Register; 0x00000253 
typedef union {
  byte Byte;
  struct {
    byte RDRM0       1;                                        Reduced Drive Port M Bit 0 
    byte RDRM1       1;                                        Reduced Drive Port M Bit 1 
    byte RDRM2       1;                                        Reduced Drive Port M Bit 2 
    byte RDRM3       1;                                        Reduced Drive Port M Bit 3 
    byte RDRM4       1;                                        Reduced Drive Port M Bit 4 
    byte RDRM5       1;                                        Reduced Drive Port M Bit 5 
    byte RDRM6       1;                                        Reduced Drive Port M Bit 6 
    byte RDRM7       1;                                        Reduced Drive Port M Bit 7 
  } Bits;
} RDRMSTR;
extern volatile RDRMSTR _RDRM @(REG_BASE + 0x00000253);
#define RDRM                            _RDRM.Byte
#define RDRM_RDRM0                      _RDRM.Bits.RDRM0
#define RDRM_RDRM1                      _RDRM.Bits.RDRM1
#define RDRM_RDRM2                      _RDRM.Bits.RDRM2
#define RDRM_RDRM3                      _RDRM.Bits.RDRM3
#define RDRM_RDRM4                      _RDRM.Bits.RDRM4
#define RDRM_RDRM5                      _RDRM.Bits.RDRM5
#define RDRM_RDRM6                      _RDRM.Bits.RDRM6
#define RDRM_RDRM7                      _RDRM.Bits.RDRM7

#define RDRM_RDRM0_MASK                 1
#define RDRM_RDRM1_MASK                 2
#define RDRM_RDRM2_MASK                 4
#define RDRM_RDRM3_MASK                 8
#define RDRM_RDRM4_MASK                 16
#define RDRM_RDRM5_MASK                 32
#define RDRM_RDRM6_MASK                 64
#define RDRM_RDRM7_MASK                 128


 PERM - Port M Pull Device Enable Register; 0x00000254 
typedef union {
  byte Byte;
  struct {
    byte PERM0       1;                                        Pull Device Enable Port M Bit 0 
    byte PERM1       1;                                        Pull Device Enable Port M Bit 1 
    byte PERM2       1;                                        Pull Device Enable Port M Bit 2 
    byte PERM3       1;                                        Pull Device Enable Port M Bit 3 
    byte PERM4       1;                                        Pull Device Enable Port M Bit 4 
    byte PERM5       1;                                        Pull Device Enable Port M Bit 5 
    byte PERM6       1;                                        Pull Device Enable Port M Bit 6 
    byte PERM7       1;                                        Pull Device Enable Port M Bit 7 
  } Bits;
} PERMSTR;
extern volatile PERMSTR _PERM @(REG_BASE + 0x00000254);
#define PERM                            _PERM.Byte
#define PERM_PERM0                      _PERM.Bits.PERM0
#define PERM_PERM1                      _PERM.Bits.PERM1
#define PERM_PERM2                      _PERM.Bits.PERM2
#define PERM_PERM3                      _PERM.Bits.PERM3
#define PERM_PERM4                      _PERM.Bits.PERM4
#define PERM_PERM5                      _PERM.Bits.PERM5
#define PERM_PERM6                      _PERM.Bits.PERM6
#define PERM_PERM7                      _PERM.Bits.PERM7

#define PERM_PERM0_MASK                 1
#define PERM_PERM1_MASK                 2
#define PERM_PERM2_MASK                 4
#define PERM_PERM3_MASK                 8
#define PERM_PERM4_MASK                 16
#define PERM_PERM5_MASK                 32
#define PERM_PERM6_MASK                 64
#define PERM_PERM7_MASK                 128


 PPSM - Port M Polarity Select Register; 0x00000255 
typedef union {
  byte Byte;
  struct {
    byte PPSM0       1;                                        Pull Select Port M Bit 0 
    byte PPSM1       1;                                        Pull Select Port M Bit 1 
    byte PPSM2       1;                                        Pull Select Port M Bit 2 
    byte PPSM3       1;                                        Pull Select Port M Bit 3 
    byte PPSM4       1;                                        Pull Select Port M Bit 4 
    byte PPSM5       1;                                        Pull Select Port M Bit 5 
    byte PPSM6       1;                                        Pull Select Port M Bit 6 
    byte PPSM7       1;                                        Pull Select Port M Bit 7 
  } Bits;
} PPSMSTR;
extern volatile PPSMSTR _PPSM @(REG_BASE + 0x00000255);
#define PPSM                            _PPSM.Byte
#define PPSM_PPSM0                      _PPSM.Bits.PPSM0
#define PPSM_PPSM1                      _PPSM.Bits.PPSM1
#define PPSM_PPSM2                      _PPSM.Bits.PPSM2
#define PPSM_PPSM3                      _PPSM.Bits.PPSM3
#define PPSM_PPSM4                      _PPSM.Bits.PPSM4
#define PPSM_PPSM5                      _PPSM.Bits.PPSM5
#define PPSM_PPSM6                      _PPSM.Bits.PPSM6
#define PPSM_PPSM7                      _PPSM.Bits.PPSM7

#define PPSM_PPSM0_MASK                 1
#define PPSM_PPSM1_MASK                 2
#define PPSM_PPSM2_MASK                 4
#define PPSM_PPSM3_MASK                 8
#define PPSM_PPSM4_MASK                 16
#define PPSM_PPSM5_MASK                 32
#define PPSM_PPSM6_MASK                 64
#define PPSM_PPSM7_MASK                 128


