gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
 WOMM - Port M Wired-Or Mode Register; 0x00000256 
typedef union {
  byte Byte;
  struct {
    byte WOMM0       1;                                        Wired-Or Mode Port M Bit 0 
    byte WOMM1       1;                                        Wired-Or Mode Port M Bit 1 
    byte WOMM2       1;                                        Wired-Or Mode Port M Bit 2 
    byte WOMM3       1;                                        Wired-Or Mode Port M Bit 3 
    byte WOMM4       1;                                        Wired-Or Mode Port M Bit 4 
    byte WOMM5       1;                                        Wired-Or Mode Port M Bit 5 
    byte WOMM6       1;                                        Wired-Or Mode Port M Bit 6 
    byte WOMM7       1;                                        Wired-Or Mode Port M Bit 7 
  } Bits;
} WOMMSTR;
extern volatile WOMMSTR _WOMM @(REG_BASE + 0x00000256);
#define WOMM                            _WOMM.Byte
#define WOMM_WOMM0                      _WOMM.Bits.WOMM0
#define WOMM_WOMM1                      _WOMM.Bits.WOMM1
#define WOMM_WOMM2                      _WOMM.Bits.WOMM2
#define WOMM_WOMM3                      _WOMM.Bits.WOMM3
#define WOMM_WOMM4                      _WOMM.Bits.WOMM4
#define WOMM_WOMM5                      _WOMM.Bits.WOMM5
#define WOMM_WOMM6                      _WOMM.Bits.WOMM6
#define WOMM_WOMM7                      _WOMM.Bits.WOMM7

#define WOMM_WOMM0_MASK                 1
#define WOMM_WOMM1_MASK                 2
#define WOMM_WOMM2_MASK                 4
#define WOMM_WOMM3_MASK                 8
#define WOMM_WOMM4_MASK                 16
#define WOMM_WOMM5_MASK                 32
#define WOMM_WOMM6_MASK                 64
#define WOMM_WOMM7_MASK                 128


 MODRR - Module Routing Register; 0x00000257 
typedef union {
  byte Byte;
  struct {
    byte MODRR0      1;                                        CAN0 Routing Bit 0 
    byte MODRR1      1;                                        CAN0 Routing Bit 1 
    byte MODRR2      1;                                        CAN4 Routing Bit 0 
    byte MODRR3      1;                                        CAN4 Routing Bit 1 
    byte MODRR4      1;                                        SPI0 Routing 
    byte MODRR5      1;                                        SPI1 Routing 
    byte MODRR6      1;                                        SPI2 Routing 
    byte             1; 
  } Bits;
  struct {
    byte grpMODRR 7;
    byte         1;
  } MergedBits;
} MODRRSTR;
extern volatile MODRRSTR _MODRR @(REG_BASE + 0x00000257);
#define MODRR                           _MODRR.Byte
#define MODRR_MODRR0                    _MODRR.Bits.MODRR0
#define MODRR_MODRR1                    _MODRR.Bits.MODRR1
#define MODRR_MODRR2                    _MODRR.Bits.MODRR2
#define MODRR_MODRR3                    _MODRR.Bits.MODRR3
#define MODRR_MODRR4                    _MODRR.Bits.MODRR4
#define MODRR_MODRR5                    _MODRR.Bits.MODRR5
#define MODRR_MODRR6                    _MODRR.Bits.MODRR6
#define MODRR_MODRR                     _MODRR.MergedBits.grpMODRR

#define MODRR_MODRR0_MASK               1
#define MODRR_MODRR1_MASK               2
#define MODRR_MODRR2_MASK               4
#define MODRR_MODRR3_MASK               8
#define MODRR_MODRR4_MASK               16
#define MODRR_MODRR5_MASK               32
#define MODRR_MODRR6_MASK               64
#define MODRR_MODRR_MASK                127
#define MODRR_MODRR_BITNUM              0


 PTP - Port P IO Register; 0x00000258 
typedef union {
  byte Byte;
  struct {
    byte PTP0        1;                                        Port P Bit 0 
    byte PTP1        1;                                        Port P Bit 1 
    byte PTP2        1;                                        Port P Bit 2 
    byte PTP3        1;                                        Port P Bit 3 
    byte PTP4        1;                                        Port P Bit 4 
    byte PTP5        1;                                        Port P Bit 5 
    byte PTP6        1;                                        Port P Bit 6 
    byte PTP7        1;                                        Port P Bit 7 
  } Bits;
} PTPSTR;
extern volatile PTPSTR _PTP @(REG_BASE + 0x00000258);
#define PTP                             _PTP.Byte
#define PTP_PTP0                        _PTP.Bits.PTP0
#define PTP_PTP1                        _PTP.Bits.PTP1
#define PTP_PTP2                        _PTP.Bits.PTP2
#define PTP_PTP3                        _PTP.Bits.PTP3
#define PTP_PTP4                        _PTP.Bits.PTP4
#define PTP_PTP5                        _PTP.Bits.PTP5
#define PTP_PTP6                        _PTP.Bits.PTP6
#define PTP_PTP7                        _PTP.Bits.PTP7

#define PTP_PTP0_MASK                   1
#define PTP_PTP1_MASK                   2
#define PTP_PTP2_MASK                   4
#define PTP_PTP3_MASK                   8
#define PTP_PTP4_MASK                   16
#define PTP_PTP5_MASK                   32
#define PTP_PTP6_MASK                   64
#define PTP_PTP7_MASK                   128


 PTIP - Port P Input Register; 0x00000259 
typedef union {
  byte Byte;
  struct {
    byte PTIP0       1;                                        Port P Bit 0 
    byte PTIP1       1;                                        Port P Bit 1 
    byte PTIP2       1;                                        Port P Bit 2 
    byte PTIP3       1;                                        Port P Bit 3 
    byte PTIP4       1;                                        Port P Bit 4 
    byte PTIP5       1;                                        Port P Bit 5 
    byte PTIP6       1;                                        Port P Bit 6 
    byte PTIP7       1;                                        Port P Bit 7 
  } Bits;
} PTIPSTR;
extern volatile PTIPSTR _PTIP @(REG_BASE + 0x00000259);
#define PTIP                            _PTIP.Byte
#define PTIP_PTIP0                      _PTIP.Bits.PTIP0
#define PTIP_PTIP1                      _PTIP.Bits.PTIP1
#define PTIP_PTIP2                      _PTIP.Bits.PTIP2
#define PTIP_PTIP3                      _PTIP.Bits.PTIP3
#define PTIP_PTIP4                      _PTIP.Bits.PTIP4
#define PTIP_PTIP5                      _PTIP.Bits.PTIP5
#define PTIP_PTIP6                      _PTIP.Bits.PTIP6
#define PTIP_PTIP7                      _PTIP.Bits.PTIP7

#define PTIP_PTIP0_MASK                 1
#define PTIP_PTIP1_MASK                 2
#define PTIP_PTIP2_MASK                 4
#define PTIP_PTIP3_MASK                 8
#define PTIP_PTIP4_MASK                 16
#define PTIP_PTIP5_MASK                 32
#define PTIP_PTIP6_MASK                 64
#define PTIP_PTIP7_MASK                 128


 DDRP - Port P Data Direction Register; 0x0000025A 
typedef union {
  byte Byte;
  struct {
    byte DDRP0       1;                                        Data Direction Port P Bit 0 
    byte DDRP1       1;                                        Data Direction Port P Bit 1 
    byte DDRP2       1;                                        Data Direction Port P Bit 2 
    byte DDRP3       1;                                        Data Direction Port P Bit 3 
    byte DDRP4       1;                                        Data Direction Port P Bit 4 
    byte DDRP5       1;                                        Data Direction Port P Bit 5 
    byte DDRP6       1;                                        Data Direction Port P Bit 6 
    byte DDRP7       1;                                        Data Direction Port P Bit 7 
  } Bits;
} DDRPSTR;
