gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
extern volatile DDRPSTR _DDRP @(REG_BASE + 0x0000025A);
#define DDRP                            _DDRP.Byte
#define DDRP_DDRP0                      _DDRP.Bits.DDRP0
#define DDRP_DDRP1                      _DDRP.Bits.DDRP1
#define DDRP_DDRP2                      _DDRP.Bits.DDRP2
#define DDRP_DDRP3                      _DDRP.Bits.DDRP3
#define DDRP_DDRP4                      _DDRP.Bits.DDRP4
#define DDRP_DDRP5                      _DDRP.Bits.DDRP5
#define DDRP_DDRP6                      _DDRP.Bits.DDRP6
#define DDRP_DDRP7                      _DDRP.Bits.DDRP7

#define DDRP_DDRP0_MASK                 1
#define DDRP_DDRP1_MASK                 2
#define DDRP_DDRP2_MASK                 4
#define DDRP_DDRP3_MASK                 8
#define DDRP_DDRP4_MASK                 16
#define DDRP_DDRP5_MASK                 32
#define DDRP_DDRP6_MASK                 64
#define DDRP_DDRP7_MASK                 128


 RDRP - Port P Reduced Drive Register; 0x0000025B 
typedef union {
  byte Byte;
  struct {
    byte RDRP0       1;                                        Reduced Drive Port P Bit 0 
    byte RDRP1       1;                                        Reduced Drive Port P Bit 1 
    byte RDRP2       1;                                        Reduced Drive Port P Bit 2 
    byte RDRP3       1;                                        Reduced Drive Port P Bit 3 
    byte RDRP4       1;                                        Reduced Drive Port P Bit 4 
    byte RDRP5       1;                                        Reduced Drive Port P Bit 5 
    byte RDRP6       1;                                        Reduced Drive Port P Bit 6 
    byte RDRP7       1;                                        Reduced Drive Port P Bit 7 
  } Bits;
} RDRPSTR;
extern volatile RDRPSTR _RDRP @(REG_BASE + 0x0000025B);
#define RDRP                            _RDRP.Byte
#define RDRP_RDRP0                      _RDRP.Bits.RDRP0
#define RDRP_RDRP1                      _RDRP.Bits.RDRP1
#define RDRP_RDRP2                      _RDRP.Bits.RDRP2
#define RDRP_RDRP3                      _RDRP.Bits.RDRP3
#define RDRP_RDRP4                      _RDRP.Bits.RDRP4
#define RDRP_RDRP5                      _RDRP.Bits.RDRP5
#define RDRP_RDRP6                      _RDRP.Bits.RDRP6
#define RDRP_RDRP7                      _RDRP.Bits.RDRP7

#define RDRP_RDRP0_MASK                 1
#define RDRP_RDRP1_MASK                 2
#define RDRP_RDRP2_MASK                 4
#define RDRP_RDRP3_MASK                 8
#define RDRP_RDRP4_MASK                 16
#define RDRP_RDRP5_MASK                 32
#define RDRP_RDRP6_MASK                 64
#define RDRP_RDRP7_MASK                 128


 PERP - Port P Pull Device Enable Register; 0x0000025C 
typedef union {
  byte Byte;
  struct {
    byte PERP0       1;                                        Pull Device Enable Port P Bit 0 
    byte PERP1       1;                                        Pull Device Enable Port P Bit 1 
    byte PERP2       1;                                        Pull Device Enable Port P Bit 2 
    byte PERP3       1;                                        Pull Device Enable Port P Bit 3 
    byte PERP4       1;                                        Pull Device Enable Port P Bit 4 
    byte PERP5       1;                                        Pull Device Enable Port P Bit 5 
    byte PERP6       1;                                        Pull Device Enable Port P Bit 6 
    byte PERP7       1;                                        Pull Device Enable Port P Bit 7 
  } Bits;
} PERPSTR;
extern volatile PERPSTR _PERP @(REG_BASE + 0x0000025C);
#define PERP                            _PERP.Byte
#define PERP_PERP0                      _PERP.Bits.PERP0
#define PERP_PERP1                      _PERP.Bits.PERP1
#define PERP_PERP2                      _PERP.Bits.PERP2
#define PERP_PERP3                      _PERP.Bits.PERP3
#define PERP_PERP4                      _PERP.Bits.PERP4
#define PERP_PERP5                      _PERP.Bits.PERP5
#define PERP_PERP6                      _PERP.Bits.PERP6
#define PERP_PERP7                      _PERP.Bits.PERP7

#define PERP_PERP0_MASK                 1
#define PERP_PERP1_MASK                 2
#define PERP_PERP2_MASK                 4
#define PERP_PERP3_MASK                 8
#define PERP_PERP4_MASK                 16
#define PERP_PERP5_MASK                 32
#define PERP_PERP6_MASK                 64
#define PERP_PERP7_MASK                 128


 PPSP - Port P Polarity Select Register; 0x0000025D 
typedef union {
  byte Byte;
  struct {
    byte PPSP0       1;                                        Pull Select Port P Bit 0 
    byte PPSP1       1;                                        Pull Select Port P Bit 1 
    byte PPSP2       1;                                        Pull Select Port P Bit 2 
    byte PPSP3       1;                                        Pull Select Port P Bit 3 
    byte PPSP4       1;                                        Pull Select Port P Bit 4 
    byte PPSP5       1;                                        Pull Select Port P Bit 5 
    byte PPSP6       1;                                        Pull Select Port P Bit 6 
    byte PPSP7       1;                                        Pull Select Port P Bit 7 
  } Bits;
} PPSPSTR;
extern volatile PPSPSTR _PPSP @(REG_BASE + 0x0000025D);
#define PPSP                            _PPSP.Byte
#define PPSP_PPSP0                      _PPSP.Bits.PPSP0
#define PPSP_PPSP1                      _PPSP.Bits.PPSP1
#define PPSP_PPSP2                      _PPSP.Bits.PPSP2
#define PPSP_PPSP3                      _PPSP.Bits.PPSP3
#define PPSP_PPSP4                      _PPSP.Bits.PPSP4
#define PPSP_PPSP5                      _PPSP.Bits.PPSP5
#define PPSP_PPSP6                      _PPSP.Bits.PPSP6
#define PPSP_PPSP7                      _PPSP.Bits.PPSP7

#define PPSP_PPSP0_MASK                 1
#define PPSP_PPSP1_MASK                 2
#define PPSP_PPSP2_MASK                 4
#define PPSP_PPSP3_MASK                 8
#define PPSP_PPSP4_MASK                 16
#define PPSP_PPSP5_MASK                 32
#define PPSP_PPSP6_MASK                 64
#define PPSP_PPSP7_MASK                 128


 PIEP - Port P Interrupt Enable Register; 0x0000025E 
typedef union {
  byte Byte;
  struct {
    byte PIEP0       1;                                        Interrupt Enable Port P Bit 0 
    byte PIEP1       1;                                        Interrupt Enable Port P Bit 1 
    byte PIEP2       1;                                        Interrupt Enable Port P Bit 2 
    byte PIEP3       1;                                        Interrupt Enable Port P Bit 3 
    byte PIEP4       1;                                        Interrupt Enable Port P Bit 4 
    byte PIEP5       1;                                        Interrupt Enable Port P Bit 5 
    byte PIEP6       1;                                        Interrupt Enable Port P Bit 6 
    byte PIEP7       1;                                        Interrupt Enable Port P Bit 7 
  } Bits;
} PIEPSTR;
