gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
extern volatile PIEPSTR _PIEP @(REG_BASE + 0x0000025E);
#define PIEP                            _PIEP.Byte
#define PIEP_PIEP0                      _PIEP.Bits.PIEP0
#define PIEP_PIEP1                      _PIEP.Bits.PIEP1
#define PIEP_PIEP2                      _PIEP.Bits.PIEP2
#define PIEP_PIEP3                      _PIEP.Bits.PIEP3
#define PIEP_PIEP4                      _PIEP.Bits.PIEP4
#define PIEP_PIEP5                      _PIEP.Bits.PIEP5
#define PIEP_PIEP6                      _PIEP.Bits.PIEP6
#define PIEP_PIEP7                      _PIEP.Bits.PIEP7

#define PIEP_PIEP0_MASK                 1
#define PIEP_PIEP1_MASK                 2
#define PIEP_PIEP2_MASK                 4
#define PIEP_PIEP3_MASK                 8
#define PIEP_PIEP4_MASK                 16
#define PIEP_PIEP5_MASK                 32
#define PIEP_PIEP6_MASK                 64
#define PIEP_PIEP7_MASK                 128


 PIFP - Port P Interrupt Flag Register; 0x0000025F 
typedef union {
  byte Byte;
  struct {
    byte PIFP0       1;                                        Interrupt Flags Port P Bit 0 
    byte PIFP1       1;                                        Interrupt Flags Port P Bit 1 
    byte PIFP2       1;                                        Interrupt Flags Port P Bit 2 
    byte PIFP3       1;                                        Interrupt Flags Port P Bit 3 
    byte PIFP4       1;                                        Interrupt Flags Port P Bit 4 
    byte PIFP5       1;                                        Interrupt Flags Port P Bit 5 
    byte PIFP6       1;                                        Interrupt Flags Port P Bit 6 
    byte PIFP7       1;                                        Interrupt Flags Port P Bit 7 
  } Bits;
} PIFPSTR;
extern volatile PIFPSTR _PIFP @(REG_BASE + 0x0000025F);
#define PIFP                            _PIFP.Byte
#define PIFP_PIFP0                      _PIFP.Bits.PIFP0
#define PIFP_PIFP1                      _PIFP.Bits.PIFP1
#define PIFP_PIFP2                      _PIFP.Bits.PIFP2
#define PIFP_PIFP3                      _PIFP.Bits.PIFP3
#define PIFP_PIFP4                      _PIFP.Bits.PIFP4
#define PIFP_PIFP5                      _PIFP.Bits.PIFP5
#define PIFP_PIFP6                      _PIFP.Bits.PIFP6
#define PIFP_PIFP7                      _PIFP.Bits.PIFP7

#define PIFP_PIFP0_MASK                 1
#define PIFP_PIFP1_MASK                 2
#define PIFP_PIFP2_MASK                 4
#define PIFP_PIFP3_MASK                 8
#define PIFP_PIFP4_MASK                 16
#define PIFP_PIFP5_MASK                 32
#define PIFP_PIFP6_MASK                 64
#define PIFP_PIFP7_MASK                 128


 PTH - Port H IO Register; 0x00000260 
typedef union {
  byte Byte;
  struct {
    byte PTH0        1;                                        Port H Bit 0 
    byte PTH1        1;                                        Port H Bit 1 
    byte PTH2        1;                                        Port H Bit 2 
    byte PTH3        1;                                        Port H Bit 3 
    byte PTH4        1;                                        Port H Bit 4 
    byte PTH5        1;                                        Port H Bit 5 
    byte PTH6        1;                                        Port H Bit 6 
    byte PTH7        1;                                        Port H Bit 7 
  } Bits;
} PTHSTR;
extern volatile PTHSTR _PTH @(REG_BASE + 0x00000260);
#define PTH                             _PTH.Byte
#define PTH_PTH0                        _PTH.Bits.PTH0
#define PTH_PTH1                        _PTH.Bits.PTH1
#define PTH_PTH2                        _PTH.Bits.PTH2
#define PTH_PTH3                        _PTH.Bits.PTH3
#define PTH_PTH4                        _PTH.Bits.PTH4
#define PTH_PTH5                        _PTH.Bits.PTH5
#define PTH_PTH6                        _PTH.Bits.PTH6
#define PTH_PTH7                        _PTH.Bits.PTH7

#define PTH_PTH0_MASK                   1
#define PTH_PTH1_MASK                   2
#define PTH_PTH2_MASK                   4
#define PTH_PTH3_MASK                   8
#define PTH_PTH4_MASK                   16
#define PTH_PTH5_MASK                   32
#define PTH_PTH6_MASK                   64
#define PTH_PTH7_MASK                   128


 PTIH - Port H Input Register; 0x00000261 
typedef union {
  byte Byte;
  struct {
    byte PTIH0       1;                                        Port H Bit 0 
    byte PTIH1       1;                                        Port H Bit 1 
    byte PTIH2       1;                                        Port H Bit 2 
    byte PTIH3       1;                                        Port H Bit 3 
    byte PTIH4       1;                                        Port H Bit 4 
    byte PTIH5       1;                                        Port H Bit 5 
    byte PTIH6       1;                                        Port H Bit 6 
    byte PTIH7       1;                                        Port H Bit 7 
  } Bits;
} PTIHSTR;
extern volatile PTIHSTR _PTIH @(REG_BASE + 0x00000261);
#define PTIH                            _PTIH.Byte
#define PTIH_PTIH0                      _PTIH.Bits.PTIH0
#define PTIH_PTIH1                      _PTIH.Bits.PTIH1
#define PTIH_PTIH2                      _PTIH.Bits.PTIH2
#define PTIH_PTIH3                      _PTIH.Bits.PTIH3
#define PTIH_PTIH4                      _PTIH.Bits.PTIH4
#define PTIH_PTIH5                      _PTIH.Bits.PTIH5
#define PTIH_PTIH6                      _PTIH.Bits.PTIH6
#define PTIH_PTIH7                      _PTIH.Bits.PTIH7

#define PTIH_PTIH0_MASK                 1
#define PTIH_PTIH1_MASK                 2
#define PTIH_PTIH2_MASK                 4
#define PTIH_PTIH3_MASK                 8
#define PTIH_PTIH4_MASK                 16
#define PTIH_PTIH5_MASK                 32
#define PTIH_PTIH6_MASK                 64
#define PTIH_PTIH7_MASK                 128


 DDRH - Port H Data Direction Register; 0x00000262 
typedef union {
  byte Byte;
  struct {
    byte DDRH0       1;                                        Data Direction Port H Bit 0 
    byte DDRH1       1;                                        Data Direction Port H Bit 1 
    byte DDRH2       1;                                        Data Direction Port H Bit 2 
    byte DDRH3       1;                                        Data Direction Port H Bit 3 
    byte DDRH4       1;                                        Data Direction Port H Bit 4 
    byte DDRH5       1;                                        Data Direction Port H Bit 5 
    byte DDRH6       1;                                        Data Direction Port H Bit 6 
    byte DDRH7       1;                                        Data Direction Port H Bit 7 
  } Bits;
} DDRHSTR;
extern volatile DDRHSTR _DDRH @(REG_BASE + 0x00000262);
#define DDRH                            _DDRH.Byte
#define DDRH_DDRH0                      _DDRH.Bits.DDRH0
#define DDRH_DDRH1                      _DDRH.Bits.DDRH1
#define DDRH_DDRH2                      _DDRH.Bits.DDRH2
#define DDRH_DDRH3                      _DDRH.Bits.DDRH3
#define DDRH_DDRH4                      _DDRH.Bits.DDRH4
#define DDRH_DDRH5                      _DDRH.Bits.DDRH5
#define DDRH_DDRH6                      _DDRH.Bits.DDRH6
#define DDRH_DDRH7                      _DDRH.Bits.DDRH7

#define DDRH_DDRH0_MASK                 1
#define DDRH_DDRH1_MASK                 2
#define DDRH_DDRH2_MASK                 4
#define DDRH_DDRH3_MASK                 8
#define DDRH_DDRH4_MASK                 16
#define DDRH_DDRH5_MASK                 32
#define DDRH_DDRH6_MASK                 64
#define DDRH_DDRH7_MASK                 128


 RDRH - Port H Reduced Drive Register; 0x00000263 
typedef union {
  byte Byte;
  struct {
    byte RDRH0       1;                                        Reduced Drive Port H Bit 0 
    byte RDRH1       1;                                        Reduced Drive Port H Bit 1 
    byte RDRH2       1;                                        Reduced Drive Port H Bit 2 
    byte RDRH3       1;                                        Reduced Drive Port H Bit 3 
    byte RDRH4       1;                                        Reduced Drive Port H Bit 4 
    byte RDRH5       1;                                        Reduced Drive Port H Bit 5 
    byte RDRH6       1;                                        Reduced Drive Port H Bit 6 
    byte RDRH7       1;                                        Reduced Drive Port H Bit 7 
  } Bits;
} RDRHSTR;
extern volatile RDRHSTR _RDRH @(REG_BASE + 0x00000263);
#define RDRH                            _RDRH.Byte
#define RDRH_RDRH0                      _RDRH.Bits.RDRH0
#define RDRH_RDRH1                      _RDRH.Bits.RDRH1
#define RDRH_RDRH2                      _RDRH.Bits.RDRH2
#define RDRH_RDRH3                      _RDRH.Bits.RDRH3
#define RDRH_RDRH4                      _RDRH.Bits.RDRH4
#define RDRH_RDRH5                      _RDRH.Bits.RDRH5
#define RDRH_RDRH6                      _RDRH.Bits.RDRH6
#define RDRH_RDRH7                      _RDRH.Bits.RDRH7

#define RDRH_RDRH0_MASK                 1
#define RDRH_RDRH1_MASK                 2
#define RDRH_RDRH2_MASK                 4
#define RDRH_RDRH3_MASK                 8
#define RDRH_RDRH4_MASK                 16
#define RDRH_RDRH5_MASK                 32
#define RDRH_RDRH6_MASK                 64
#define RDRH_RDRH7_MASK                 128


 PERH - Port H Pull Device Enable Register; 0x00000264 
typedef union {
  byte Byte;
  struct {
    byte PERH0       1;                                        Pull Device Enable Port H Bit 0 
    byte PERH1       1;                                        Pull Device Enable Port H Bit 1 
    byte PERH2       1;                                        Pull Device Enable Port H Bit 2 
    byte PERH3       1;                                        Pull Device Enable Port H Bit 3 
    byte PERH4       1;                                        Pull Device Enable Port H Bit 4 
    byte PERH5       1;                                        Pull Device Enable Port H Bit 5 
    byte PERH6       1;                                        Pull Device Enable Port H Bit 6 
    byte PERH7       1;                                        Pull Device Enable Port H Bit 7 
  } Bits;
} PERHSTR;
extern volatile PERHSTR _PERH @(REG_BASE + 0x00000264);
#define PERH                            _PERH.Byte
#define PERH_PERH0                      _PERH.Bits.PERH0
#define PERH_PERH1                      _PERH.Bits.PERH1
#define PERH_PERH2                      _PERH.Bits.PERH2
#define PERH_PERH3                      _PERH.Bits.PERH3
#define PERH_PERH4                      _PERH.Bits.PERH4
#define PERH_PERH5                      _PERH.Bits.PERH5
#define PERH_PERH6                      _PERH.Bits.PERH6
#define PERH_PERH7                      _PERH.Bits.PERH7

