gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
#define PERH_PERH0_MASK                 1
#define PERH_PERH1_MASK                 2
#define PERH_PERH2_MASK                 4
#define PERH_PERH3_MASK                 8
#define PERH_PERH4_MASK                 16
#define PERH_PERH5_MASK                 32
#define PERH_PERH6_MASK                 64
#define PERH_PERH7_MASK                 128


 PPSH - Port H Polarity Select Register; 0x00000265 
typedef union {
  byte Byte;
  struct {
    byte PPSH0       1;                                        Pull Select Port H Bit 0 
    byte PPSH1       1;                                        Pull Select Port H Bit 1 
    byte PPSH2       1;                                        Pull Select Port H Bit 2 
    byte PPSH3       1;                                        Pull Select Port H Bit 3 
    byte PPSH4       1;                                        Pull Select Port H Bit 4 
    byte PPSH5       1;                                        Pull Select Port H Bit 5 
    byte PPSH6       1;                                        Pull Select Port H Bit 6 
    byte PPSH7       1;                                        Pull Select Port H Bit 7 
  } Bits;
} PPSHSTR;
extern volatile PPSHSTR _PPSH @(REG_BASE + 0x00000265);
#define PPSH                            _PPSH.Byte
#define PPSH_PPSH0                      _PPSH.Bits.PPSH0
#define PPSH_PPSH1                      _PPSH.Bits.PPSH1
#define PPSH_PPSH2                      _PPSH.Bits.PPSH2
#define PPSH_PPSH3                      _PPSH.Bits.PPSH3
#define PPSH_PPSH4                      _PPSH.Bits.PPSH4
#define PPSH_PPSH5                      _PPSH.Bits.PPSH5
#define PPSH_PPSH6                      _PPSH.Bits.PPSH6
#define PPSH_PPSH7                      _PPSH.Bits.PPSH7

#define PPSH_PPSH0_MASK                 1
#define PPSH_PPSH1_MASK                 2
#define PPSH_PPSH2_MASK                 4
#define PPSH_PPSH3_MASK                 8
#define PPSH_PPSH4_MASK                 16
#define PPSH_PPSH5_MASK                 32
#define PPSH_PPSH6_MASK                 64
#define PPSH_PPSH7_MASK                 128


 PIEH - Port H Interrupt Enable Register; 0x00000266 
typedef union {
  byte Byte;
  struct {
    byte PIEH0       1;                                        Interrupt Enable Port H Bit 0 
    byte PIEH1       1;                                        Interrupt Enable Port H Bit 1 
    byte PIEH2       1;                                        Interrupt Enable Port H Bit 2 
    byte PIEH3       1;                                        Interrupt Enable Port H Bit 3 
    byte PIEH4       1;                                        Interrupt Enable Port H Bit 4 
    byte PIEH5       1;                                        Interrupt Enable Port H Bit 5 
    byte PIEH6       1;                                        Interrupt Enable Port H Bit 6 
    byte PIEH7       1;                                        Interrupt Enable Port H Bit 7 
  } Bits;
} PIEHSTR;
extern volatile PIEHSTR _PIEH @(REG_BASE + 0x00000266);
#define PIEH                            _PIEH.Byte
#define PIEH_PIEH0                      _PIEH.Bits.PIEH0
#define PIEH_PIEH1                      _PIEH.Bits.PIEH1
#define PIEH_PIEH2                      _PIEH.Bits.PIEH2
#define PIEH_PIEH3                      _PIEH.Bits.PIEH3
#define PIEH_PIEH4                      _PIEH.Bits.PIEH4
#define PIEH_PIEH5                      _PIEH.Bits.PIEH5
#define PIEH_PIEH6                      _PIEH.Bits.PIEH6
#define PIEH_PIEH7                      _PIEH.Bits.PIEH7

#define PIEH_PIEH0_MASK                 1
#define PIEH_PIEH1_MASK                 2
#define PIEH_PIEH2_MASK                 4
#define PIEH_PIEH3_MASK                 8
#define PIEH_PIEH4_MASK                 16
#define PIEH_PIEH5_MASK                 32
#define PIEH_PIEH6_MASK                 64
#define PIEH_PIEH7_MASK                 128


 PIFH - Port H Interrupt Flag Register; 0x00000267 
typedef union {
  byte Byte;
  struct {
    byte PIFH0       1;                                        Interrupt Flags Port H Bit 0 
    byte PIFH1       1;                                        Interrupt Flags Port H Bit 1 
    byte PIFH2       1;                                        Interrupt Flags Port H Bit 2 
    byte PIFH3       1;                                        Interrupt Flags Port H Bit 3 
    byte PIFH4       1;                                        Interrupt Flags Port H Bit 4 
    byte PIFH5       1;                                        Interrupt Flags Port H Bit 5 
    byte PIFH6       1;                                        Interrupt Flags Port H Bit 6 
    byte PIFH7       1;                                        Interrupt Flags Port H Bit 7 
  } Bits;
} PIFHSTR;
extern volatile PIFHSTR _PIFH @(REG_BASE + 0x00000267);
#define PIFH                            _PIFH.Byte
#define PIFH_PIFH0                      _PIFH.Bits.PIFH0
#define PIFH_PIFH1                      _PIFH.Bits.PIFH1
#define PIFH_PIFH2                      _PIFH.Bits.PIFH2
#define PIFH_PIFH3                      _PIFH.Bits.PIFH3
#define PIFH_PIFH4                      _PIFH.Bits.PIFH4
#define PIFH_PIFH5                      _PIFH.Bits.PIFH5
#define PIFH_PIFH6                      _PIFH.Bits.PIFH6
#define PIFH_PIFH7                      _PIFH.Bits.PIFH7

#define PIFH_PIFH0_MASK                 1
#define PIFH_PIFH1_MASK                 2
#define PIFH_PIFH2_MASK                 4
#define PIFH_PIFH3_MASK                 8
#define PIFH_PIFH4_MASK                 16
#define PIFH_PIFH5_MASK                 32
#define PIFH_PIFH6_MASK                 64
#define PIFH_PIFH7_MASK                 128


 PTJ - Port J IO Register; 0x00000268 
typedef union {
  byte Byte;
  struct {
    byte PTJ0        1;                                        Port J Bit 0 
    byte PTJ1        1;                                        Port J Bit 1 
    byte PTJ2        1;                                        Port J Bit 2 
    byte             1; 
    byte PTJ4        1;                                        Port J Bit 4 
    byte PTJ5        1;                                        Port J Bit 5 
    byte PTJ6        1;                                        Port J Bit 6 
    byte PTJ7        1;                                        Port J Bit 7 
  } Bits;
  struct {
    byte grpPTJ  3;
    byte         1;
    byte grpPTJ_4 4;
  } MergedBits;
} PTJSTR;
extern volatile PTJSTR _PTJ @(REG_BASE + 0x00000268);
#define PTJ                             _PTJ.Byte
#define PTJ_PTJ0                        _PTJ.Bits.PTJ0
#define PTJ_PTJ1                        _PTJ.Bits.PTJ1
#define PTJ_PTJ2                        _PTJ.Bits.PTJ2
#define PTJ_PTJ4                        _PTJ.Bits.PTJ4
#define PTJ_PTJ5                        _PTJ.Bits.PTJ5
#define PTJ_PTJ6                        _PTJ.Bits.PTJ6
#define PTJ_PTJ7                        _PTJ.Bits.PTJ7
#define PTJ_PTJ                         _PTJ.MergedBits.grpPTJ
#define PTJ_PTJ_4                       _PTJ.MergedBits.grpPTJ_4

#define PTJ_PTJ0_MASK                   1
#define PTJ_PTJ1_MASK                   2
#define PTJ_PTJ2_MASK                   4
#define PTJ_PTJ4_MASK                   16
#define PTJ_PTJ5_MASK                   32
#define PTJ_PTJ6_MASK                   64
#define PTJ_PTJ7_MASK                   128
#define PTJ_PTJ_MASK                    7
#define PTJ_PTJ_BITNUM                  0
#define PTJ_PTJ_4_MASK                  240
#define PTJ_PTJ_4_BITNUM                4


 PTIJ - Port J Input Register; 0x00000269 
typedef union {
  byte Byte;
  struct {
    byte PTIJ0       1;                                        Port J Bit 0 
    byte PTIJ1       1;                                        Port J Bit 1 
    byte PTIJ2       1;                                        Port J Bit 2 
    byte             1; 
    byte PTIJ4       1;                                        Port J Bit 4 
    byte PTIJ5       1;                                        Port J Bit 5 
    byte PTIJ6       1;                                        Port J Bit 6 
    byte PTIJ7       1;                                        Port J Bit 7 
  } Bits;
  struct {
    byte grpPTIJ 3;
    byte         1;
    byte grpPTIJ_4 4;
  } MergedBits;
} PTIJSTR;
extern volatile PTIJSTR _PTIJ @(REG_BASE + 0x00000269);
#define PTIJ                            _PTIJ.Byte
#define PTIJ_PTIJ0                      _PTIJ.Bits.PTIJ0
#define PTIJ_PTIJ1                      _PTIJ.Bits.PTIJ1
#define PTIJ_PTIJ2                      _PTIJ.Bits.PTIJ2
#define PTIJ_PTIJ4                      _PTIJ.Bits.PTIJ4
#define PTIJ_PTIJ5                      _PTIJ.Bits.PTIJ5
#define PTIJ_PTIJ6                      _PTIJ.Bits.PTIJ6
#define PTIJ_PTIJ7                      _PTIJ.Bits.PTIJ7
#define PTIJ_PTIJ                       _PTIJ.MergedBits.grpPTIJ
#define PTIJ_PTIJ_4                     _PTIJ.MergedBits.grpPTIJ_4

#define PTIJ_PTIJ0_MASK                 1
#define PTIJ_PTIJ1_MASK                 2
#define PTIJ_PTIJ2_MASK                 4
#define PTIJ_PTIJ4_MASK                 16
#define PTIJ_PTIJ5_MASK                 32
#define PTIJ_PTIJ6_MASK                 64
#define PTIJ_PTIJ7_MASK                 128
#define PTIJ_PTIJ_MASK                  7
#define PTIJ_PTIJ_BITNUM                0
#define PTIJ_PTIJ_4_MASK                240
#define PTIJ_PTIJ_4_BITNUM              4


 DDRJ - Port J Data Direction Register; 0x0000026A 
typedef union {
  byte Byte;
  struct {
    byte DDRJ0       1;                                        Data Direction Port J Bit 0 
    byte DDRJ1       1;                                        Data Direction Port J Bit 1 
    byte DDRJ2       1;                                        Data Direction Port J Bit 2 
    byte             1; 
    byte DDRJ4       1;                                        Data Direction Port J Bit 4 
    byte DDRJ5       1;                                        Data Direction Port J Bit 5 
    byte DDRJ6       1;                                        Data Direction Port J Bit 6 
    byte DDRJ7       1;                                        Data Direction Port J Bit 7 
  } Bits;
  struct {
    byte grpDDRJ 3;
    byte         1;
    byte grpDDRJ_4 4;
  } MergedBits;
} DDRJSTR;
extern volatile DDRJSTR _DDRJ @(REG_BASE + 0x0000026A);
#define DDRJ                            _DDRJ.Byte
#define DDRJ_DDRJ0                      _DDRJ.Bits.DDRJ0
#define DDRJ_DDRJ1                      _DDRJ.Bits.DDRJ1
#define DDRJ_DDRJ2                      _DDRJ.Bits.DDRJ2
#define DDRJ_DDRJ4                      _DDRJ.Bits.DDRJ4
#define DDRJ_DDRJ5                      _DDRJ.Bits.DDRJ5
#define DDRJ_DDRJ6                      _DDRJ.Bits.DDRJ6
#define DDRJ_DDRJ7                      _DDRJ.Bits.DDRJ7
#define DDRJ_DDRJ                       _DDRJ.MergedBits.grpDDRJ
#define DDRJ_DDRJ_4                     _DDRJ.MergedBits.grpDDRJ_4

