gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
#define DDRJ_DDRJ0_MASK                 1
#define DDRJ_DDRJ1_MASK                 2
#define DDRJ_DDRJ2_MASK                 4
#define DDRJ_DDRJ4_MASK                 16
#define DDRJ_DDRJ5_MASK                 32
#define DDRJ_DDRJ6_MASK                 64
#define DDRJ_DDRJ7_MASK                 128
#define DDRJ_DDRJ_MASK                  7
#define DDRJ_DDRJ_BITNUM                0
#define DDRJ_DDRJ_4_MASK                240
#define DDRJ_DDRJ_4_BITNUM              4


 RDRJ - Port J Reduced Drive Register; 0x0000026B 
typedef union {
  byte Byte;
  struct {
    byte RDRJ0       1;                                        Reduced Drive Port J Bit 0 
    byte RDRJ1       1;                                        Reduced Drive Port J Bit 1 
    byte RDRJ2       1;                                        Reduced Drive Port J Bit 2 
    byte             1; 
    byte RDRJ4       1;                                        Reduced Drive Port J Bit 4 
    byte RDRJ5       1;                                        Reduced Drive Port J Bit 5 
    byte RDRJ6       1;                                        Reduced Drive Port J Bit 6 
    byte RDRJ7       1;                                        Reduced Drive Port J Bit 7 
  } Bits;
  struct {
    byte grpRDRJ 3;
    byte         1;
    byte grpRDRJ_4 4;
  } MergedBits;
} RDRJSTR;
extern volatile RDRJSTR _RDRJ @(REG_BASE + 0x0000026B);
#define RDRJ                            _RDRJ.Byte
#define RDRJ_RDRJ0                      _RDRJ.Bits.RDRJ0
#define RDRJ_RDRJ1                      _RDRJ.Bits.RDRJ1
#define RDRJ_RDRJ2                      _RDRJ.Bits.RDRJ2
#define RDRJ_RDRJ4                      _RDRJ.Bits.RDRJ4
#define RDRJ_RDRJ5                      _RDRJ.Bits.RDRJ5
#define RDRJ_RDRJ6                      _RDRJ.Bits.RDRJ6
#define RDRJ_RDRJ7                      _RDRJ.Bits.RDRJ7
#define RDRJ_RDRJ                       _RDRJ.MergedBits.grpRDRJ
#define RDRJ_RDRJ_4                     _RDRJ.MergedBits.grpRDRJ_4

#define RDRJ_RDRJ0_MASK                 1
#define RDRJ_RDRJ1_MASK                 2
#define RDRJ_RDRJ2_MASK                 4
#define RDRJ_RDRJ4_MASK                 16
#define RDRJ_RDRJ5_MASK                 32
#define RDRJ_RDRJ6_MASK                 64
#define RDRJ_RDRJ7_MASK                 128
#define RDRJ_RDRJ_MASK                  7
#define RDRJ_RDRJ_BITNUM                0
#define RDRJ_RDRJ_4_MASK                240
#define RDRJ_RDRJ_4_BITNUM              4


 PERJ - Port J Pull Device Enable Register; 0x0000026C 
typedef union {
  byte Byte;
  struct {
    byte PERJ0       1;                                        Pull Device Enable Port J Bit 0 
    byte PERJ1       1;                                        Pull Device Enable Port J Bit 1 
    byte PERJ2       1;                                        Pull Device Enable Port J Bit 2 
    byte             1; 
    byte PERJ4       1;                                        Pull Device Enable Port J Bit 4 
    byte PERJ5       1;                                        Pull Device Enable Port J Bit 5 
    byte PERJ6       1;                                        Pull Device Enable Port J Bit 6 
    byte PERJ7       1;                                        Pull Device Enable Port J Bit 7 
  } Bits;
  struct {
    byte grpPERJ 3;
    byte         1;
    byte grpPERJ_4 4;
  } MergedBits;
} PERJSTR;
extern volatile PERJSTR _PERJ @(REG_BASE + 0x0000026C);
#define PERJ                            _PERJ.Byte
#define PERJ_PERJ0                      _PERJ.Bits.PERJ0
#define PERJ_PERJ1                      _PERJ.Bits.PERJ1
#define PERJ_PERJ2                      _PERJ.Bits.PERJ2
#define PERJ_PERJ4                      _PERJ.Bits.PERJ4
#define PERJ_PERJ5                      _PERJ.Bits.PERJ5
#define PERJ_PERJ6                      _PERJ.Bits.PERJ6
#define PERJ_PERJ7                      _PERJ.Bits.PERJ7
#define PERJ_PERJ                       _PERJ.MergedBits.grpPERJ
#define PERJ_PERJ_4                     _PERJ.MergedBits.grpPERJ_4

#define PERJ_PERJ0_MASK                 1
#define PERJ_PERJ1_MASK                 2
#define PERJ_PERJ2_MASK                 4
#define PERJ_PERJ4_MASK                 16
#define PERJ_PERJ5_MASK                 32
#define PERJ_PERJ6_MASK                 64
#define PERJ_PERJ7_MASK                 128
#define PERJ_PERJ_MASK                  7
#define PERJ_PERJ_BITNUM                0
#define PERJ_PERJ_4_MASK                240
#define PERJ_PERJ_4_BITNUM              4


 PPSJ - Port J Polarity Select Register; 0x0000026D 
typedef union {
  byte Byte;
  struct {
    byte PPSJ0       1;                                        Pull Select Port J Bit 0 
    byte PPSJ1       1;                                        Pull Select Port J Bit 1 
    byte PPSJ2       1;                                        Pull Select Port J Bit 2 
    byte             1; 
    byte PPSJ4       1;                                        Pull Select Port J Bit 4 
    byte PPSJ5       1;                                        Pull Select Port J Bit 5 
    byte PPSJ6       1;                                        Pull Select Port J Bit 6 
    byte PPSJ7       1;                                        Pull Select Port J Bit 7 
  } Bits;
  struct {
    byte grpPPSJ 3;
    byte         1;
    byte grpPPSJ_4 4;
  } MergedBits;
} PPSJSTR;
extern volatile PPSJSTR _PPSJ @(REG_BASE + 0x0000026D);
#define PPSJ                            _PPSJ.Byte
#define PPSJ_PPSJ0                      _PPSJ.Bits.PPSJ0
#define PPSJ_PPSJ1                      _PPSJ.Bits.PPSJ1
#define PPSJ_PPSJ2                      _PPSJ.Bits.PPSJ2
#define PPSJ_PPSJ4                      _PPSJ.Bits.PPSJ4
#define PPSJ_PPSJ5                      _PPSJ.Bits.PPSJ5
#define PPSJ_PPSJ6                      _PPSJ.Bits.PPSJ6
#define PPSJ_PPSJ7                      _PPSJ.Bits.PPSJ7
#define PPSJ_PPSJ                       _PPSJ.MergedBits.grpPPSJ
#define PPSJ_PPSJ_4                     _PPSJ.MergedBits.grpPPSJ_4

#define PPSJ_PPSJ0_MASK                 1
#define PPSJ_PPSJ1_MASK                 2
#define PPSJ_PPSJ2_MASK                 4
#define PPSJ_PPSJ4_MASK                 16
#define PPSJ_PPSJ5_MASK                 32
#define PPSJ_PPSJ6_MASK                 64
#define PPSJ_PPSJ7_MASK                 128
#define PPSJ_PPSJ_MASK                  7
#define PPSJ_PPSJ_BITNUM                0
#define PPSJ_PPSJ_4_MASK                240
#define PPSJ_PPSJ_4_BITNUM              4


 PIEJ - Port J Interrupt Enable Register; 0x0000026E 
typedef union {
  byte Byte;
  struct {
    byte PIEJ0       1;                                        Interrupt Enable Port J Bit 0 
    byte PIEJ1       1;                                        Interrupt Enable Port J Bit 1 
    byte PIEJ2       1;                                        Interrupt Enable Port J Bit 2 
    byte             1; 
    byte PIEJ4       1;                                        Interrupt Enable Port J Bit 4 
    byte PIEJ5       1;                                        Interrupt Enable Port J Bit 5 
    byte PIEJ6       1;                                        Interrupt Enable Port J Bit 6 
    byte PIEJ7       1;                                        Interrupt Enable Port J Bit 7 
  } Bits;
  struct {
    byte grpPIEJ 3;
    byte         1;
    byte grpPIEJ_4 4;
  } MergedBits;
} PIEJSTR;
extern volatile PIEJSTR _PIEJ @(REG_BASE + 0x0000026E);
#define PIEJ                            _PIEJ.Byte
#define PIEJ_PIEJ0                      _PIEJ.Bits.PIEJ0
#define PIEJ_PIEJ1                      _PIEJ.Bits.PIEJ1
#define PIEJ_PIEJ2                      _PIEJ.Bits.PIEJ2
#define PIEJ_PIEJ4                      _PIEJ.Bits.PIEJ4
#define PIEJ_PIEJ5                      _PIEJ.Bits.PIEJ5
#define PIEJ_PIEJ6                      _PIEJ.Bits.PIEJ6
#define PIEJ_PIEJ7                      _PIEJ.Bits.PIEJ7
#define PIEJ_PIEJ                       _PIEJ.MergedBits.grpPIEJ
#define PIEJ_PIEJ_4                     _PIEJ.MergedBits.grpPIEJ_4

#define PIEJ_PIEJ0_MASK                 1
#define PIEJ_PIEJ1_MASK                 2
#define PIEJ_PIEJ2_MASK                 4
#define PIEJ_PIEJ4_MASK                 16
#define PIEJ_PIEJ5_MASK                 32
#define PIEJ_PIEJ6_MASK                 64
#define PIEJ_PIEJ7_MASK                 128
#define PIEJ_PIEJ_MASK                  7
#define PIEJ_PIEJ_BITNUM                0
#define PIEJ_PIEJ_4_MASK                240
#define PIEJ_PIEJ_4_BITNUM              4


 PIFJ - Port J Interrupt Flag Register; 0x0000026F 
typedef union {
  byte Byte;
  struct {
    byte PIFJ0       1;                                        Interrupt Flags Port J Bit 0 
    byte PIFJ1       1;                                        Interrupt Flags Port J Bit 1 
    byte PIFJ2       1;                                        Interrupt Flags Port J Bit 2 
    byte             1; 
    byte PIFJ4       1;                                        Interrupt Flags Port J Bit 4 
    byte PIFJ5       1;                                        Interrupt Flags Port J Bit 5 
    byte PIFJ6       1;                                        Interrupt Flags Port J Bit 6 
    byte PIFJ7       1;                                        Interrupt Flags Port J Bit 7 
  } Bits;
  struct {
    byte grpPIFJ 3;
    byte         1;
    byte grpPIFJ_4 4;
  } MergedBits;
} PIFJSTR;
