gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
#define PER1AD0_PER1AD00_MASK           1
#define PER1AD0_PER1AD01_MASK           2
#define PER1AD0_PER1AD02_MASK           4
#define PER1AD0_PER1AD03_MASK           8
#define PER1AD0_PER1AD04_MASK           16
#define PER1AD0_PER1AD05_MASK           32
#define PER1AD0_PER1AD06_MASK           64
#define PER1AD0_PER1AD07_MASK           128


 PT01AD1 - Port AD1 Data Register; 0x00000278 
typedef union {
  word Word;
    Overlapped registers 
  struct {
     PT0AD1 - Port AD1 Data Register 0; 0x00000278 
    union {
      byte Byte;
      struct {
        byte PT0AD116    1;                                        Port AD1 Data Bit 16 
        byte PT0AD117    1;                                        Port AD1 Data Bit 17 
        byte PT0AD118    1;                                        Port AD1 Data Bit 18 
        byte PT0AD119    1;                                        Port AD1 Data Bit 19 
        byte PT0AD120    1;                                        Port AD1 Data Bit 20 
        byte PT0AD121    1;                                        Port AD1 Data Bit 21 
        byte PT0AD122    1;                                        Port AD1 Data Bit 22 
        byte PT0AD123    1;                                        Port AD1 Data Bit 23 
      } Bits;
    } PT0AD1STR;
    #define PT0AD1                      _PT01AD1.Overlap_STR.PT0AD1STR.Byte
    #define PT0AD1_PT0AD116             _PT01AD1.Overlap_STR.PT0AD1STR.Bits.PT0AD116
    #define PT0AD1_PT0AD117             _PT01AD1.Overlap_STR.PT0AD1STR.Bits.PT0AD117
    #define PT0AD1_PT0AD118             _PT01AD1.Overlap_STR.PT0AD1STR.Bits.PT0AD118
    #define PT0AD1_PT0AD119             _PT01AD1.Overlap_STR.PT0AD1STR.Bits.PT0AD119
    #define PT0AD1_PT0AD120             _PT01AD1.Overlap_STR.PT0AD1STR.Bits.PT0AD120
    #define PT0AD1_PT0AD121             _PT01AD1.Overlap_STR.PT0AD1STR.Bits.PT0AD121
    #define PT0AD1_PT0AD122             _PT01AD1.Overlap_STR.PT0AD1STR.Bits.PT0AD122
    #define PT0AD1_PT0AD123             _PT01AD1.Overlap_STR.PT0AD1STR.Bits.PT0AD123
    
    
    #define PT0AD1_PT0AD116_MASK        1
    #define PT0AD1_PT0AD117_MASK        2
    #define PT0AD1_PT0AD118_MASK        4
    #define PT0AD1_PT0AD119_MASK        8
    #define PT0AD1_PT0AD120_MASK        16
    #define PT0AD1_PT0AD121_MASK        32
    #define PT0AD1_PT0AD122_MASK        64
    #define PT0AD1_PT0AD123_MASK        128


     PT1AD1 - Port AD1 Data Register 1; 0x00000279 
    union {
      byte Byte;
      struct {
        byte PT1AD18     1;                                        Port AD1 Data Bit 8 
        byte PT1AD19     1;                                        Port AD1 Data Bit 9 
        byte PT1AD110    1;                                        Port AD1 Data Bit 10 
        byte PT1AD111    1;                                        Port AD1 Data Bit 11 
        byte PT1AD112    1;                                        Port AD1 Data Bit 12 
        byte PT1AD113    1;                                        Port AD1 Data Bit 13 
        byte PT1AD114    1;                                        Port AD1 Data Bit 14 
        byte PT1AD115    1;                                        Port AD1 Data Bit 15 
      } Bits;
      struct {
        byte grpPT1AD_18 2;
        byte grpPT1AD1_10 6;
      } MergedBits;
    } PT1AD1STR;
    #define PT1AD1                      _PT01AD1.Overlap_STR.PT1AD1STR.Byte
    #define PT1AD1_PT1AD18              _PT01AD1.Overlap_STR.PT1AD1STR.Bits.PT1AD18
    #define PT1AD1_PT1AD19              _PT01AD1.Overlap_STR.PT1AD1STR.Bits.PT1AD19
    #define PT1AD1_PT1AD110             _PT01AD1.Overlap_STR.PT1AD1STR.Bits.PT1AD110
    #define PT1AD1_PT1AD111             _PT01AD1.Overlap_STR.PT1AD1STR.Bits.PT1AD111
    #define PT1AD1_PT1AD112             _PT01AD1.Overlap_STR.PT1AD1STR.Bits.PT1AD112
    #define PT1AD1_PT1AD113             _PT01AD1.Overlap_STR.PT1AD1STR.Bits.PT1AD113
    #define PT1AD1_PT1AD114             _PT01AD1.Overlap_STR.PT1AD1STR.Bits.PT1AD114
    #define PT1AD1_PT1AD115             _PT01AD1.Overlap_STR.PT1AD1STR.Bits.PT1AD115
    
    #define PT1AD1_PT1AD_18             _PT01AD1.Overlap_STR.PT1AD1STR.MergedBits.grpPT1AD_18
    #define PT1AD1_PT1AD1_10            _PT01AD1.Overlap_STR.PT1AD1STR.MergedBits.grpPT1AD1_10
    #define PT1AD1_PT1AD                PT1AD1_PT1AD_18
    
    #define PT1AD1_PT1AD18_MASK         1
    #define PT1AD1_PT1AD19_MASK         2
    #define PT1AD1_PT1AD110_MASK        4
    #define PT1AD1_PT1AD111_MASK        8
    #define PT1AD1_PT1AD112_MASK        16
    #define PT1AD1_PT1AD113_MASK        32
    #define PT1AD1_PT1AD114_MASK        64
    #define PT1AD1_PT1AD115_MASK        128
    #define PT1AD1_PT1AD_18_MASK        3
    #define PT1AD1_PT1AD_18_BITNUM      0
    #define PT1AD1_PT1AD1_10_MASK       252
    #define PT1AD1_PT1AD1_10_BITNUM     2

  } Overlap_STR;

  struct {
    word PT1AD18     1;                                        Port AD1 Data Bit 8 
    word PT1AD19     1;                                        Port AD1 Data Bit 9 
    word PT1AD110    1;                                        Port AD1 Data Bit 10 
    word PT1AD111    1;                                        Port AD1 Data Bit 11 
    word PT1AD112    1;                                        Port AD1 Data Bit 12 
    word PT1AD113    1;                                        Port AD1 Data Bit 13 
    word PT1AD114    1;                                        Port AD1 Data Bit 14 
    word PT1AD115    1;                                        Port AD1 Data Bit 15 
    word PT0AD116    1;                                        Port AD1 Data Bit 16 
    word PT0AD117    1;                                        Port AD1 Data Bit 17 
    word PT0AD118    1;                                        Port AD1 Data Bit 18 
    word PT0AD119    1;                                        Port AD1 Data Bit 19 
    word PT0AD120    1;                                        Port AD1 Data Bit 20 
    word PT0AD121    1;                                        Port AD1 Data Bit 21 
    word PT0AD122    1;                                        Port AD1 Data Bit 22 
    word PT0AD123    1;                                        Port AD1 Data Bit 23 
  } Bits;
  struct {
    word grpPT1AD_18 2;
    word grpPT1AD1_10 6;
    word grpPT0AD1_16 8;
  } MergedBits;
} PT01AD1STR;
