gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
extern volatile PT01AD1STR _PT01AD1 @(REG_BASE + 0x00000278);
#define PT01AD1                         _PT01AD1.Word
#define PT01AD1_PT1AD18                 _PT01AD1.Bits.PT1AD18
#define PT01AD1_PT1AD19                 _PT01AD1.Bits.PT1AD19
#define PT01AD1_PT1AD110                _PT01AD1.Bits.PT1AD110
#define PT01AD1_PT1AD111                _PT01AD1.Bits.PT1AD111
#define PT01AD1_PT1AD112                _PT01AD1.Bits.PT1AD112
#define PT01AD1_PT1AD113                _PT01AD1.Bits.PT1AD113
#define PT01AD1_PT1AD114                _PT01AD1.Bits.PT1AD114
#define PT01AD1_PT1AD115                _PT01AD1.Bits.PT1AD115
#define PT01AD1_PT0AD116                _PT01AD1.Bits.PT0AD116
#define PT01AD1_PT0AD117                _PT01AD1.Bits.PT0AD117
#define PT01AD1_PT0AD118                _PT01AD1.Bits.PT0AD118
#define PT01AD1_PT0AD119                _PT01AD1.Bits.PT0AD119
#define PT01AD1_PT0AD120                _PT01AD1.Bits.PT0AD120
#define PT01AD1_PT0AD121                _PT01AD1.Bits.PT0AD121
#define PT01AD1_PT0AD122                _PT01AD1.Bits.PT0AD122
#define PT01AD1_PT0AD123                _PT01AD1.Bits.PT0AD123
#define PT01AD1_PT1AD_18                _PT01AD1.MergedBits.grpPT1AD_18
#define PT01AD1_PT1AD1_10               _PT01AD1.MergedBits.grpPT1AD1_10
#define PT01AD1_PT0AD1_16               _PT01AD1.MergedBits.grpPT0AD1_16
#define PT01AD1_PT1AD                   PT01AD1_PT1AD_18
#define PT01AD1_PT1AD1                  PT01AD1_PT1AD1_10
#define PT01AD1_PT0AD1                  PT01AD1_PT0AD1_16

#define PT01AD1_PT1AD18_MASK            1
#define PT01AD1_PT1AD19_MASK            2
#define PT01AD1_PT1AD110_MASK           4
#define PT01AD1_PT1AD111_MASK           8
#define PT01AD1_PT1AD112_MASK           16
#define PT01AD1_PT1AD113_MASK           32
#define PT01AD1_PT1AD114_MASK           64
#define PT01AD1_PT1AD115_MASK           128
#define PT01AD1_PT0AD116_MASK           256
#define PT01AD1_PT0AD117_MASK           512
#define PT01AD1_PT0AD118_MASK           1024
#define PT01AD1_PT0AD119_MASK           2048
#define PT01AD1_PT0AD120_MASK           4096
#define PT01AD1_PT0AD121_MASK           8192
#define PT01AD1_PT0AD122_MASK           16384
#define PT01AD1_PT0AD123_MASK           32768
#define PT01AD1_PT1AD_18_MASK           3
#define PT01AD1_PT1AD_18_BITNUM         0
#define PT01AD1_PT1AD1_10_MASK          252
#define PT01AD1_PT1AD1_10_BITNUM        2
#define PT01AD1_PT0AD1_16_MASK          65280
#define PT01AD1_PT0AD1_16_BITNUM        8


 DDR01AD1 - Port AD1 Data Direction Register; 0x0000027A 
typedef union {
  word Word;
    Overlapped registers 
  struct {
     DDR0AD1 - Port AD1 Data Direction Register 0; 0x0000027A 
    union {
      byte Byte;
      struct {
        byte DDR0AD116   1;                                        Port AD1 Data Direction Bit 16 
        byte DDR0AD117   1;                                        Port AD1 Data Direction Bit 17 
        byte DDR0AD118   1;                                        Port AD1 Data Direction Bit 18 
        byte DDR0AD119   1;                                        Port AD1 Data Direction Bit 19 
        byte DDR0AD120   1;                                        Port AD1 Data Direction Bit 20 
        byte DDR0AD121   1;                                        Port AD1 Data Direction Bit 21 
        byte DDR0AD122   1;                                        Port AD1 Data Direction Bit 22 
        byte DDR0AD123   1;                                        Port AD1 Data Direction Bit 23 
      } Bits;
    } DDR0AD1STR;
    #define DDR0AD1                     _DDR01AD1.Overlap_STR.DDR0AD1STR.Byte
    #define DDR0AD1_DDR0AD116           _DDR01AD1.Overlap_STR.DDR0AD1STR.Bits.DDR0AD116
    #define DDR0AD1_DDR0AD117           _DDR01AD1.Overlap_STR.DDR0AD1STR.Bits.DDR0AD117
    #define DDR0AD1_DDR0AD118           _DDR01AD1.Overlap_STR.DDR0AD1STR.Bits.DDR0AD118
    #define DDR0AD1_DDR0AD119           _DDR01AD1.Overlap_STR.DDR0AD1STR.Bits.DDR0AD119
    #define DDR0AD1_DDR0AD120           _DDR01AD1.Overlap_STR.DDR0AD1STR.Bits.DDR0AD120
    #define DDR0AD1_DDR0AD121           _DDR01AD1.Overlap_STR.DDR0AD1STR.Bits.DDR0AD121
    #define DDR0AD1_DDR0AD122           _DDR01AD1.Overlap_STR.DDR0AD1STR.Bits.DDR0AD122
    #define DDR0AD1_DDR0AD123           _DDR01AD1.Overlap_STR.DDR0AD1STR.Bits.DDR0AD123
    
    
    #define DDR0AD1_DDR0AD116_MASK      1
    #define DDR0AD1_DDR0AD117_MASK      2
    #define DDR0AD1_DDR0AD118_MASK      4
    #define DDR0AD1_DDR0AD119_MASK      8
    #define DDR0AD1_DDR0AD120_MASK      16
    #define DDR0AD1_DDR0AD121_MASK      32
    #define DDR0AD1_DDR0AD122_MASK      64
    #define DDR0AD1_DDR0AD123_MASK      128


     DDR1AD1 - Port AD1 Data Direction Register 1; 0x0000027B 
    union {
      byte Byte;
      struct {
        byte DDR1AD18    1;                                        Port AD1 Data Direction Bit 8 
        byte DDR1AD19    1;                                        Port AD1 Data Direction Bit 9 
        byte DDR1AD110   1;                                        Port AD1 Data Direction Bit 10 
        byte DDR1AD111   1;                                        Port AD1 Data Direction Bit 11 
        byte DDR1AD112   1;                                        Port AD1 Data Direction Bit 12 
        byte DDR1AD113   1;                                        Port AD1 Data Direction Bit 13 
        byte DDR1AD114   1;                                        Port AD1 Data Direction Bit 14 
        byte DDR1AD115   1;                                        Port AD1 Data Direction Bit 15 
      } Bits;
      struct {
        byte grpDDR1AD_18 2;
        byte grpDDR1AD1_10 6;
      } MergedBits;
    } DDR1AD1STR;
    #define DDR1AD1                     _DDR01AD1.Overlap_STR.DDR1AD1STR.Byte
    #define DDR1AD1_DDR1AD18            _DDR01AD1.Overlap_STR.DDR1AD1STR.Bits.DDR1AD18
    #define DDR1AD1_DDR1AD19            _DDR01AD1.Overlap_STR.DDR1AD1STR.Bits.DDR1AD19
    #define DDR1AD1_DDR1AD110           _DDR01AD1.Overlap_STR.DDR1AD1STR.Bits.DDR1AD110
    #define DDR1AD1_DDR1AD111           _DDR01AD1.Overlap_STR.DDR1AD1STR.Bits.DDR1AD111
    #define DDR1AD1_DDR1AD112           _DDR01AD1.Overlap_STR.DDR1AD1STR.Bits.DDR1AD112
    #define DDR1AD1_DDR1AD113           _DDR01AD1.Overlap_STR.DDR1AD1STR.Bits.DDR1AD113
    #define DDR1AD1_DDR1AD114           _DDR01AD1.Overlap_STR.DDR1AD1STR.Bits.DDR1AD114
    #define DDR1AD1_DDR1AD115           _DDR01AD1.Overlap_STR.DDR1AD1STR.Bits.DDR1AD115
    
    #define DDR1AD1_DDR1AD_18           _DDR01AD1.Overlap_STR.DDR1AD1STR.MergedBits.grpDDR1AD_18
    #define DDR1AD1_DDR1AD1_10          _DDR01AD1.Overlap_STR.DDR1AD1STR.MergedBits.grpDDR1AD1_10
    #define DDR1AD1_DDR1AD              DDR1AD1_DDR1AD_18
    
    #define DDR1AD1_DDR1AD18_MASK       1
    #define DDR1AD1_DDR1AD19_MASK       2
    #define DDR1AD1_DDR1AD110_MASK      4
    #define DDR1AD1_DDR1AD111_MASK      8
    #define DDR1AD1_DDR1AD112_MASK      16
    #define DDR1AD1_DDR1AD113_MASK      32
    #define DDR1AD1_DDR1AD114_MASK      64
    #define DDR1AD1_DDR1AD115_MASK      128
    #define DDR1AD1_DDR1AD_18_MASK      3
    #define DDR1AD1_DDR1AD_18_BITNUM    0
    #define DDR1AD1_DDR1AD1_10_MASK     252
    #define DDR1AD1_DDR1AD1_10_BITNUM   2

  } Overlap_STR;

