gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
  struct {
    word DDR1AD18    1;                                        Port AD1 Data Direction Bit 8 
    word DDR1AD19    1;                                        Port AD1 Data Direction Bit 9 
    word DDR1AD110   1;                                        Port AD1 Data Direction Bit 10 
    word DDR1AD111   1;                                        Port AD1 Data Direction Bit 11 
    word DDR1AD112   1;                                        Port AD1 Data Direction Bit 12 
    word DDR1AD113   1;                                        Port AD1 Data Direction Bit 13 
    word DDR1AD114   1;                                        Port AD1 Data Direction Bit 14 
    word DDR1AD115   1;                                        Port AD1 Data Direction Bit 15 
    word DDR0AD116   1;                                        Port AD1 Data Direction Bit 16 
    word DDR0AD117   1;                                        Port AD1 Data Direction Bit 17 
    word DDR0AD118   1;                                        Port AD1 Data Direction Bit 18 
    word DDR0AD119   1;                                        Port AD1 Data Direction Bit 19 
    word DDR0AD120   1;                                        Port AD1 Data Direction Bit 20 
    word DDR0AD121   1;                                        Port AD1 Data Direction Bit 21 
    word DDR0AD122   1;                                        Port AD1 Data Direction Bit 22 
    word DDR0AD123   1;                                        Port AD1 Data Direction Bit 23 
  } Bits;
  struct {
    word grpDDR1AD_18 2;
    word grpDDR1AD1_10 6;
    word grpDDR0AD1_16 8;
  } MergedBits;
} DDR01AD1STR;
extern volatile DDR01AD1STR _DDR01AD1 @(REG_BASE + 0x0000027A);
#define DDR01AD1                        _DDR01AD1.Word
#define DDR01AD1_DDR1AD18               _DDR01AD1.Bits.DDR1AD18
#define DDR01AD1_DDR1AD19               _DDR01AD1.Bits.DDR1AD19
#define DDR01AD1_DDR1AD110              _DDR01AD1.Bits.DDR1AD110
#define DDR01AD1_DDR1AD111              _DDR01AD1.Bits.DDR1AD111
#define DDR01AD1_DDR1AD112              _DDR01AD1.Bits.DDR1AD112
#define DDR01AD1_DDR1AD113              _DDR01AD1.Bits.DDR1AD113
#define DDR01AD1_DDR1AD114              _DDR01AD1.Bits.DDR1AD114
#define DDR01AD1_DDR1AD115              _DDR01AD1.Bits.DDR1AD115
#define DDR01AD1_DDR0AD116              _DDR01AD1.Bits.DDR0AD116
#define DDR01AD1_DDR0AD117              _DDR01AD1.Bits.DDR0AD117
#define DDR01AD1_DDR0AD118              _DDR01AD1.Bits.DDR0AD118
#define DDR01AD1_DDR0AD119              _DDR01AD1.Bits.DDR0AD119
#define DDR01AD1_DDR0AD120              _DDR01AD1.Bits.DDR0AD120
#define DDR01AD1_DDR0AD121              _DDR01AD1.Bits.DDR0AD121
#define DDR01AD1_DDR0AD122              _DDR01AD1.Bits.DDR0AD122
#define DDR01AD1_DDR0AD123              _DDR01AD1.Bits.DDR0AD123
#define DDR01AD1_DDR1AD_18              _DDR01AD1.MergedBits.grpDDR1AD_18
#define DDR01AD1_DDR1AD1_10             _DDR01AD1.MergedBits.grpDDR1AD1_10
#define DDR01AD1_DDR0AD1_16             _DDR01AD1.MergedBits.grpDDR0AD1_16
#define DDR01AD1_DDR1AD                 DDR01AD1_DDR1AD_18
#define DDR01AD1_DDR1AD1                DDR01AD1_DDR1AD1_10
#define DDR01AD1_DDR0AD1                DDR01AD1_DDR0AD1_16

#define DDR01AD1_DDR1AD18_MASK          1
#define DDR01AD1_DDR1AD19_MASK          2
#define DDR01AD1_DDR1AD110_MASK         4
#define DDR01AD1_DDR1AD111_MASK         8
#define DDR01AD1_DDR1AD112_MASK         16
#define DDR01AD1_DDR1AD113_MASK         32
#define DDR01AD1_DDR1AD114_MASK         64
#define DDR01AD1_DDR1AD115_MASK         128
#define DDR01AD1_DDR0AD116_MASK         256
#define DDR01AD1_DDR0AD117_MASK         512
#define DDR01AD1_DDR0AD118_MASK         1024
#define DDR01AD1_DDR0AD119_MASK         2048
#define DDR01AD1_DDR0AD120_MASK         4096
#define DDR01AD1_DDR0AD121_MASK         8192
#define DDR01AD1_DDR0AD122_MASK         16384
#define DDR01AD1_DDR0AD123_MASK         32768
#define DDR01AD1_DDR1AD_18_MASK         3
#define DDR01AD1_DDR1AD_18_BITNUM       0
#define DDR01AD1_DDR1AD1_10_MASK        252
#define DDR01AD1_DDR1AD1_10_BITNUM      2
#define DDR01AD1_DDR0AD1_16_MASK        65280
#define DDR01AD1_DDR0AD1_16_BITNUM      8


 RDR01AD1 - Port AD1 Reduced Drive Register; 0x0000027C 
typedef union {
  word Word;
    Overlapped registers 
  struct {
     RDR0AD1 - Port AD1 Reduced Drive Register 0; 0x0000027C 
    union {
      byte Byte;
      struct {
        byte RDR0AD116   1;                                        Port AD1 Reduced Drive Bit 16 
        byte RDR0AD117   1;                                        Port AD1 Reduced Drive Bit 17 
        byte RDR0AD118   1;                                        Port AD1 Reduced Drive Bit 18 
        byte RDR0AD119   1;                                        Port AD1 Reduced Drive Bit 19 
        byte RDR0AD120   1;                                        Port AD1 Reduced Drive Bit 20 
        byte RDR0AD121   1;                                        Port AD1 Reduced Drive Bit 21 
        byte RDR0AD122   1;                                        Port AD1 Reduced Drive Bit 22 
        byte RDR0AD123   1;                                        Port AD1 Reduced Drive Bit 23 
      } Bits;
    } RDR0AD1STR;
    #define RDR0AD1                     _RDR01AD1.Overlap_STR.RDR0AD1STR.Byte
    #define RDR0AD1_RDR0AD116           _RDR01AD1.Overlap_STR.RDR0AD1STR.Bits.RDR0AD116
    #define RDR0AD1_RDR0AD117           _RDR01AD1.Overlap_STR.RDR0AD1STR.Bits.RDR0AD117
    #define RDR0AD1_RDR0AD118           _RDR01AD1.Overlap_STR.RDR0AD1STR.Bits.RDR0AD118
    #define RDR0AD1_RDR0AD119           _RDR01AD1.Overlap_STR.RDR0AD1STR.Bits.RDR0AD119
    #define RDR0AD1_RDR0AD120           _RDR01AD1.Overlap_STR.RDR0AD1STR.Bits.RDR0AD120
    #define RDR0AD1_RDR0AD121           _RDR01AD1.Overlap_STR.RDR0AD1STR.Bits.RDR0AD121
    #define RDR0AD1_RDR0AD122           _RDR01AD1.Overlap_STR.RDR0AD1STR.Bits.RDR0AD122
    #define RDR0AD1_RDR0AD123           _RDR01AD1.Overlap_STR.RDR0AD1STR.Bits.RDR0AD123
    
    
    #define RDR0AD1_RDR0AD116_MASK      1
    #define RDR0AD1_RDR0AD117_MASK      2
    #define RDR0AD1_RDR0AD118_MASK      4
    #define RDR0AD1_RDR0AD119_MASK      8
    #define RDR0AD1_RDR0AD120_MASK      16
    #define RDR0AD1_RDR0AD121_MASK      32
    #define RDR0AD1_RDR0AD122_MASK      64
    #define RDR0AD1_RDR0AD123_MASK      128


