gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
     RDR1AD1 - Port AD1 Reduced Drive Register 1; 0x0000027D 
    union {
      byte Byte;
      struct {
        byte RDR1AD18    1;                                        Port AD1 Reduced Drive Bit 8 
        byte RDR1AD19    1;                                        Port AD1 Reduced Drive Bit 9 
        byte RDR1AD110   1;                                        Port AD1 Reduced Drive Bit 10 
        byte RDR1AD111   1;                                        Port AD1 Reduced Drive Bit 11 
        byte RDR1AD112   1;                                        Port AD1 Reduced Drive Bit 12 
        byte RDR1AD113   1;                                        Port AD1 Reduced Drive Bit 13 
        byte RDR1AD114   1;                                        Port AD1 Reduced Drive Bit 14 
        byte RDR1AD115   1;                                        Port AD1 Reduced Drive Bit 15 
      } Bits;
      struct {
        byte grpRDR1AD_18 2;
        byte grpRDR1AD1_10 6;
      } MergedBits;
    } RDR1AD1STR;
    #define RDR1AD1                     _RDR01AD1.Overlap_STR.RDR1AD1STR.Byte
    #define RDR1AD1_RDR1AD18            _RDR01AD1.Overlap_STR.RDR1AD1STR.Bits.RDR1AD18
    #define RDR1AD1_RDR1AD19            _RDR01AD1.Overlap_STR.RDR1AD1STR.Bits.RDR1AD19
    #define RDR1AD1_RDR1AD110           _RDR01AD1.Overlap_STR.RDR1AD1STR.Bits.RDR1AD110
    #define RDR1AD1_RDR1AD111           _RDR01AD1.Overlap_STR.RDR1AD1STR.Bits.RDR1AD111
    #define RDR1AD1_RDR1AD112           _RDR01AD1.Overlap_STR.RDR1AD1STR.Bits.RDR1AD112
    #define RDR1AD1_RDR1AD113           _RDR01AD1.Overlap_STR.RDR1AD1STR.Bits.RDR1AD113
    #define RDR1AD1_RDR1AD114           _RDR01AD1.Overlap_STR.RDR1AD1STR.Bits.RDR1AD114
    #define RDR1AD1_RDR1AD115           _RDR01AD1.Overlap_STR.RDR1AD1STR.Bits.RDR1AD115
    
    #define RDR1AD1_RDR1AD_18           _RDR01AD1.Overlap_STR.RDR1AD1STR.MergedBits.grpRDR1AD_18
    #define RDR1AD1_RDR1AD1_10          _RDR01AD1.Overlap_STR.RDR1AD1STR.MergedBits.grpRDR1AD1_10
    #define RDR1AD1_RDR1AD              RDR1AD1_RDR1AD_18
    
    #define RDR1AD1_RDR1AD18_MASK       1
    #define RDR1AD1_RDR1AD19_MASK       2
    #define RDR1AD1_RDR1AD110_MASK      4
    #define RDR1AD1_RDR1AD111_MASK      8
    #define RDR1AD1_RDR1AD112_MASK      16
    #define RDR1AD1_RDR1AD113_MASK      32
    #define RDR1AD1_RDR1AD114_MASK      64
    #define RDR1AD1_RDR1AD115_MASK      128
    #define RDR1AD1_RDR1AD_18_MASK      3
    #define RDR1AD1_RDR1AD_18_BITNUM    0
    #define RDR1AD1_RDR1AD1_10_MASK     252
    #define RDR1AD1_RDR1AD1_10_BITNUM   2

  } Overlap_STR;

  struct {
    word RDR1AD18    1;                                        Port AD1 Reduced Drive Bit 8 
    word RDR1AD19    1;                                        Port AD1 Reduced Drive Bit 9 
    word RDR1AD110   1;                                        Port AD1 Reduced Drive Bit 10 
    word RDR1AD111   1;                                        Port AD1 Reduced Drive Bit 11 
    word RDR1AD112   1;                                        Port AD1 Reduced Drive Bit 12 
    word RDR1AD113   1;                                        Port AD1 Reduced Drive Bit 13 
    word RDR1AD114   1;                                        Port AD1 Reduced Drive Bit 14 
    word RDR1AD115   1;                                        Port AD1 Reduced Drive Bit 15 
    word RDR0AD116   1;                                        Port AD1 Reduced Drive Bit 16 
    word RDR0AD117   1;                                        Port AD1 Reduced Drive Bit 17 
    word RDR0AD118   1;                                        Port AD1 Reduced Drive Bit 18 
    word RDR0AD119   1;                                        Port AD1 Reduced Drive Bit 19 
    word RDR0AD120   1;                                        Port AD1 Reduced Drive Bit 20 
    word RDR0AD121   1;                                        Port AD1 Reduced Drive Bit 21 
    word RDR0AD122   1;                                        Port AD1 Reduced Drive Bit 22 
    word RDR0AD123   1;                                        Port AD1 Reduced Drive Bit 23 
  } Bits;
  struct {
    word grpRDR1AD_18 2;
    word grpRDR1AD1_10 6;
    word grpRDR0AD1_16 8;
  } MergedBits;
} RDR01AD1STR;
extern volatile RDR01AD1STR _RDR01AD1 @(REG_BASE + 0x0000027C);
#define RDR01AD1                        _RDR01AD1.Word
#define RDR01AD1_RDR1AD18               _RDR01AD1.Bits.RDR1AD18
#define RDR01AD1_RDR1AD19               _RDR01AD1.Bits.RDR1AD19
#define RDR01AD1_RDR1AD110              _RDR01AD1.Bits.RDR1AD110
#define RDR01AD1_RDR1AD111              _RDR01AD1.Bits.RDR1AD111
#define RDR01AD1_RDR1AD112              _RDR01AD1.Bits.RDR1AD112
#define RDR01AD1_RDR1AD113              _RDR01AD1.Bits.RDR1AD113
#define RDR01AD1_RDR1AD114              _RDR01AD1.Bits.RDR1AD114
#define RDR01AD1_RDR1AD115              _RDR01AD1.Bits.RDR1AD115
#define RDR01AD1_RDR0AD116              _RDR01AD1.Bits.RDR0AD116
#define RDR01AD1_RDR0AD117              _RDR01AD1.Bits.RDR0AD117
#define RDR01AD1_RDR0AD118              _RDR01AD1.Bits.RDR0AD118
#define RDR01AD1_RDR0AD119              _RDR01AD1.Bits.RDR0AD119
#define RDR01AD1_RDR0AD120              _RDR01AD1.Bits.RDR0AD120
#define RDR01AD1_RDR0AD121              _RDR01AD1.Bits.RDR0AD121
#define RDR01AD1_RDR0AD122              _RDR01AD1.Bits.RDR0AD122
#define RDR01AD1_RDR0AD123              _RDR01AD1.Bits.RDR0AD123
#define RDR01AD1_RDR1AD_18              _RDR01AD1.MergedBits.grpRDR1AD_18
#define RDR01AD1_RDR1AD1_10             _RDR01AD1.MergedBits.grpRDR1AD1_10
#define RDR01AD1_RDR0AD1_16             _RDR01AD1.MergedBits.grpRDR0AD1_16
#define RDR01AD1_RDR1AD                 RDR01AD1_RDR1AD_18
#define RDR01AD1_RDR1AD1                RDR01AD1_RDR1AD1_10
#define RDR01AD1_RDR0AD1                RDR01AD1_RDR0AD1_16

#define RDR01AD1_RDR1AD18_MASK          1
#define RDR01AD1_RDR1AD19_MASK          2
#define RDR01AD1_RDR1AD110_MASK         4
#define RDR01AD1_RDR1AD111_MASK         8
#define RDR01AD1_RDR1AD112_MASK         16
#define RDR01AD1_RDR1AD113_MASK         32
#define RDR01AD1_RDR1AD114_MASK         64
#define RDR01AD1_RDR1AD115_MASK         128
#define RDR01AD1_RDR0AD116_MASK         256
#define RDR01AD1_RDR0AD117_MASK         512
#define RDR01AD1_RDR0AD118_MASK         1024
#define RDR01AD1_RDR0AD119_MASK         2048
#define RDR01AD1_RDR0AD120_MASK         4096
#define RDR01AD1_RDR0AD121_MASK         8192
#define RDR01AD1_RDR0AD122_MASK         16384
#define RDR01AD1_RDR0AD123_MASK         32768
#define RDR01AD1_RDR1AD_18_MASK         3
#define RDR01AD1_RDR1AD_18_BITNUM       0
#define RDR01AD1_RDR1AD1_10_MASK        252
#define RDR01AD1_RDR1AD1_10_BITNUM      2
#define RDR01AD1_RDR0AD1_16_MASK        65280
#define RDR01AD1_RDR0AD1_16_BITNUM      8


 PER01AD1 - Port AD1 Pull Up Enable Register; 0x0000027E 
typedef union {
  word Word;
    Overlapped registers 
  struct {
     PER0AD1 - Port AD1 Pull Up Enable Register 0; 0x0000027E 
    union {
      byte Byte;
      struct {
        byte PER0AD116   1;                                        Port AD1 Pull Up Enable Bit 16 
        byte PER0AD117   1;                                        Port AD1 Pull Up Enable Bit 17 
        byte PER0AD118   1;                                        Port AD1 Pull Up Enable Bit 18 
        byte PER0AD119   1;                                        Port AD1 Pull Up Enable Bit 19 
        byte PER0AD120   1;                                        Port AD1 Pull Up Enable Bit 20 
        byte PER0AD121   1;                                        Port AD1 Pull Up Enable Bit 21 
        byte PER0AD122   1;                                        Port AD1 Pull Up Enable Bit 22 
        byte PER0AD123   1;                                        Port AD1 Pull Up Enable Bit 23 
      } Bits;
    } PER0AD1STR;
    #define PER0AD1                     _PER01AD1.Overlap_STR.PER0AD1STR.Byte
    #define PER0AD1_PER0AD116           _PER01AD1.Overlap_STR.PER0AD1STR.Bits.PER0AD116
    #define PER0AD1_PER0AD117           _PER01AD1.Overlap_STR.PER0AD1STR.Bits.PER0AD117
    #define PER0AD1_PER0AD118           _PER01AD1.Overlap_STR.PER0AD1STR.Bits.PER0AD118
    #define PER0AD1_PER0AD119           _PER01AD1.Overlap_STR.PER0AD1STR.Bits.PER0AD119
    #define PER0AD1_PER0AD120           _PER01AD1.Overlap_STR.PER0AD1STR.Bits.PER0AD120
    #define PER0AD1_PER0AD121           _PER01AD1.Overlap_STR.PER0AD1STR.Bits.PER0AD121
    #define PER0AD1_PER0AD122           _PER01AD1.Overlap_STR.PER0AD1STR.Bits.PER0AD122
    #define PER0AD1_PER0AD123           _PER01AD1.Overlap_STR.PER0AD1STR.Bits.PER0AD123
    
    
    #define PER0AD1_PER0AD116_MASK      1
    #define PER0AD1_PER0AD117_MASK      2
    #define PER0AD1_PER0AD118_MASK      4
    #define PER0AD1_PER0AD119_MASK      8
    #define PER0AD1_PER0AD120_MASK      16
    #define PER0AD1_PER0AD121_MASK      32
    #define PER0AD1_PER0AD122_MASK      64
    #define PER0AD1_PER0AD123_MASK      128


     PER1AD1 - Port AD1 Pull Up Enable Register 1; 0x0000027F 
    union {
      byte Byte;
      struct {
        byte PER1AD18    1;                                        Port AD1 Pull Up Enable Bit 8 
        byte PER1AD19    1;                                        Port AD1 Pull Up Enable Bit 9 
        byte PER1AD110   1;                                        Port AD1 Pull Up Enable Bit 10 
        byte PER1AD111   1;                                        Port AD1 Pull Up Enable Bit 11 
        byte PER1AD112   1;                                        Port AD1 Pull Up Enable Bit 12 
        byte PER1AD113   1;                                        Port AD1 Pull Up Enable Bit 13 
        byte PER1AD114   1;                                        Port AD1 Pull Up Enable Bit 14 
        byte PER1AD115   1;                                        Port AD1 Pull Up Enable Bit 15 
      } Bits;
      struct {
        byte grpPER1AD_18 2;
        byte grpPER1AD1_10 6;
      } MergedBits;
    } PER1AD1STR;
    #define PER1AD1                     _PER01AD1.Overlap_STR.PER1AD1STR.Byte
    #define PER1AD1_PER1AD18            _PER01AD1.Overlap_STR.PER1AD1STR.Bits.PER1AD18
    #define PER1AD1_PER1AD19            _PER01AD1.Overlap_STR.PER1AD1STR.Bits.PER1AD19
    #define PER1AD1_PER1AD110           _PER01AD1.Overlap_STR.PER1AD1STR.Bits.PER1AD110
    #define PER1AD1_PER1AD111           _PER01AD1.Overlap_STR.PER1AD1STR.Bits.PER1AD111
    #define PER1AD1_PER1AD112           _PER01AD1.Overlap_STR.PER1AD1STR.Bits.PER1AD112
    #define PER1AD1_PER1AD113           _PER01AD1.Overlap_STR.PER1AD1STR.Bits.PER1AD113
    #define PER1AD1_PER1AD114           _PER01AD1.Overlap_STR.PER1AD1STR.Bits.PER1AD114
    #define PER1AD1_PER1AD115           _PER01AD1.Overlap_STR.PER1AD1STR.Bits.PER1AD115
    
    #define PER1AD1_PER1AD_18           _PER01AD1.Overlap_STR.PER1AD1STR.MergedBits.grpPER1AD_18
    #define PER1AD1_PER1AD1_10          _PER01AD1.Overlap_STR.PER1AD1STR.MergedBits.grpPER1AD1_10
    #define PER1AD1_PER1AD              PER1AD1_PER1AD_18
    
    #define PER1AD1_PER1AD18_MASK       1
    #define PER1AD1_PER1AD19_MASK       2
    #define PER1AD1_PER1AD110_MASK      4
    #define PER1AD1_PER1AD111_MASK      8
    #define PER1AD1_PER1AD112_MASK      16
    #define PER1AD1_PER1AD113_MASK      32
    #define PER1AD1_PER1AD114_MASK      64
    #define PER1AD1_PER1AD115_MASK      128
    #define PER1AD1_PER1AD_18_MASK      3
    #define PER1AD1_PER1AD_18_BITNUM    0
    #define PER1AD1_PER1AD1_10_MASK     252
    #define PER1AD1_PER1AD1_10_BITNUM   2

  } Overlap_STR;

