gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
  struct {
    word PER1AD18    1;                                        Port AD1 Pull Up Enable Bit 8 
    word PER1AD19    1;                                        Port AD1 Pull Up Enable Bit 9 
    word PER1AD110   1;                                        Port AD1 Pull Up Enable Bit 10 
    word PER1AD111   1;                                        Port AD1 Pull Up Enable Bit 11 
    word PER1AD112   1;                                        Port AD1 Pull Up Enable Bit 12 
    word PER1AD113   1;                                        Port AD1 Pull Up Enable Bit 13 
    word PER1AD114   1;                                        Port AD1 Pull Up Enable Bit 14 
    word PER1AD115   1;                                        Port AD1 Pull Up Enable Bit 15 
    word PER0AD116   1;                                        Port AD1 Pull Up Enable Bit 16 
    word PER0AD117   1;                                        Port AD1 Pull Up Enable Bit 17 
    word PER0AD118   1;                                        Port AD1 Pull Up Enable Bit 18 
    word PER0AD119   1;                                        Port AD1 Pull Up Enable Bit 19 
    word PER0AD120   1;                                        Port AD1 Pull Up Enable Bit 20 
    word PER0AD121   1;                                        Port AD1 Pull Up Enable Bit 21 
    word PER0AD122   1;                                        Port AD1 Pull Up Enable Bit 22 
    word PER0AD123   1;                                        Port AD1 Pull Up Enable Bit 23 
  } Bits;
  struct {
    word grpPER1AD_18 2;
    word grpPER1AD1_10 6;
    word grpPER0AD1_16 8;
  } MergedBits;
} PER01AD1STR;
extern volatile PER01AD1STR _PER01AD1 @(REG_BASE + 0x0000027E);
#define PER01AD1                        _PER01AD1.Word
#define PER01AD1_PER1AD18               _PER01AD1.Bits.PER1AD18
#define PER01AD1_PER1AD19               _PER01AD1.Bits.PER1AD19
#define PER01AD1_PER1AD110              _PER01AD1.Bits.PER1AD110
#define PER01AD1_PER1AD111              _PER01AD1.Bits.PER1AD111
#define PER01AD1_PER1AD112              _PER01AD1.Bits.PER1AD112
#define PER01AD1_PER1AD113              _PER01AD1.Bits.PER1AD113
#define PER01AD1_PER1AD114              _PER01AD1.Bits.PER1AD114
#define PER01AD1_PER1AD115              _PER01AD1.Bits.PER1AD115
#define PER01AD1_PER0AD116              _PER01AD1.Bits.PER0AD116
#define PER01AD1_PER0AD117              _PER01AD1.Bits.PER0AD117
#define PER01AD1_PER0AD118              _PER01AD1.Bits.PER0AD118
#define PER01AD1_PER0AD119              _PER01AD1.Bits.PER0AD119
#define PER01AD1_PER0AD120              _PER01AD1.Bits.PER0AD120
#define PER01AD1_PER0AD121              _PER01AD1.Bits.PER0AD121
#define PER01AD1_PER0AD122              _PER01AD1.Bits.PER0AD122
#define PER01AD1_PER0AD123              _PER01AD1.Bits.PER0AD123
#define PER01AD1_PER1AD_18              _PER01AD1.MergedBits.grpPER1AD_18
#define PER01AD1_PER1AD1_10             _PER01AD1.MergedBits.grpPER1AD1_10
#define PER01AD1_PER0AD1_16             _PER01AD1.MergedBits.grpPER0AD1_16
#define PER01AD1_PER1AD                 PER01AD1_PER1AD_18
#define PER01AD1_PER1AD1                PER01AD1_PER1AD1_10
#define PER01AD1_PER0AD1                PER01AD1_PER0AD1_16

#define PER01AD1_PER1AD18_MASK          1
#define PER01AD1_PER1AD19_MASK          2
#define PER01AD1_PER1AD110_MASK         4
#define PER01AD1_PER1AD111_MASK         8
#define PER01AD1_PER1AD112_MASK         16
#define PER01AD1_PER1AD113_MASK         32
#define PER01AD1_PER1AD114_MASK         64
#define PER01AD1_PER1AD115_MASK         128
#define PER01AD1_PER0AD116_MASK         256
#define PER01AD1_PER0AD117_MASK         512
#define PER01AD1_PER0AD118_MASK         1024
#define PER01AD1_PER0AD119_MASK         2048
#define PER01AD1_PER0AD120_MASK         4096
#define PER01AD1_PER0AD121_MASK         8192
#define PER01AD1_PER0AD122_MASK         16384
#define PER01AD1_PER0AD123_MASK         32768
#define PER01AD1_PER1AD_18_MASK         3
#define PER01AD1_PER1AD_18_BITNUM       0
#define PER01AD1_PER1AD1_10_MASK        252
#define PER01AD1_PER1AD1_10_BITNUM      2
#define PER01AD1_PER0AD1_16_MASK        65280
#define PER01AD1_PER0AD1_16_BITNUM      8


 ATD0CTL01 - ATD 0 Control Register 01; 0x000002C0 
typedef union {
  word Word;
    Overlapped registers 
  struct {
     ATD0CTL0 - ATD 0 Control Register 0; 0x000002C0 
    union {
      byte Byte;
      struct {
        byte WRAP0       1;                                        Wrap Around Channel Select Bit 0 
        byte WRAP1       1;                                        Wrap Around Channel Select Bit 1 
        byte WRAP2       1;                                        Wrap Around Channel Select Bit 2 
        byte             1; 
        byte             1; 
        byte             1; 
        byte             1; 
        byte             1; 
      } Bits;
      struct {
        byte grpWRAP 3;
        byte     1;
        byte     1;
        byte     1;
        byte     1;
        byte     1;
      } MergedBits;
    } ATD0CTL0STR;
    #define ATD0CTL0                    _ATD0CTL01.Overlap_STR.ATD0CTL0STR.Byte
    #define ATD0CTL0_WRAP0              _ATD0CTL01.Overlap_STR.ATD0CTL0STR.Bits.WRAP0
    #define ATD0CTL0_WRAP1              _ATD0CTL01.Overlap_STR.ATD0CTL0STR.Bits.WRAP1
    #define ATD0CTL0_WRAP2              _ATD0CTL01.Overlap_STR.ATD0CTL0STR.Bits.WRAP2
    
     ATD0CTL_ARR Access 6 ATD0CTLx registers in an array 
    #define ATD0CTL_ARR                 ((volatile byte ) &ATD0CTL0)
    #define ATD0CTL0_WRAP               _ATD0CTL01.Overlap_STR.ATD0CTL0STR.MergedBits.grpWRAP
    
    #define ATD0CTL0_WRAP0_MASK         1
    #define ATD0CTL0_WRAP1_MASK         2
    #define ATD0CTL0_WRAP2_MASK         4
    #define ATD0CTL0_WRAP_MASK          7
    #define ATD0CTL0_WRAP_BITNUM        0


     ATD0CTL1 - ATD0 Control Register 1; 0x000002C1 
    union {
      byte Byte;
      struct {
        byte ETRIGCH0    1;                                        External Trigger Channel Select Bit 0 
        byte ETRIGCH1    1;                                        External Trigger Channel Select Bit 1 
        byte ETRIGCH2    1;                                        External Trigger Channel Select Bit 2 
        byte             1; 
        byte             1; 
        byte             1; 
        byte             1; 
        byte ETRIGSEL    1;                                        External Trigger Source Select 
      } Bits;
      struct {
        byte grpETRIGCH 3;
        byte     1;
        byte     1;
        byte     1;
        byte     1;
        byte     1;
      } MergedBits;
    } ATD0CTL1STR;
    #define ATD0CTL1                    _ATD0CTL01.Overlap_STR.ATD0CTL1STR.Byte
    #define ATD0CTL1_ETRIGCH0           _ATD0CTL01.Overlap_STR.ATD0CTL1STR.Bits.ETRIGCH0
    #define ATD0CTL1_ETRIGCH1           _ATD0CTL01.Overlap_STR.ATD0CTL1STR.Bits.ETRIGCH1
    #define ATD0CTL1_ETRIGCH2           _ATD0CTL01.Overlap_STR.ATD0CTL1STR.Bits.ETRIGCH2
    #define ATD0CTL1_ETRIGSEL           _ATD0CTL01.Overlap_STR.ATD0CTL1STR.Bits.ETRIGSEL
    
    #define ATD0CTL1_ETRIGCH            _ATD0CTL01.Overlap_STR.ATD0CTL1STR.MergedBits.grpETRIGCH
    
    #define ATD0CTL1_ETRIGCH0_MASK      1
    #define ATD0CTL1_ETRIGCH1_MASK      2
    #define ATD0CTL1_ETRIGCH2_MASK      4
    #define ATD0CTL1_ETRIGSEL_MASK      128
    #define ATD0CTL1_ETRIGCH_MASK       7
    #define ATD0CTL1_ETRIGCH_BITNUM     0

  } Overlap_STR;

