gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
  struct {
    word FRZ0        1;                                        Background Debug Freeze Enable Bit 0 
    word FRZ1        1;                                        Background Debug Freeze Enable Bit 1 
    word FIFO        1;                                        Result Register FIFO Mode 
    word S1C         1;                                        Conversion Sequence Length 1 
    word S2C         1;                                        Conversion Sequence Length 2 
    word S4C         1;                                        Conversion Sequence Length 4 
    word S8C         1;                                        Conversion Sequence Length 8 
    word             1; 
    word ASCIF       1;                                        ATD 0 Sequence Complete Interrupt Flag 
    word ASCIE       1;                                        ATD 0 Sequence Complete Interrupt Enable 
    word ETRIGE      1;                                        External Trigger Mode enable 
    word ETRIGP      1;                                        External Trigger Polarity 
    word ETRIGLE     1;                                        External Trigger LevelEdge control 
    word AWAI        1;                                        ATD Power Down in Wait Mode 
    word AFFC        1;                                        ATD Fast Conversion Complete Flag Clear 
    word ADPU        1;                                        ATD Disable  Power Down 
  } Bits;
  struct {
    word grpFRZ  2;
    word         1;
    word         1;
    word         1;
    word         1;
    word         1;
    word         1;
    word         1;
    word         1;
    word         1;
    word         1;
    word         1;
    word         1;
    word         1;
    word         1;
  } MergedBits;
} ATD0CTL23STR;
extern volatile ATD0CTL23STR _ATD0CTL23 @(REG_BASE + 0x000002C2);
#define ATD0CTL23                       _ATD0CTL23.Word
#define ATD0CTL23_FRZ0                  _ATD0CTL23.Bits.FRZ0
#define ATD0CTL23_FRZ1                  _ATD0CTL23.Bits.FRZ1
#define ATD0CTL23_FIFO                  _ATD0CTL23.Bits.FIFO
#define ATD0CTL23_S1C                   _ATD0CTL23.Bits.S1C
#define ATD0CTL23_S2C                   _ATD0CTL23.Bits.S2C
#define ATD0CTL23_S4C                   _ATD0CTL23.Bits.S4C
#define ATD0CTL23_S8C                   _ATD0CTL23.Bits.S8C
#define ATD0CTL23_ASCIF                 _ATD0CTL23.Bits.ASCIF
#define ATD0CTL23_ASCIE                 _ATD0CTL23.Bits.ASCIE
#define ATD0CTL23_ETRIGE                _ATD0CTL23.Bits.ETRIGE
#define ATD0CTL23_ETRIGP                _ATD0CTL23.Bits.ETRIGP
#define ATD0CTL23_ETRIGLE               _ATD0CTL23.Bits.ETRIGLE
#define ATD0CTL23_AWAI                  _ATD0CTL23.Bits.AWAI
#define ATD0CTL23_AFFC                  _ATD0CTL23.Bits.AFFC
#define ATD0CTL23_ADPU                  _ATD0CTL23.Bits.ADPU
#define ATD0CTL23_FRZ                   _ATD0CTL23.MergedBits.grpFRZ

#define ATD0CTL23_FRZ0_MASK             1
#define ATD0CTL23_FRZ1_MASK             2
#define ATD0CTL23_FIFO_MASK             4
#define ATD0CTL23_S1C_MASK              8
#define ATD0CTL23_S2C_MASK              16
#define ATD0CTL23_S4C_MASK              32
#define ATD0CTL23_S8C_MASK              64
#define ATD0CTL23_ASCIF_MASK            256
#define ATD0CTL23_ASCIE_MASK            512
#define ATD0CTL23_ETRIGE_MASK           1024
#define ATD0CTL23_ETRIGP_MASK           2048
#define ATD0CTL23_ETRIGLE_MASK          4096
#define ATD0CTL23_AWAI_MASK             8192
#define ATD0CTL23_AFFC_MASK             16384
#define ATD0CTL23_ADPU_MASK             32768
#define ATD0CTL23_FRZ_MASK              3
#define ATD0CTL23_FRZ_BITNUM            0


 ATD0CTL45 - ATD 0 Control Register 45; 0x000002C4 
typedef union {
  word Word;
    Overlapped registers 
  struct {
     ATD0CTL4 - ATD 0 Control Register 4; 0x000002C4 
    union {
      byte Byte;
      struct {
        byte PRS0        1;                                        ATD Clock Prescaler 0 
        byte PRS1        1;                                        ATD Clock Prescaler 1 
        byte PRS2        1;                                        ATD Clock Prescaler 2 
        byte PRS3        1;                                        ATD Clock Prescaler 3 
        byte PRS4        1;                                        ATD Clock Prescaler 4 
        byte SMP0        1;                                        Sample Time Select 0 
        byte SMP1        1;                                        Sample Time Select 1 
        byte SRES8       1;                                        ATD Resolution Select 
      } Bits;
      struct {
        byte grpPRS 5;
        byte grpSMP 2;
        byte grpSRES_8 1;
      } MergedBits;
    } ATD0CTL4STR;
    #define ATD0CTL4                    _ATD0CTL45.Overlap_STR.ATD0CTL4STR.Byte
    #define ATD0CTL4_PRS0               _ATD0CTL45.Overlap_STR.ATD0CTL4STR.Bits.PRS0
    #define ATD0CTL4_PRS1               _ATD0CTL45.Overlap_STR.ATD0CTL4STR.Bits.PRS1
    #define ATD0CTL4_PRS2               _ATD0CTL45.Overlap_STR.ATD0CTL4STR.Bits.PRS2
    #define ATD0CTL4_PRS3               _ATD0CTL45.Overlap_STR.ATD0CTL4STR.Bits.PRS3
    #define ATD0CTL4_PRS4               _ATD0CTL45.Overlap_STR.ATD0CTL4STR.Bits.PRS4
    #define ATD0CTL4_SMP0               _ATD0CTL45.Overlap_STR.ATD0CTL4STR.Bits.SMP0
    #define ATD0CTL4_SMP1               _ATD0CTL45.Overlap_STR.ATD0CTL4STR.Bits.SMP1
    #define ATD0CTL4_SRES8              _ATD0CTL45.Overlap_STR.ATD0CTL4STR.Bits.SRES8
    
    #define ATD0CTL4_PRS                _ATD0CTL45.Overlap_STR.ATD0CTL4STR.MergedBits.grpPRS
    #define ATD0CTL4_SMP                _ATD0CTL45.Overlap_STR.ATD0CTL4STR.MergedBits.grpSMP
    
    #define ATD0CTL4_PRS0_MASK          1
    #define ATD0CTL4_PRS1_MASK          2
    #define ATD0CTL4_PRS2_MASK          4
    #define ATD0CTL4_PRS3_MASK          8
    #define ATD0CTL4_PRS4_MASK          16
    #define ATD0CTL4_SMP0_MASK          32
    #define ATD0CTL4_SMP1_MASK          64
    #define ATD0CTL4_SRES8_MASK         128
    #define ATD0CTL4_PRS_MASK           31
    #define ATD0CTL4_PRS_BITNUM         0
    #define ATD0CTL4_SMP_MASK           96
    #define ATD0CTL4_SMP_BITNUM         5


     ATD0CTL5 - ATD 0 Control Register 5; 0x000002C5 
    union {
      byte Byte;
      struct {
        byte CA          1;                                        Analog Input Channel Select Code A 
        byte CB          1;                                        Analog Input Channel Select Code B 
        byte CC          1;                                        Analog Input Channel Select Code C 
        byte             1; 
        byte MULT        1;                                        Multi-Channel Sample Mode 
        byte SCAN        1;                                        Continuous Conversion Sequence Mode 
        byte DSGN        1;                                        SignedUnsigned Result Data Mode 
        byte DJM         1;                                        Result Register Data Justification Mode 
      } Bits;
      struct {
        byte grpCx 3;
        byte     1;
        byte     1;
        byte     1;
        byte     1;
        byte     1;
      } MergedBits;
    } ATD0CTL5STR;
    #define ATD0CTL5                    _ATD0CTL45.Overlap_STR.ATD0CTL5STR.Byte
    #define ATD0CTL5_CA                 _ATD0CTL45.Overlap_STR.ATD0CTL5STR.Bits.CA
    #define ATD0CTL5_CB                 _ATD0CTL45.Overlap_STR.ATD0CTL5STR.Bits.CB
    #define ATD0CTL5_CC                 _ATD0CTL45.Overlap_STR.ATD0CTL5STR.Bits.CC
    #define ATD0CTL5_MULT               _ATD0CTL45.Overlap_STR.ATD0CTL5STR.Bits.MULT
    #define ATD0CTL5_SCAN               _ATD0CTL45.Overlap_STR.ATD0CTL5STR.Bits.SCAN
    #define ATD0CTL5_DSGN               _ATD0CTL45.Overlap_STR.ATD0CTL5STR.Bits.DSGN
    #define ATD0CTL5_DJM                _ATD0CTL45.Overlap_STR.ATD0CTL5STR.Bits.DJM
    
    #define ATD0CTL5_Cx                 _ATD0CTL45.Overlap_STR.ATD0CTL5STR.MergedBits.grpCx
    
    #define ATD0CTL5_CA_MASK            1
    #define ATD0CTL5_CB_MASK            2
    #define ATD0CTL5_CC_MASK            4
    #define ATD0CTL5_MULT_MASK          16
    #define ATD0CTL5_SCAN_MASK          32
    #define ATD0CTL5_DSGN_MASK          64
    #define ATD0CTL5_DJM_MASK           128
    #define ATD0CTL5_Cx_MASK            7
    #define ATD0CTL5_Cx_BITNUM          0

  } Overlap_STR;

