gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
  struct {
    word CA          1;                                        Analog Input Channel Select Code A 
    word CB          1;                                        Analog Input Channel Select Code B 
    word CC          1;                                        Analog Input Channel Select Code C 
    word             1; 
    word MULT        1;                                        Multi-Channel Sample Mode 
    word SCAN        1;                                        Continuous Conversion Sequence Mode 
    word DSGN        1;                                        SignedUnsigned Result Data Mode 
    word DJM         1;                                        Result Register Data Justification Mode 
    word PRS0        1;                                        ATD Clock Prescaler 0 
    word PRS1        1;                                        ATD Clock Prescaler 1 
    word PRS2        1;                                        ATD Clock Prescaler 2 
    word PRS3        1;                                        ATD Clock Prescaler 3 
    word PRS4        1;                                        ATD Clock Prescaler 4 
    word SMP0        1;                                        Sample Time Select 0 
    word SMP1        1;                                        Sample Time Select 1 
    word SRES8       1;                                        ATD Resolution Select 
  } Bits;
  struct {
    word grpCx   3;
    word         1;
    word         1;
    word         1;
    word         1;
    word         1;
    word grpPRS  5;
    word grpSMP  2;
    word grpSRES_8 1;
  } MergedBits;
} ATD0CTL45STR;
extern volatile ATD0CTL45STR _ATD0CTL45 @(REG_BASE + 0x000002C4);
#define ATD0CTL45                       _ATD0CTL45.Word
#define ATD0CTL45_CA                    _ATD0CTL45.Bits.CA
#define ATD0CTL45_CB                    _ATD0CTL45.Bits.CB
#define ATD0CTL45_CC                    _ATD0CTL45.Bits.CC
#define ATD0CTL45_MULT                  _ATD0CTL45.Bits.MULT
#define ATD0CTL45_SCAN                  _ATD0CTL45.Bits.SCAN
#define ATD0CTL45_DSGN                  _ATD0CTL45.Bits.DSGN
#define ATD0CTL45_DJM                   _ATD0CTL45.Bits.DJM
#define ATD0CTL45_PRS0                  _ATD0CTL45.Bits.PRS0
#define ATD0CTL45_PRS1                  _ATD0CTL45.Bits.PRS1
#define ATD0CTL45_PRS2                  _ATD0CTL45.Bits.PRS2
#define ATD0CTL45_PRS3                  _ATD0CTL45.Bits.PRS3
#define ATD0CTL45_PRS4                  _ATD0CTL45.Bits.PRS4
#define ATD0CTL45_SMP0                  _ATD0CTL45.Bits.SMP0
#define ATD0CTL45_SMP1                  _ATD0CTL45.Bits.SMP1
#define ATD0CTL45_SRES8                 _ATD0CTL45.Bits.SRES8
#define ATD0CTL45_Cx                    _ATD0CTL45.MergedBits.grpCx
#define ATD0CTL45_PRS                   _ATD0CTL45.MergedBits.grpPRS
#define ATD0CTL45_SMP                   _ATD0CTL45.MergedBits.grpSMP

#define ATD0CTL45_CA_MASK               1
#define ATD0CTL45_CB_MASK               2
#define ATD0CTL45_CC_MASK               4
#define ATD0CTL45_MULT_MASK             16
#define ATD0CTL45_SCAN_MASK             32
#define ATD0CTL45_DSGN_MASK             64
#define ATD0CTL45_DJM_MASK              128
#define ATD0CTL45_PRS0_MASK             256
#define ATD0CTL45_PRS1_MASK             512
#define ATD0CTL45_PRS2_MASK             1024
#define ATD0CTL45_PRS3_MASK             2048
#define ATD0CTL45_PRS4_MASK             4096
#define ATD0CTL45_SMP0_MASK             8192
#define ATD0CTL45_SMP1_MASK             16384
#define ATD0CTL45_SRES8_MASK            32768
#define ATD0CTL45_Cx_MASK               7
#define ATD0CTL45_Cx_BITNUM             0
#define ATD0CTL45_PRS_MASK              7936
#define ATD0CTL45_PRS_BITNUM            8
#define ATD0CTL45_SMP_MASK              24576
#define ATD0CTL45_SMP_BITNUM            13


 ATD0STAT0 - ATD 0 Status Register 0; 0x000002C6 
typedef union {
  byte Byte;
  struct {
    byte CC0         1;                                        Conversion Counter 0 
    byte CC1         1;                                        Conversion Counter 1 
    byte CC2         1;                                        Conversion Counter 2 
    byte             1; 
    byte FIFOR       1;                                        FIFO Over Run Flag 
    byte ETORF       1;                                        External Trigger Overrun Flag 
    byte             1; 
    byte SCF         1;                                        Sequence Complete Flag 
  } Bits;
  struct {
    byte grpCC   3;
    byte         1;
    byte         1;
    byte         1;
    byte         1;
    byte         1;
  } MergedBits;
} ATD0STAT0STR;
extern volatile ATD0STAT0STR _ATD0STAT0 @(REG_BASE + 0x000002C6);
#define ATD0STAT0                       _ATD0STAT0.Byte
#define ATD0STAT0_CC0                   _ATD0STAT0.Bits.CC0
#define ATD0STAT0_CC1                   _ATD0STAT0.Bits.CC1
#define ATD0STAT0_CC2                   _ATD0STAT0.Bits.CC2
#define ATD0STAT0_FIFOR                 _ATD0STAT0.Bits.FIFOR
#define ATD0STAT0_ETORF                 _ATD0STAT0.Bits.ETORF
#define ATD0STAT0_SCF                   _ATD0STAT0.Bits.SCF
#define ATD0STAT0_CC                    _ATD0STAT0.MergedBits.grpCC

#define ATD0STAT0_CC0_MASK              1
#define ATD0STAT0_CC1_MASK              2
#define ATD0STAT0_CC2_MASK              4
#define ATD0STAT0_FIFOR_MASK            16
#define ATD0STAT0_ETORF_MASK            32
#define ATD0STAT0_SCF_MASK              128
#define ATD0STAT0_CC_MASK               7
#define ATD0STAT0_CC_BITNUM             0


 ATD0TEST1 - ATD0 Test Register; 0x000002C9 
typedef union {
  byte Byte;
  struct {
    byte SC          1;                                        Special Channel Conversion Bit 
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
  } Bits;
} ATD0TEST1STR;
extern volatile ATD0TEST1STR _ATD0TEST1 @(REG_BASE + 0x000002C9);
#define ATD0TEST1                       _ATD0TEST1.Byte
#define ATD0TEST1_SC                    _ATD0TEST1.Bits.SC

#define ATD0TEST1_SC_MASK               1


 ATD0STAT1 - ATD 0 Status Register 1; 0x000002CB 
typedef union {
  byte Byte;
  struct {
    byte CCF0        1;                                        Conversion Complete Flag 0 
    byte CCF1        1;                                        Conversion Complete Flag 1 
    byte CCF2        1;                                        Conversion Complete Flag 2 
    byte CCF3        1;                                        Conversion Complete Flag 3 
    byte CCF4        1;                                        Conversion Complete Flag 4 
    byte CCF5        1;                                        Conversion Complete Flag 5 
    byte CCF6        1;                                        Conversion Complete Flag 6 
    byte CCF7        1;                                        Conversion Complete Flag 7 
  } Bits;
} ATD0STAT1STR;
