gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
     ATD0DR0L - ATD 0 Conversion Result Register 0 Low; 0x000002D1 
    union {
      byte Byte;
      struct {
        byte             1; 
        byte             1; 
        byte             1; 
        byte             1; 
        byte             1; 
        byte             1; 
        byte BIT6        1;                                        Bit 6 
        byte BIT7        1;                                        Bit 7 
      } Bits;
      struct {
        byte     1;
        byte     1;
        byte     1;
        byte     1;
        byte     1;
        byte     1;
        byte grpBIT_6 2;
      } MergedBits;
    } ATD0DR0LSTR;
    #define ATD0DR0L                    _ATD0DR0.Overlap_STR.ATD0DR0LSTR.Byte
    #define ATD0DR0L_BIT6               _ATD0DR0.Overlap_STR.ATD0DR0LSTR.Bits.BIT6
    #define ATD0DR0L_BIT7               _ATD0DR0.Overlap_STR.ATD0DR0LSTR.Bits.BIT7
    
    #define ATD0DR0L_BIT_6              _ATD0DR0.Overlap_STR.ATD0DR0LSTR.MergedBits.grpBIT_6
    #define ATD0DR0L_BIT                ATD0DR0L_BIT_6
    
    #define ATD0DR0L_BIT6_MASK          64
    #define ATD0DR0L_BIT7_MASK          128
    #define ATD0DR0L_BIT_6_MASK         192
    #define ATD0DR0L_BIT_6_BITNUM       6

  } Overlap_STR;

  struct {
    word             1; 
    word             1; 
    word             1; 
    word             1; 
    word             1; 
    word             1; 
    word BIT6        1;                                        Bit 6 
    word BIT7        1;                                        Bit 7 
    word BIT8        1;                                        Bit 8 
    word BIT9        1;                                        Bit 9 
    word BIT10       1;                                        Bit 10 
    word BIT11       1;                                        Bit 11 
    word BIT12       1;                                        Bit 12 
    word BIT13       1;                                        Bit 13 
    word BIT14       1;                                        Bit 14 
    word BIT15       1;                                        Bit 15 
  } Bits;
  struct {
    word         1;
    word         1;
    word         1;
    word         1;
    word         1;
    word         1;
    word grpBIT_6 10;
  } MergedBits;
} ATD0DR0STR;
extern volatile ATD0DR0STR _ATD0DR0 @(REG_BASE + 0x000002D0);
#define ATD0DR0                         _ATD0DR0.Word
#define ATD0DR0_BIT6                    _ATD0DR0.Bits.BIT6
#define ATD0DR0_BIT7                    _ATD0DR0.Bits.BIT7
#define ATD0DR0_BIT8                    _ATD0DR0.Bits.BIT8
#define ATD0DR0_BIT9                    _ATD0DR0.Bits.BIT9
#define ATD0DR0_BIT10                   _ATD0DR0.Bits.BIT10
#define ATD0DR0_BIT11                   _ATD0DR0.Bits.BIT11
#define ATD0DR0_BIT12                   _ATD0DR0.Bits.BIT12
#define ATD0DR0_BIT13                   _ATD0DR0.Bits.BIT13
#define ATD0DR0_BIT14                   _ATD0DR0.Bits.BIT14
#define ATD0DR0_BIT15                   _ATD0DR0.Bits.BIT15
 ATD0DR_ARR Access 8 ATD0DRx registers in an array 
#define ATD0DR_ARR                      ((volatile word ) &ATD0DR0)
#define ATD0DR0_BIT_6                   _ATD0DR0.MergedBits.grpBIT_6
#define ATD0DR0_BIT                     ATD0DR0_BIT_6

#define ATD0DR0_BIT6_MASK               64
#define ATD0DR0_BIT7_MASK               128
#define ATD0DR0_BIT8_MASK               256
#define ATD0DR0_BIT9_MASK               512
#define ATD0DR0_BIT10_MASK              1024
#define ATD0DR0_BIT11_MASK              2048
#define ATD0DR0_BIT12_MASK              4096
#define ATD0DR0_BIT13_MASK              8192
#define ATD0DR0_BIT14_MASK              16384
#define ATD0DR0_BIT15_MASK              32768
#define ATD0DR0_BIT_6_MASK              65472
#define ATD0DR0_BIT_6_BITNUM            6


 ATD0DR1 - ATD 0 Conversion Result Register 1; 0x000002D2 
typedef union {
  word Word;
    Overlapped registers 
  struct {
     ATD0DR1H - ATD 0 Conversion Result Register 1 High; 0x000002D2 
    union {
      byte Byte;
      struct {
        byte BIT8        1;                                        Bit 8 
        byte BIT9        1;                                        Bit 9 
        byte BIT10       1;                                        Bit 10 
        byte BIT11       1;                                        Bit 11 
        byte BIT12       1;                                        Bit 12 
        byte BIT13       1;                                        Bit 13 
        byte BIT14       1;                                        Bit 14 
        byte BIT15       1;                                        Bit 15 
      } Bits;
    } ATD0DR1HSTR;
    #define ATD0DR1H                    _ATD0DR1.Overlap_STR.ATD0DR1HSTR.Byte
    #define ATD0DR1H_BIT8               _ATD0DR1.Overlap_STR.ATD0DR1HSTR.Bits.BIT8
    #define ATD0DR1H_BIT9               _ATD0DR1.Overlap_STR.ATD0DR1HSTR.Bits.BIT9
    #define ATD0DR1H_BIT10              _ATD0DR1.Overlap_STR.ATD0DR1HSTR.Bits.BIT10
    #define ATD0DR1H_BIT11              _ATD0DR1.Overlap_STR.ATD0DR1HSTR.Bits.BIT11
    #define ATD0DR1H_BIT12              _ATD0DR1.Overlap_STR.ATD0DR1HSTR.Bits.BIT12
    #define ATD0DR1H_BIT13              _ATD0DR1.Overlap_STR.ATD0DR1HSTR.Bits.BIT13
    #define ATD0DR1H_BIT14              _ATD0DR1.Overlap_STR.ATD0DR1HSTR.Bits.BIT14
    #define ATD0DR1H_BIT15              _ATD0DR1.Overlap_STR.ATD0DR1HSTR.Bits.BIT15
    
    
    #define ATD0DR1H_BIT8_MASK          1
    #define ATD0DR1H_BIT9_MASK          2
    #define ATD0DR1H_BIT10_MASK         4
    #define ATD0DR1H_BIT11_MASK         8
    #define ATD0DR1H_BIT12_MASK         16
    #define ATD0DR1H_BIT13_MASK         32
    #define ATD0DR1H_BIT14_MASK         64
    #define ATD0DR1H_BIT15_MASK         128


     ATD0DR1L - ATD 0 Conversion Result Register 1 Low; 0x000002D3 
    union {
      byte Byte;
      struct {
        byte             1; 
        byte             1; 
        byte             1; 
        byte             1; 
        byte             1; 
        byte             1; 
        byte BIT6        1;                                        Bit 6 
        byte BIT7        1;                                        Bit 7 
      } Bits;
      struct {
        byte     1;
        byte     1;
        byte     1;
        byte     1;
        byte     1;
        byte     1;
        byte grpBIT_6 2;
      } MergedBits;
    } ATD0DR1LSTR;
    #define ATD0DR1L                    _ATD0DR1.Overlap_STR.ATD0DR1LSTR.Byte
    #define ATD0DR1L_BIT6               _ATD0DR1.Overlap_STR.ATD0DR1LSTR.Bits.BIT6
    #define ATD0DR1L_BIT7               _ATD0DR1.Overlap_STR.ATD0DR1LSTR.Bits.BIT7
    
