gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
 VREGAPIR - VREG_3V3 - Autonomous Periodical Interrupt Rate Register; 0x000002F4 
typedef union {
  word Word;
    Overlapped registers 
  struct {
     VREGAPIRH - VREG_3V3 - Autonomous Periodical Interrupt Rate Register High; 0x000002F4 
    union {
      byte Byte;
      struct {
        byte APIR8       1;                                        Autonomous Periodical Interrupt Rate Bit 8 
        byte APIR9       1;                                        Autonomous Periodical Interrupt Rate Bit 9 
        byte APIR10      1;                                        Autonomous Periodical Interrupt Rate Bit 10 
        byte APIR11      1;                                        Autonomous Periodical Interrupt Rate Bit 11 
        byte             1; 
        byte             1; 
        byte             1; 
        byte             1; 
      } Bits;
      struct {
        byte grpAPIR_8 4;
        byte     1;
        byte     1;
        byte     1;
        byte     1;
      } MergedBits;
    } VREGAPIRHSTR;
    #define VREGAPIRH                   _VREGAPIR.Overlap_STR.VREGAPIRHSTR.Byte
    #define VREGAPIRH_APIR8             _VREGAPIR.Overlap_STR.VREGAPIRHSTR.Bits.APIR8
    #define VREGAPIRH_APIR9             _VREGAPIR.Overlap_STR.VREGAPIRHSTR.Bits.APIR9
    #define VREGAPIRH_APIR10            _VREGAPIR.Overlap_STR.VREGAPIRHSTR.Bits.APIR10
    #define VREGAPIRH_APIR11            _VREGAPIR.Overlap_STR.VREGAPIRHSTR.Bits.APIR11
    
    #define VREGAPIRH_APIR_8            _VREGAPIR.Overlap_STR.VREGAPIRHSTR.MergedBits.grpAPIR_8
    #define VREGAPIRH_APIR              VREGAPIRH_APIR_8
    
    #define VREGAPIRH_APIR8_MASK        1
    #define VREGAPIRH_APIR9_MASK        2
    #define VREGAPIRH_APIR10_MASK       4
    #define VREGAPIRH_APIR11_MASK       8
    #define VREGAPIRH_APIR_8_MASK       15
    #define VREGAPIRH_APIR_8_BITNUM     0


     VREGAPIRL - VREG_3V3 - Autonomous Periodical Interrupt Rate Register Low; 0x000002F5 
    union {
      byte Byte;
      struct {
        byte APIR0       1;                                        Autonomous Periodical Interrupt Rate Bit 0 
        byte APIR1       1;                                        Autonomous Periodical Interrupt Rate Bit 1 
        byte APIR2       1;                                        Autonomous Periodical Interrupt Rate Bit 2 
        byte APIR3       1;                                        Autonomous Periodical Interrupt Rate Bit 3 
        byte APIR4       1;                                        Autonomous Periodical Interrupt Rate Bit 4 
        byte APIR5       1;                                        Autonomous Periodical Interrupt Rate Bit 5 
        byte APIR6       1;                                        Autonomous Periodical Interrupt Rate Bit 6 
        byte APIR7       1;                                        Autonomous Periodical Interrupt Rate Bit 7 
      } Bits;
    } VREGAPIRLSTR;
    #define VREGAPIRL                   _VREGAPIR.Overlap_STR.VREGAPIRLSTR.Byte
    #define VREGAPIRL_APIR0             _VREGAPIR.Overlap_STR.VREGAPIRLSTR.Bits.APIR0
    #define VREGAPIRL_APIR1             _VREGAPIR.Overlap_STR.VREGAPIRLSTR.Bits.APIR1
    #define VREGAPIRL_APIR2             _VREGAPIR.Overlap_STR.VREGAPIRLSTR.Bits.APIR2
    #define VREGAPIRL_APIR3             _VREGAPIR.Overlap_STR.VREGAPIRLSTR.Bits.APIR3
    #define VREGAPIRL_APIR4             _VREGAPIR.Overlap_STR.VREGAPIRLSTR.Bits.APIR4
    #define VREGAPIRL_APIR5             _VREGAPIR.Overlap_STR.VREGAPIRLSTR.Bits.APIR5
    #define VREGAPIRL_APIR6             _VREGAPIR.Overlap_STR.VREGAPIRLSTR.Bits.APIR6
    #define VREGAPIRL_APIR7             _VREGAPIR.Overlap_STR.VREGAPIRLSTR.Bits.APIR7
    
    
    #define VREGAPIRL_APIR0_MASK        1
    #define VREGAPIRL_APIR1_MASK        2
    #define VREGAPIRL_APIR2_MASK        4
    #define VREGAPIRL_APIR3_MASK        8
    #define VREGAPIRL_APIR4_MASK        16
    #define VREGAPIRL_APIR5_MASK        32
    #define VREGAPIRL_APIR6_MASK        64
    #define VREGAPIRL_APIR7_MASK        128

  } Overlap_STR;

  struct {
    word APIR0       1;                                        Autonomous Periodical Interrupt Rate Bit 0 
    word APIR1       1;                                        Autonomous Periodical Interrupt Rate Bit 1 
    word APIR2       1;                                        Autonomous Periodical Interrupt Rate Bit 2 
    word APIR3       1;                                        Autonomous Periodical Interrupt Rate Bit 3 
    word APIR4       1;                                        Autonomous Periodical Interrupt Rate Bit 4 
    word APIR5       1;                                        Autonomous Periodical Interrupt Rate Bit 5 
    word APIR6       1;                                        Autonomous Periodical Interrupt Rate Bit 6 
    word APIR7       1;                                        Autonomous Periodical Interrupt Rate Bit 7 
    word APIR8       1;                                        Autonomous Periodical Interrupt Rate Bit 8 
    word APIR9       1;                                        Autonomous Periodical Interrupt Rate Bit 9 
    word APIR10      1;                                        Autonomous Periodical Interrupt Rate Bit 10 
    word APIR11      1;                                        Autonomous Periodical Interrupt Rate Bit 11 
    word             1; 
    word             1; 
    word             1; 
    word             1; 
  } Bits;
  struct {
    word grpAPIR 12;
    word         1;
    word         1;
    word         1;
    word         1;
  } MergedBits;
} VREGAPIRSTR;
extern volatile VREGAPIRSTR _VREGAPIR @(REG_BASE + 0x000002F4);
#define VREGAPIR                        _VREGAPIR.Word
#define VREGAPIR_APIR0                  _VREGAPIR.Bits.APIR0
#define VREGAPIR_APIR1                  _VREGAPIR.Bits.APIR1
#define VREGAPIR_APIR2                  _VREGAPIR.Bits.APIR2
#define VREGAPIR_APIR3                  _VREGAPIR.Bits.APIR3
#define VREGAPIR_APIR4                  _VREGAPIR.Bits.APIR4
#define VREGAPIR_APIR5                  _VREGAPIR.Bits.APIR5
#define VREGAPIR_APIR6                  _VREGAPIR.Bits.APIR6
#define VREGAPIR_APIR7                  _VREGAPIR.Bits.APIR7
#define VREGAPIR_APIR8                  _VREGAPIR.Bits.APIR8
#define VREGAPIR_APIR9                  _VREGAPIR.Bits.APIR9
#define VREGAPIR_APIR10                 _VREGAPIR.Bits.APIR10
#define VREGAPIR_APIR11                 _VREGAPIR.Bits.APIR11
#define VREGAPIR_APIR                   _VREGAPIR.MergedBits.grpAPIR

#define VREGAPIR_APIR0_MASK             1
#define VREGAPIR_APIR1_MASK             2
#define VREGAPIR_APIR2_MASK             4
#define VREGAPIR_APIR3_MASK             8
#define VREGAPIR_APIR4_MASK             16
#define VREGAPIR_APIR5_MASK             32
#define VREGAPIR_APIR6_MASK             64
#define VREGAPIR_APIR7_MASK             128
#define VREGAPIR_APIR8_MASK             256
#define VREGAPIR_APIR9_MASK             512
#define VREGAPIR_APIR10_MASK            1024
#define VREGAPIR_APIR11_MASK            2048
#define VREGAPIR_APIR_MASK              4095
#define VREGAPIR_APIR_BITNUM            0


 PWME - PWM Enable Register; 0x00000300 
typedef union {
  byte Byte;
  struct {
    byte PWME0       1;                                        Pulse Width Channel 0 Enable 
    byte PWME1       1;                                        Pulse Width Channel 1 Enable 
    byte PWME2       1;                                        Pulse Width Channel 2 Enable 
    byte PWME3       1;                                        Pulse Width Channel 3 Enable 
    byte PWME4       1;                                        Pulse Width Channel 4 Enable 
    byte PWME5       1;                                        Pulse Width Channel 5 Enable 
    byte PWME6       1;                                        Pulse Width Channel 6 Enable 
    byte PWME7       1;                                        Pulse Width Channel 7 Enable 
  } Bits;
} PWMESTR;
extern volatile PWMESTR _PWME @(REG_BASE + 0x00000300);
#define PWME                            _PWME.Byte
#define PWME_PWME0                      _PWME.Bits.PWME0
#define PWME_PWME1                      _PWME.Bits.PWME1
#define PWME_PWME2                      _PWME.Bits.PWME2
#define PWME_PWME3                      _PWME.Bits.PWME3
#define PWME_PWME4                      _PWME.Bits.PWME4
#define PWME_PWME5                      _PWME.Bits.PWME5
#define PWME_PWME6                      _PWME.Bits.PWME6
#define PWME_PWME7                      _PWME.Bits.PWME7

#define PWME_PWME0_MASK                 1
#define PWME_PWME1_MASK                 2
#define PWME_PWME2_MASK                 4
#define PWME_PWME3_MASK                 8
#define PWME_PWME4_MASK                 16
#define PWME_PWME5_MASK                 32
#define PWME_PWME6_MASK                 64
#define PWME_PWME7_MASK                 128


 PWMPOL - PWM Polarity Register; 0x00000301 
typedef union {
  byte Byte;
  struct {
    byte PPOL0       1;                                        Pulse Width Channel 0 Polarity 
    byte PPOL1       1;                                        Pulse Width Channel 1 Polarity 
    byte PPOL2       1;                                        Pulse Width Channel 2 Polarity 
    byte PPOL3       1;                                        Pulse Width Channel 3 Polarity 
    byte PPOL4       1;                                        Pulse Width Channel 4 Polarity 
    byte PPOL5       1;                                        Pulse Width Channel 5 Polarity 
    byte PPOL6       1;                                        Pulse Width Channel 6 Polarity 
    byte PPOL7       1;                                        Pulse Width Channel 7 Polarity 
  } Bits;
} PWMPOLSTR;
