gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
extern volatile PWMPOLSTR _PWMPOL @(REG_BASE + 0x00000301);
#define PWMPOL                          _PWMPOL.Byte
#define PWMPOL_PPOL0                    _PWMPOL.Bits.PPOL0
#define PWMPOL_PPOL1                    _PWMPOL.Bits.PPOL1
#define PWMPOL_PPOL2                    _PWMPOL.Bits.PPOL2
#define PWMPOL_PPOL3                    _PWMPOL.Bits.PPOL3
#define PWMPOL_PPOL4                    _PWMPOL.Bits.PPOL4
#define PWMPOL_PPOL5                    _PWMPOL.Bits.PPOL5
#define PWMPOL_PPOL6                    _PWMPOL.Bits.PPOL6
#define PWMPOL_PPOL7                    _PWMPOL.Bits.PPOL7

#define PWMPOL_PPOL0_MASK               1
#define PWMPOL_PPOL1_MASK               2
#define PWMPOL_PPOL2_MASK               4
#define PWMPOL_PPOL3_MASK               8
#define PWMPOL_PPOL4_MASK               16
#define PWMPOL_PPOL5_MASK               32
#define PWMPOL_PPOL6_MASK               64
#define PWMPOL_PPOL7_MASK               128


 PWMCLK - PWM Clock Select Register; 0x00000302 
typedef union {
  byte Byte;
  struct {
    byte PCLK0       1;                                        Pulse Width Channel 0 Clock Select 
    byte PCLK1       1;                                        Pulse Width Channel 1 Clock Select 
    byte PCLK2       1;                                        Pulse Width Channel 2 Clock Select 
    byte PCLK3       1;                                        Pulse Width Channel 3 Clock Select 
    byte PCLK4       1;                                        Pulse Width Channel 4 Clock Select 
    byte PCLK5       1;                                        Pulse Width Channel 5 Clock Select 
    byte PCLK6       1;                                        Pulse Width Channel 6 Clock Select 
    byte PCLK7       1;                                        Pulse Width Channel 7 Clock Select 
  } Bits;
} PWMCLKSTR;
extern volatile PWMCLKSTR _PWMCLK @(REG_BASE + 0x00000302);
#define PWMCLK                          _PWMCLK.Byte
#define PWMCLK_PCLK0                    _PWMCLK.Bits.PCLK0
#define PWMCLK_PCLK1                    _PWMCLK.Bits.PCLK1
#define PWMCLK_PCLK2                    _PWMCLK.Bits.PCLK2
#define PWMCLK_PCLK3                    _PWMCLK.Bits.PCLK3
#define PWMCLK_PCLK4                    _PWMCLK.Bits.PCLK4
#define PWMCLK_PCLK5                    _PWMCLK.Bits.PCLK5
#define PWMCLK_PCLK6                    _PWMCLK.Bits.PCLK6
#define PWMCLK_PCLK7                    _PWMCLK.Bits.PCLK7

#define PWMCLK_PCLK0_MASK               1
#define PWMCLK_PCLK1_MASK               2
#define PWMCLK_PCLK2_MASK               4
#define PWMCLK_PCLK3_MASK               8
#define PWMCLK_PCLK4_MASK               16
#define PWMCLK_PCLK5_MASK               32
#define PWMCLK_PCLK6_MASK               64
#define PWMCLK_PCLK7_MASK               128


 PWMPRCLK - PWM Prescale Clock Select Register; 0x00000303 
typedef union {
  byte Byte;
  struct {
    byte PCKA0       1;                                        Prescaler Select for Clock A 0 
    byte PCKA1       1;                                        Prescaler Select for Clock A 1 
    byte PCKA2       1;                                        Prescaler Select for Clock A 2 
    byte             1; 
    byte PCKB0       1;                                        Prescaler Select for Clock B 0 
    byte PCKB1       1;                                        Prescaler Select for Clock B 1 
    byte PCKB2       1;                                        Prescaler Select for Clock B 2 
    byte             1; 
  } Bits;
  struct {
    byte grpPCKA 3;
    byte         1;
    byte grpPCKB 3;
    byte         1;
  } MergedBits;
} PWMPRCLKSTR;
extern volatile PWMPRCLKSTR _PWMPRCLK @(REG_BASE + 0x00000303);
#define PWMPRCLK                        _PWMPRCLK.Byte
#define PWMPRCLK_PCKA0                  _PWMPRCLK.Bits.PCKA0
#define PWMPRCLK_PCKA1                  _PWMPRCLK.Bits.PCKA1
#define PWMPRCLK_PCKA2                  _PWMPRCLK.Bits.PCKA2
#define PWMPRCLK_PCKB0                  _PWMPRCLK.Bits.PCKB0
#define PWMPRCLK_PCKB1                  _PWMPRCLK.Bits.PCKB1
#define PWMPRCLK_PCKB2                  _PWMPRCLK.Bits.PCKB2
#define PWMPRCLK_PCKA                   _PWMPRCLK.MergedBits.grpPCKA
#define PWMPRCLK_PCKB                   _PWMPRCLK.MergedBits.grpPCKB

#define PWMPRCLK_PCKA0_MASK             1
#define PWMPRCLK_PCKA1_MASK             2
#define PWMPRCLK_PCKA2_MASK             4
#define PWMPRCLK_PCKB0_MASK             16
#define PWMPRCLK_PCKB1_MASK             32
#define PWMPRCLK_PCKB2_MASK             64
#define PWMPRCLK_PCKA_MASK              7
#define PWMPRCLK_PCKA_BITNUM            0
#define PWMPRCLK_PCKB_MASK              112
#define PWMPRCLK_PCKB_BITNUM            4


 PWMCAE - PWM Center Align Enable Register; 0x00000304 
typedef union {
  byte Byte;
  struct {
    byte CAE0        1;                                        Center Aligned Output Mode on channel 0 
    byte CAE1        1;                                        Center Aligned Output Mode on channel 1 
    byte CAE2        1;                                        Center Aligned Output Mode on channel 2 
    byte CAE3        1;                                        Center Aligned Output Mode on channel 3 
    byte CAE4        1;                                        Center Aligned Output Mode on channel 4 
    byte CAE5        1;                                        Center Aligned Output Mode on channel 5 
    byte CAE6        1;                                        Center Aligned Output Mode on channel 6 
    byte CAE7        1;                                        Center Aligned Output Mode on channel 7 
  } Bits;
} PWMCAESTR;
extern volatile PWMCAESTR _PWMCAE @(REG_BASE + 0x00000304);
#define PWMCAE                          _PWMCAE.Byte
#define PWMCAE_CAE0                     _PWMCAE.Bits.CAE0
#define PWMCAE_CAE1                     _PWMCAE.Bits.CAE1
#define PWMCAE_CAE2                     _PWMCAE.Bits.CAE2
#define PWMCAE_CAE3                     _PWMCAE.Bits.CAE3
#define PWMCAE_CAE4                     _PWMCAE.Bits.CAE4
#define PWMCAE_CAE5                     _PWMCAE.Bits.CAE5
#define PWMCAE_CAE6                     _PWMCAE.Bits.CAE6
#define PWMCAE_CAE7                     _PWMCAE.Bits.CAE7

