gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
#define PWMCAE_CAE0_MASK                1
#define PWMCAE_CAE1_MASK                2
#define PWMCAE_CAE2_MASK                4
#define PWMCAE_CAE3_MASK                8
#define PWMCAE_CAE4_MASK                16
#define PWMCAE_CAE5_MASK                32
#define PWMCAE_CAE6_MASK                64
#define PWMCAE_CAE7_MASK                128


 PWMCTL - PWM Control Register; 0x00000305 
typedef union {
  byte Byte;
  struct {
    byte             1; 
    byte             1; 
    byte PFRZ        1;                                        PWM Counters Stop in Freeze Mode 
    byte PSWAI       1;                                        PWM Stops in Wait Mode 
    byte CON01       1;                                        Concatenate channels 0 and 1 
    byte CON23       1;                                        Concatenate channels 2 and 3 
    byte CON45       1;                                        Concatenate channels 4 and 5 
    byte CON67       1;                                        Concatenate channels 6 and 7 
  } Bits;
} PWMCTLSTR;
extern volatile PWMCTLSTR _PWMCTL @(REG_BASE + 0x00000305);
#define PWMCTL                          _PWMCTL.Byte
#define PWMCTL_PFRZ                     _PWMCTL.Bits.PFRZ
#define PWMCTL_PSWAI                    _PWMCTL.Bits.PSWAI
#define PWMCTL_CON01                    _PWMCTL.Bits.CON01
#define PWMCTL_CON23                    _PWMCTL.Bits.CON23
#define PWMCTL_CON45                    _PWMCTL.Bits.CON45
#define PWMCTL_CON67                    _PWMCTL.Bits.CON67

#define PWMCTL_PFRZ_MASK                4
#define PWMCTL_PSWAI_MASK               8
#define PWMCTL_CON01_MASK               16
#define PWMCTL_CON23_MASK               32
#define PWMCTL_CON45_MASK               64
#define PWMCTL_CON67_MASK               128


 PWMSCLA - PWM Scale A Register; 0x00000308 
typedef union {
  byte Byte;
  struct {
    byte BIT0        1;                                        PWM Scale A Bit 0 
    byte BIT1        1;                                        PWM Scale A Bit 1 
    byte BIT2        1;                                        PWM Scale A Bit 2 
    byte BIT3        1;                                        PWM Scale A Bit 3 
    byte BIT4        1;                                        PWM Scale A Bit 4 
    byte BIT5        1;                                        PWM Scale A Bit 5 
    byte BIT6        1;                                        PWM Scale A Bit 6 
    byte BIT7        1;                                        PWM Scale A Bit 7 
  } Bits;
} PWMSCLASTR;
extern volatile PWMSCLASTR _PWMSCLA @(REG_BASE + 0x00000308);
#define PWMSCLA                         _PWMSCLA.Byte
#define PWMSCLA_BIT0                    _PWMSCLA.Bits.BIT0
#define PWMSCLA_BIT1                    _PWMSCLA.Bits.BIT1
#define PWMSCLA_BIT2                    _PWMSCLA.Bits.BIT2
#define PWMSCLA_BIT3                    _PWMSCLA.Bits.BIT3
#define PWMSCLA_BIT4                    _PWMSCLA.Bits.BIT4
#define PWMSCLA_BIT5                    _PWMSCLA.Bits.BIT5
#define PWMSCLA_BIT6                    _PWMSCLA.Bits.BIT6
#define PWMSCLA_BIT7                    _PWMSCLA.Bits.BIT7

#define PWMSCLA_BIT0_MASK               1
#define PWMSCLA_BIT1_MASK               2
#define PWMSCLA_BIT2_MASK               4
#define PWMSCLA_BIT3_MASK               8
#define PWMSCLA_BIT4_MASK               16
#define PWMSCLA_BIT5_MASK               32
#define PWMSCLA_BIT6_MASK               64
#define PWMSCLA_BIT7_MASK               128


 PWMSCLB - PWM Scale B Register; 0x00000309 
typedef union {
  byte Byte;
  struct {
    byte BIT0        1;                                        PWM Scale B Bit 0 
    byte BIT1        1;                                        PWM Scale B Bit 1 
    byte BIT2        1;                                        PWM Scale B Bit 2 
    byte BIT3        1;                                        PWM Scale B Bit 3 
    byte BIT4        1;                                        PWM Scale B Bit 4 
    byte BIT5        1;                                        PWM Scale B Bit 5 
    byte BIT6        1;                                        PWM Scale B Bit 6 
    byte BIT7        1;                                        PWM Scale B Bit 7 
  } Bits;
} PWMSCLBSTR;
extern volatile PWMSCLBSTR _PWMSCLB @(REG_BASE + 0x00000309);
#define PWMSCLB                         _PWMSCLB.Byte
#define PWMSCLB_BIT0                    _PWMSCLB.Bits.BIT0
#define PWMSCLB_BIT1                    _PWMSCLB.Bits.BIT1
#define PWMSCLB_BIT2                    _PWMSCLB.Bits.BIT2
#define PWMSCLB_BIT3                    _PWMSCLB.Bits.BIT3
#define PWMSCLB_BIT4                    _PWMSCLB.Bits.BIT4
#define PWMSCLB_BIT5                    _PWMSCLB.Bits.BIT5
#define PWMSCLB_BIT6                    _PWMSCLB.Bits.BIT6
#define PWMSCLB_BIT7                    _PWMSCLB.Bits.BIT7

#define PWMSCLB_BIT0_MASK               1
#define PWMSCLB_BIT1_MASK               2
#define PWMSCLB_BIT2_MASK               4
#define PWMSCLB_BIT3_MASK               8
#define PWMSCLB_BIT4_MASK               16
#define PWMSCLB_BIT5_MASK               32
#define PWMSCLB_BIT6_MASK               64
#define PWMSCLB_BIT7_MASK               128


 PWMCNT01 - PWM Channel Counter 01 Register; 0x0000030C 
typedef union {
  word Word;
    Overlapped registers 
  struct {
     PWMCNT0 - PWM Channel Counter 0 Register; 0x0000030C 
    union {
      byte Byte;
    } PWMCNT0STR;
    #define PWMCNT0                     _PWMCNT01.Overlap_STR.PWMCNT0STR.Byte
    
     PWMCNT_ARR Access 8 PWMCNTx registers in an array 
    #define PWMCNT_ARR                  ((volatile byte ) &PWMCNT0)
    


     PWMCNT1 - PWM Channel Counter 1 Register; 0x0000030D 
    union {
      byte Byte;
    } PWMCNT1STR;
    #define PWMCNT1                     _PWMCNT01.Overlap_STR.PWMCNT1STR.Byte
    
    

  } Overlap_STR;

} PWMCNT01STR;
extern volatile PWMCNT01STR _PWMCNT01 @(REG_BASE + 0x0000030C);
#define PWMCNT01                        _PWMCNT01.Word



 PWMCNT23 - PWM Channel Counter 23 Register; 0x0000030E 
typedef union {
  word Word;
    Overlapped registers 
  struct {
     PWMCNT2 - PWM Channel Counter 2 Register; 0x0000030E 
    union {
      byte Byte;
    } PWMCNT2STR;
    #define PWMCNT2                     _PWMCNT23.Overlap_STR.PWMCNT2STR.Byte
    
    


     PWMCNT3 - PWM Channel Counter 3 Register; 0x0000030F 
    union {
      byte Byte;
    } PWMCNT3STR;
    #define PWMCNT3                     _PWMCNT23.Overlap_STR.PWMCNT3STR.Byte
    
    

  } Overlap_STR;

