gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
} PWMCNT23STR;
extern volatile PWMCNT23STR _PWMCNT23 @(REG_BASE + 0x0000030E);
#define PWMCNT23                        _PWMCNT23.Word



 PWMCNT45 - PWM Channel Counter 45 Register; 0x00000310 
typedef union {
  word Word;
    Overlapped registers 
  struct {
     PWMCNT4 - PWM Channel Counter 4 Register; 0x00000310 
    union {
      byte Byte;
    } PWMCNT4STR;
    #define PWMCNT4                     _PWMCNT45.Overlap_STR.PWMCNT4STR.Byte
    
    


     PWMCNT5 - PWM Channel Counter 5 Register; 0x00000311 
    union {
      byte Byte;
    } PWMCNT5STR;
    #define PWMCNT5                     _PWMCNT45.Overlap_STR.PWMCNT5STR.Byte
    
    

  } Overlap_STR;

} PWMCNT45STR;
extern volatile PWMCNT45STR _PWMCNT45 @(REG_BASE + 0x00000310);
#define PWMCNT45                        _PWMCNT45.Word



 PWMCNT67 - PWM Channel Counter 67 Register; 0x00000312 
typedef union {
  word Word;
    Overlapped registers 
  struct {
     PWMCNT6 - PWM Channel Counter 6 Register; 0x00000312 
    union {
      byte Byte;
    } PWMCNT6STR;
    #define PWMCNT6                     _PWMCNT67.Overlap_STR.PWMCNT6STR.Byte
    
    


     PWMCNT7 - PWM Channel Counter 7 Register; 0x00000313 
    union {
      byte Byte;
    } PWMCNT7STR;
    #define PWMCNT7                     _PWMCNT67.Overlap_STR.PWMCNT7STR.Byte
    
    

  } Overlap_STR;

} PWMCNT67STR;
extern volatile PWMCNT67STR _PWMCNT67 @(REG_BASE + 0x00000312);
#define PWMCNT67                        _PWMCNT67.Word



 PWMPER01 - PWM Channel Period 01 Register; 0x00000314 
typedef union {
  word Word;
    Overlapped registers 
  struct {
     PWMPER0 - PWM Channel Period 0 Register; 0x00000314 
    union {
      byte Byte;
    } PWMPER0STR;
    #define PWMPER0                     _PWMPER01.Overlap_STR.PWMPER0STR.Byte
    
     PWMPER_ARR Access 8 PWMPERx registers in an array 
    #define PWMPER_ARR                  ((volatile byte ) &PWMPER0)
    


     PWMPER1 - PWM Channel Period 1 Register; 0x00000315 
    union {
      byte Byte;
    } PWMPER1STR;
    #define PWMPER1                     _PWMPER01.Overlap_STR.PWMPER1STR.Byte
    
    

  } Overlap_STR;

} PWMPER01STR;
extern volatile PWMPER01STR _PWMPER01 @(REG_BASE + 0x00000314);
#define PWMPER01                        _PWMPER01.Word



 PWMPER23 - PWM Channel Period 23 Register; 0x00000316 
typedef union {
  word Word;
    Overlapped registers 
  struct {
     PWMPER2 - PWM Channel Period 2 Register; 0x00000316 
    union {
      byte Byte;
    } PWMPER2STR;
    #define PWMPER2                     _PWMPER23.Overlap_STR.PWMPER2STR.Byte
    
    


     PWMPER3 - PWM Channel Period 3 Register; 0x00000317 
    union {
      byte Byte;
    } PWMPER3STR;
    #define PWMPER3                     _PWMPER23.Overlap_STR.PWMPER3STR.Byte
    
    

  } Overlap_STR;

} PWMPER23STR;
extern volatile PWMPER23STR _PWMPER23 @(REG_BASE + 0x00000316);
#define PWMPER23                        _PWMPER23.Word



 PWMPER45 - PWM Channel Period 45 Register; 0x00000318 
typedef union {
  word Word;
    Overlapped registers 
  struct {
     PWMPER4 - PWM Channel Period 4 Register; 0x00000318 
    union {
      byte Byte;
    } PWMPER4STR;
    #define PWMPER4                     _PWMPER45.Overlap_STR.PWMPER4STR.Byte
    
    


     PWMPER5 - PWM Channel Period 5 Register; 0x00000319 
    union {
      byte Byte;
    } PWMPER5STR;
    #define PWMPER5                     _PWMPER45.Overlap_STR.PWMPER5STR.Byte
    
    

  } Overlap_STR;

} PWMPER45STR;
extern volatile PWMPER45STR _PWMPER45 @(REG_BASE + 0x00000318);
#define PWMPER45                        _PWMPER45.Word



 PWMPER67 - PWM Channel Period 67 Register; 0x0000031A 
typedef union {
  word Word;
    Overlapped registers 
  struct {
     PWMPER6 - PWM Channel Period 6 Register; 0x0000031A 
    union {
      byte Byte;
    } PWMPER6STR;
    #define PWMPER6                     _PWMPER67.Overlap_STR.PWMPER6STR.Byte
    
    


     PWMPER7 - PWM Channel Period 7 Register; 0x0000031B 
    union {
      byte Byte;
    } PWMPER7STR;
    #define PWMPER7                     _PWMPER67.Overlap_STR.PWMPER7STR.Byte
    
    

  } Overlap_STR;

} PWMPER67STR;
extern volatile PWMPER67STR _PWMPER67 @(REG_BASE + 0x0000031A);
#define PWMPER67                        _PWMPER67.Word



 PWMDTY01 - PWM Channel Duty 01 Register; 0x0000031C 
typedef union {
  word Word;
    Overlapped registers 
  struct {
     PWMDTY0 - PWM Channel Duty 0 Register; 0x0000031C 
    union {
      byte Byte;
    } PWMDTY0STR;
    #define PWMDTY0                     _PWMDTY01.Overlap_STR.PWMDTY0STR.Byte
    
     PWMDTY_ARR Access 8 PWMDTYx registers in an array 
    #define PWMDTY_ARR                  ((volatile byte ) &PWMDTY0)
    


     PWMDTY1 - PWM Channel Duty 1 Register; 0x0000031D 
    union {
      byte Byte;
    } PWMDTY1STR;
    #define PWMDTY1                     _PWMDTY01.Overlap_STR.PWMDTY1STR.Byte
    
    

  } Overlap_STR;

} PWMDTY01STR;
extern volatile PWMDTY01STR _PWMDTY01 @(REG_BASE + 0x0000031C);
#define PWMDTY01                        _PWMDTY01.Word



 PWMDTY23 - PWM Channel Duty 23 Register; 0x0000031E 
typedef union {
  word Word;
    Overlapped registers 
  struct {
     PWMDTY2 - PWM Channel Duty 2 Register; 0x0000031E 
    union {
      byte Byte;
    } PWMDTY2STR;
    #define PWMDTY2                     _PWMDTY23.Overlap_STR.PWMDTY2STR.Byte
    
    


     PWMDTY3 - PWM Channel Duty 3 Register; 0x0000031F 
    union {
      byte Byte;
    } PWMDTY3STR;
    #define PWMDTY3                     _PWMDTY23.Overlap_STR.PWMDTY3STR.Byte
    
    

  } Overlap_STR;

} PWMDTY23STR;
extern volatile PWMDTY23STR _PWMDTY23 @(REG_BASE + 0x0000031E);
#define PWMDTY23                        _PWMDTY23.Word



 PWMDTY45 - PWM Channel Duty 45 Register; 0x00000320 
typedef union {
  word Word;
    Overlapped registers 
  struct {
     PWMDTY4 - PWM Channel Duty 4 Register; 0x00000320 
    union {
      byte Byte;
    } PWMDTY4STR;
    #define PWMDTY4                     _PWMDTY45.Overlap_STR.PWMDTY4STR.Byte
    
    


     PWMDTY5 - PWM Channel Duty 5 Register; 0x00000321 
    union {
      byte Byte;
    } PWMDTY5STR;
    #define PWMDTY5                     _PWMDTY45.Overlap_STR.PWMDTY5STR.Byte
    
    

  } Overlap_STR;

} PWMDTY45STR;
extern volatile PWMDTY45STR _PWMDTY45 @(REG_BASE + 0x00000320);
#define PWMDTY45                        _PWMDTY45.Word



