gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
 PWMDTY67 - PWM Channel Duty 67 Register; 0x00000322 
typedef union {
  word Word;
    Overlapped registers 
  struct {
     PWMDTY6 - PWM Channel Duty 6 Register; 0x00000322 
    union {
      byte Byte;
    } PWMDTY6STR;
    #define PWMDTY6                     _PWMDTY67.Overlap_STR.PWMDTY6STR.Byte
    
    


     PWMDTY7 - PWM Channel Duty 7 Register; 0x00000323 
    union {
      byte Byte;
    } PWMDTY7STR;
    #define PWMDTY7                     _PWMDTY67.Overlap_STR.PWMDTY7STR.Byte
    
    

  } Overlap_STR;

} PWMDTY67STR;
extern volatile PWMDTY67STR _PWMDTY67 @(REG_BASE + 0x00000322);
#define PWMDTY67                        _PWMDTY67.Word



 PWMSDN - PWM Shutdown Register; 0x00000324 
typedef union {
  byte Byte;
  struct {
    byte PWM7ENA     1;                                        PWM emergency shutdown Enable 
    byte PWM7INL     1;                                        PWM shutdown active input level for ch. 7 
    byte PWM7IN      1;                                        PWM channel 7 input status 
    byte             1; 
    byte PWMLVL      1;                                        PWM shutdown output Level 
    byte PWMRSTRT    1;                                        PWM Restart 
    byte PWMIE       1;                                        PWM Interrupt Enable 
    byte PWMIF       1;                                        PWM Interrupt Flag 
  } Bits;
} PWMSDNSTR;
extern volatile PWMSDNSTR _PWMSDN @(REG_BASE + 0x00000324);
#define PWMSDN                          _PWMSDN.Byte
#define PWMSDN_PWM7ENA                  _PWMSDN.Bits.PWM7ENA
#define PWMSDN_PWM7INL                  _PWMSDN.Bits.PWM7INL
#define PWMSDN_PWM7IN                   _PWMSDN.Bits.PWM7IN
#define PWMSDN_PWMLVL                   _PWMSDN.Bits.PWMLVL
#define PWMSDN_PWMRSTRT                 _PWMSDN.Bits.PWMRSTRT
#define PWMSDN_PWMIE                    _PWMSDN.Bits.PWMIE
#define PWMSDN_PWMIF                    _PWMSDN.Bits.PWMIF

#define PWMSDN_PWM7ENA_MASK             1
#define PWMSDN_PWM7INL_MASK             2
#define PWMSDN_PWM7IN_MASK              4
#define PWMSDN_PWMLVL_MASK              16
#define PWMSDN_PWMRSTRT_MASK            32
#define PWMSDN_PWMIE_MASK               64
#define PWMSDN_PWMIF_MASK               128


 PITCFLMT - PIT Control and Force Load Micro Timer Register; 0x00000340 
typedef union {
  byte Byte;
  struct {
    byte PFLMT0      1;                                        PIT Force Load Bits for Micro Timer 0 
    byte PFLMT1      1;                                        PIT Force Load Bits for Micro Timer 1 
    byte             1; 
    byte             1; 
    byte             1; 
    byte PITFRZ      1;                                        PIT Counter Freeze while in Freeze Mode Bit 
    byte PITSWAI     1;                                        PIT Stop in Wait Mode Bit 
    byte PITE        1;                                        PIT Module Enable Bit 
  } Bits;
  struct {
    byte grpPFLMT 2;
    byte         1;
    byte         1;
    byte         1;
    byte         1;
    byte         1;
    byte         1;
  } MergedBits;
} PITCFLMTSTR;
extern volatile PITCFLMTSTR _PITCFLMT @(REG_BASE + 0x00000340);
#define PITCFLMT                        _PITCFLMT.Byte
#define PITCFLMT_PFLMT0                 _PITCFLMT.Bits.PFLMT0
#define PITCFLMT_PFLMT1                 _PITCFLMT.Bits.PFLMT1
#define PITCFLMT_PITFRZ                 _PITCFLMT.Bits.PITFRZ
#define PITCFLMT_PITSWAI                _PITCFLMT.Bits.PITSWAI
#define PITCFLMT_PITE                   _PITCFLMT.Bits.PITE
#define PITCFLMT_PFLMT                  _PITCFLMT.MergedBits.grpPFLMT

#define PITCFLMT_PFLMT0_MASK            1
#define PITCFLMT_PFLMT1_MASK            2
#define PITCFLMT_PITFRZ_MASK            32
#define PITCFLMT_PITSWAI_MASK           64
#define PITCFLMT_PITE_MASK              128
#define PITCFLMT_PFLMT_MASK             3
#define PITCFLMT_PFLMT_BITNUM           0


 PITFLT - PIT Force Load Timer Register; 0x00000341 
typedef union {
  byte Byte;
  struct {
    byte PFLT0       1;                                        PIT Force Load Bits for Timer 0 
    byte PFLT1       1;                                        PIT Force Load Bits for Timer 1 
    byte PFLT2       1;                                        PIT Force Load Bits for Timer 2 
    byte PFLT3       1;                                        PIT Force Load Bits for Timer 3 
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
  } Bits;
  struct {
    byte grpPFLT 4;
    byte         1;
    byte         1;
    byte         1;
    byte         1;
  } MergedBits;
} PITFLTSTR;
extern volatile PITFLTSTR _PITFLT @(REG_BASE + 0x00000341);
#define PITFLT                          _PITFLT.Byte
#define PITFLT_PFLT0                    _PITFLT.Bits.PFLT0
#define PITFLT_PFLT1                    _PITFLT.Bits.PFLT1
#define PITFLT_PFLT2                    _PITFLT.Bits.PFLT2
#define PITFLT_PFLT3                    _PITFLT.Bits.PFLT3
#define PITFLT_PFLT                     _PITFLT.MergedBits.grpPFLT

#define PITFLT_PFLT0_MASK               1
#define PITFLT_PFLT1_MASK               2
#define PITFLT_PFLT2_MASK               4
#define PITFLT_PFLT3_MASK               8
#define PITFLT_PFLT_MASK                15
#define PITFLT_PFLT_BITNUM              0


 PITCE - PIT Channel Enable Register; 0x00000342 
typedef union {
  byte Byte;
  struct {
    byte PCE0        1;                                        PIT Enable Bits for Timer Channel 0 
    byte PCE1        1;                                        PIT Enable Bits for Timer Channel 1 
    byte PCE2        1;                                        PIT Enable Bits for Timer Channel 2 
    byte PCE3        1;                                        PIT Enable Bits for Timer Channel 3 
    byte             1; 
    byte             1; 
    byte             1; 
    byte             1; 
  } Bits;
  struct {
    byte grpPCE  4;
    byte         1;
    byte         1;
    byte         1;
    byte         1;
  } MergedBits;
} PITCESTR;
extern volatile PITCESTR _PITCE @(REG_BASE + 0x00000342);
#define PITCE                           _PITCE.Byte
#define PITCE_PCE0                      _PITCE.Bits.PCE0
#define PITCE_PCE1                      _PITCE.Bits.PCE1
#define PITCE_PCE2                      _PITCE.Bits.PCE2
#define PITCE_PCE3                      _PITCE.Bits.PCE3
#define PITCE_PCE                       _PITCE.MergedBits.grpPCE

#define PITCE_PCE0_MASK                 1
#define PITCE_PCE1_MASK                 2
#define PITCE_PCE2_MASK                 4
#define PITCE_PCE3_MASK                 8
#define PITCE_PCE_MASK                  15
#define PITCE_PCE_BITNUM                0


