gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
#define PITMTLD1_PMTLD0_MASK            1
#define PITMTLD1_PMTLD1_MASK            2
#define PITMTLD1_PMTLD2_MASK            4
#define PITMTLD1_PMTLD3_MASK            8
#define PITMTLD1_PMTLD4_MASK            16
#define PITMTLD1_PMTLD5_MASK            32
#define PITMTLD1_PMTLD6_MASK            64
#define PITMTLD1_PMTLD7_MASK            128


 PITLD0 - PIT Load Register 0; 0x00000348 
typedef union {
  word Word;
} PITLD0STR;
extern volatile PITLD0STR _PITLD0 @(REG_BASE + 0x00000348);
#define PITLD0                          _PITLD0.Word



 PITCNT0 - PIT Count Register 0; 0x0000034A 
typedef union {
  word Word;
} PITCNT0STR;
extern volatile PITCNT0STR _PITCNT0 @(REG_BASE + 0x0000034A);
#define PITCNT0                         _PITCNT0.Word



 PITLD1 - PIT Load Register 1; 0x0000034C 
typedef union {
  word Word;
} PITLD1STR;
extern volatile PITLD1STR _PITLD1 @(REG_BASE + 0x0000034C);
#define PITLD1                          _PITLD1.Word



 PITCNT1 - PIT Count Register 1; 0x0000034E 
typedef union {
  word Word;
} PITCNT1STR;
extern volatile PITCNT1STR _PITCNT1 @(REG_BASE + 0x0000034E);
#define PITCNT1                         _PITCNT1.Word



 PITLD2 - PIT Load Register 2; 0x00000350 
typedef union {
  word Word;
} PITLD2STR;
extern volatile PITLD2STR _PITLD2 @(REG_BASE + 0x00000350);
#define PITLD2                          _PITLD2.Word



 PITCNT2 - PIT Count Register 2; 0x00000352 
typedef union {
  word Word;
} PITCNT2STR;
extern volatile PITCNT2STR _PITCNT2 @(REG_BASE + 0x00000352);
#define PITCNT2                         _PITCNT2.Word



 PITLD3 - PIT Load Register 3; 0x00000354 
typedef union {
  word Word;
} PITLD3STR;
extern volatile PITLD3STR _PITLD3 @(REG_BASE + 0x00000354);
#define PITLD3                          _PITLD3.Word



 PITCNT3 - PIT Count Register 3; 0x00000356 
typedef union {
  word Word;
} PITCNT3STR;
extern volatile PITCNT3STR _PITCNT3 @(REG_BASE + 0x00000356);
#define PITCNT3                         _PITCNT3.Word



 XGMCTL - XGATE Module Control Register; 0x00000380 
typedef union {
  word Word;
  struct {
    word XGIE        1;                                        XGATE Interrupt Enable 
    word XGSWEIF     1;                                        XGATE Software Error Interrupt Flag 
    word             1; 
    word XGFACT      1;                                        Fake XGATE Activity 
    word XGSS        1;                                        XGATE Single Step 
    word XGDBG       1;                                        XGATE Debug Mode 
    word XGFRZ       1;                                        Halt XGATE in Freeze Mode 
    word XGE         1;                                        XGATE Module Enable 
    word XGIEM       1;                                        XGIE Mask 
    word XGSWEIFM    1;                                        XGSWEIF Mask 
    word             1; 
    word XGFACTM     1;                                        XGFACT Mask 
    word XGSSM       1;                                        XGSS Mask 
    word XGDBGM      1;                                        XGDBG Mask 
    word XGFRZM      1;                                        XGFRZ Mask 
    word XGEM        1;                                        XGE Mask 
  } Bits;
} XGMCTLSTR;
extern volatile XGMCTLSTR _XGMCTL @(REG_BASE + 0x00000380);
#define XGMCTL                          _XGMCTL.Word
#define XGMCTL_XGIE                     _XGMCTL.Bits.XGIE
#define XGMCTL_XGSWEIF                  _XGMCTL.Bits.XGSWEIF
#define XGMCTL_XGFACT                   _XGMCTL.Bits.XGFACT
#define XGMCTL_XGSS                     _XGMCTL.Bits.XGSS
#define XGMCTL_XGDBG                    _XGMCTL.Bits.XGDBG
#define XGMCTL_XGFRZ                    _XGMCTL.Bits.XGFRZ
#define XGMCTL_XGE                      _XGMCTL.Bits.XGE
#define XGMCTL_XGIEM                    _XGMCTL.Bits.XGIEM
#define XGMCTL_XGSWEIFM                 _XGMCTL.Bits.XGSWEIFM
#define XGMCTL_XGFACTM                  _XGMCTL.Bits.XGFACTM
#define XGMCTL_XGSSM                    _XGMCTL.Bits.XGSSM
#define XGMCTL_XGDBGM                   _XGMCTL.Bits.XGDBGM
#define XGMCTL_XGFRZM                   _XGMCTL.Bits.XGFRZM
#define XGMCTL_XGEM                     _XGMCTL.Bits.XGEM

#define XGMCTL_XGIE_MASK                1
#define XGMCTL_XGSWEIF_MASK             2
#define XGMCTL_XGFACT_MASK              8
#define XGMCTL_XGSS_MASK                16
#define XGMCTL_XGDBG_MASK               32
#define XGMCTL_XGFRZ_MASK               64
#define XGMCTL_XGE_MASK                 128
#define XGMCTL_XGIEM_MASK               256
#define XGMCTL_XGSWEIFM_MASK            512
#define XGMCTL_XGFACTM_MASK             2048
#define XGMCTL_XGSSM_MASK               4096
#define XGMCTL_XGDBGM_MASK              8192
#define XGMCTL_XGFRZM_MASK              16384
#define XGMCTL_XGEM_MASK                32768


 XGCHID - XGATE Channel ID Register; 0x00000382 
typedef union {
  byte Byte;
  struct {
    byte XGCHIDGrp   7;                                        Request Identifier 
    byte             1; 
  } Bits;
} XGCHIDSTR;
extern volatile XGCHIDSTR _XGCHID @(REG_BASE + 0x00000382);
#define XGCHID                          _XGCHID.Byte
#define XGCHID_XGCHIDGrp                _XGCHID.Bits.XGCHIDGrp

#define XGCHID_XGCHIDGrp_MASK           127
#define XGCHID_XGCHIDGrp_BITNUM         0


 XGVBR - XGATE Vector Base Address Register; 0x00000386 
typedef union {
  word Word;
  struct {
    word             1; 
    word XGVBRGrp    15;                                       Vector Base Address 
  } Bits;
} XGVBRSTR;
extern volatile XGVBRSTR _XGVBR @(REG_BASE + 0x00000386);
#define XGVBR                           _XGVBR.Word
#define XGVBR_XGVBRGrp                  _XGVBR.Bits.XGVBRGrp

#define XGVBR_XGVBRGrp_MASK             65534
#define XGVBR_XGVBRGrp_BITNUM           1


 XGIF0 - XGATE Channel Interrupt Flag Vector 0; 0x00000388 
typedef union {
  word Word;
  struct {
    word XGIF_70     1;                                        Channel Interrupt Flag 70 
    word XGIF_71     1;                                        Channel Interrupt Flag 71 
    word XGIF_72     1;                                        Channel Interrupt Flag 72 
    word XGIF_73     1;                                        Channel Interrupt Flag 73 
    word XGIF_74     1;                                        Channel Interrupt Flag 74 
    word XGIF_75     1;                                        Channel Interrupt Flag 75 
    word XGIF_76     1;                                        Channel Interrupt Flag 76 
    word XGIF_77     1;                                        Channel Interrupt Flag 77 
    word XGIF_78     1;                                        Channel Interrupt Flag 78 
    word             1; 
    word             1; 
    word             1; 
    word             1; 
    word             1; 
    word             1; 
    word             1; 
  } Bits;
  struct {
    word grpXGIF__70 9;
    word         1;
    word         1;
    word         1;
    word         1;
    word         1;
    word         1;
    word         1;
  } MergedBits;
} XGIF0STR;
