gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
extern volatile XGIF0STR _XGIF0 @(REG_BASE + 0x00000388);
#define XGIF0                           _XGIF0.Word
#define XGIF0_XGIF_70                   _XGIF0.Bits.XGIF_70
#define XGIF0_XGIF_71                   _XGIF0.Bits.XGIF_71
#define XGIF0_XGIF_72                   _XGIF0.Bits.XGIF_72
#define XGIF0_XGIF_73                   _XGIF0.Bits.XGIF_73
#define XGIF0_XGIF_74                   _XGIF0.Bits.XGIF_74
#define XGIF0_XGIF_75                   _XGIF0.Bits.XGIF_75
#define XGIF0_XGIF_76                   _XGIF0.Bits.XGIF_76
#define XGIF0_XGIF_77                   _XGIF0.Bits.XGIF_77
#define XGIF0_XGIF_78                   _XGIF0.Bits.XGIF_78
 XGIF_ARR Access 8 XGIFx registers in an array 
#define XGIF_ARR                        ((volatile word ) &XGIF0)
#define XGIF0_XGIF__70                  _XGIF0.MergedBits.grpXGIF__70
#define XGIF0_XGIF_                     XGIF0_XGIF__70

#define XGIF0_XGIF_70_MASK              1
#define XGIF0_XGIF_71_MASK              2
#define XGIF0_XGIF_72_MASK              4
#define XGIF0_XGIF_73_MASK              8
#define XGIF0_XGIF_74_MASK              16
#define XGIF0_XGIF_75_MASK              32
#define XGIF0_XGIF_76_MASK              64
#define XGIF0_XGIF_77_MASK              128
#define XGIF0_XGIF_78_MASK              256
#define XGIF0_XGIF__70_MASK             511
#define XGIF0_XGIF__70_BITNUM           0


 XGIF1 - XGATE Channel Interrupt Flag Vector 1; 0x0000038A 
typedef union {
  word Word;
  struct {
    word XGIF_60     1;                                        Channel Interrupt Flag 60 
    word XGIF_61     1;                                        Channel Interrupt Flag 61 
    word XGIF_62     1;                                        Channel Interrupt Flag 62 
    word XGIF_63     1;                                        Channel Interrupt Flag 63 
    word XGIF_64     1;                                        Channel Interrupt Flag 64 
    word XGIF_65     1;                                        Channel Interrupt Flag 65 
    word XGIF_66     1;                                        Channel Interrupt Flag 66 
    word XGIF_67     1;                                        Channel Interrupt Flag 67 
    word XGIF_68     1;                                        Channel Interrupt Flag 68 
    word XGIF_69     1;                                        Channel Interrupt Flag 69 
    word XGIF_6A     1;                                        Channel Interrupt Flag 6A 
    word XGIF_6B     1;                                        Channel Interrupt Flag 6B 
    word XGIF_6C     1;                                        Channel Interrupt Flag 6C 
    word XGIF_6D     1;                                        Channel Interrupt Flag 6D 
    word XGIF_6E     1;                                        Channel Interrupt Flag 6E 
    word XGIF_6F     1;                                        Channel Interrupt Flag 6F 
  } Bits;
  struct {
    word grpXGIF__60 10;
    word         1;
    word         1;
    word         1;
    word         1;
    word         1;
    word         1;
  } MergedBits;
} XGIF1STR;
extern volatile XGIF1STR _XGIF1 @(REG_BASE + 0x0000038A);
#define XGIF1                           _XGIF1.Word
#define XGIF1_XGIF_60                   _XGIF1.Bits.XGIF_60
#define XGIF1_XGIF_61                   _XGIF1.Bits.XGIF_61
#define XGIF1_XGIF_62                   _XGIF1.Bits.XGIF_62
#define XGIF1_XGIF_63                   _XGIF1.Bits.XGIF_63
#define XGIF1_XGIF_64                   _XGIF1.Bits.XGIF_64
#define XGIF1_XGIF_65                   _XGIF1.Bits.XGIF_65
#define XGIF1_XGIF_66                   _XGIF1.Bits.XGIF_66
#define XGIF1_XGIF_67                   _XGIF1.Bits.XGIF_67
#define XGIF1_XGIF_68                   _XGIF1.Bits.XGIF_68
#define XGIF1_XGIF_69                   _XGIF1.Bits.XGIF_69
#define XGIF1_XGIF_6A                   _XGIF1.Bits.XGIF_6A
#define XGIF1_XGIF_6B                   _XGIF1.Bits.XGIF_6B
#define XGIF1_XGIF_6C                   _XGIF1.Bits.XGIF_6C
#define XGIF1_XGIF_6D                   _XGIF1.Bits.XGIF_6D
#define XGIF1_XGIF_6E                   _XGIF1.Bits.XGIF_6E
#define XGIF1_XGIF_6F                   _XGIF1.Bits.XGIF_6F
#define XGIF1_XGIF__60                  _XGIF1.MergedBits.grpXGIF__60
#define XGIF1_XGIF_                     XGIF1_XGIF__60

#define XGIF1_XGIF_60_MASK              1
#define XGIF1_XGIF_61_MASK              2
#define XGIF1_XGIF_62_MASK              4
#define XGIF1_XGIF_63_MASK              8
#define XGIF1_XGIF_64_MASK              16
#define XGIF1_XGIF_65_MASK              32
#define XGIF1_XGIF_66_MASK              64
#define XGIF1_XGIF_67_MASK              128
#define XGIF1_XGIF_68_MASK              256
#define XGIF1_XGIF_69_MASK              512
#define XGIF1_XGIF_6A_MASK              1024
#define XGIF1_XGIF_6B_MASK              2048
#define XGIF1_XGIF_6C_MASK              4096
#define XGIF1_XGIF_6D_MASK              8192
#define XGIF1_XGIF_6E_MASK              16384
#define XGIF1_XGIF_6F_MASK              32768
#define XGIF1_XGIF__60_MASK             1023
#define XGIF1_XGIF__60_BITNUM           0


 XGIF2 - XGATE Channel Interrupt Flag Vector 2; 0x0000038C 
typedef union {
  word Word;
  struct {
    word XGIF_50     1;                                        Channel Interrupt Flag 50 
    word XGIF_51     1;                                        Channel Interrupt Flag 51 
    word XGIF_52     1;                                        Channel Interrupt Flag 52 
    word XGIF_53     1;                                        Channel Interrupt Flag 53 
    word XGIF_54     1;                                        Channel Interrupt Flag 54 
    word XGIF_55     1;                                        Channel Interrupt Flag 55 
    word XGIF_56     1;                                        Channel Interrupt Flag 56 
    word XGIF_57     1;                                        Channel Interrupt Flag 57 
    word XGIF_58     1;                                        Channel Interrupt Flag 58 
    word XGIF_59     1;                                        Channel Interrupt Flag 59 
    word XGIF_5A     1;                                        Channel Interrupt Flag 5A 
    word XGIF_5B     1;                                        Channel Interrupt Flag 5B 
    word XGIF_5C     1;                                        Channel Interrupt Flag 5C 
    word XGIF_5D     1;                                        Channel Interrupt Flag 5D 
    word XGIF_5E     1;                                        Channel Interrupt Flag 5E 
    word XGIF_5F     1;                                        Channel Interrupt Flag 5F 
  } Bits;
  struct {
    word grpXGIF__50 10;
    word         1;
    word         1;
    word         1;
    word         1;
    word         1;
    word         1;
  } MergedBits;
} XGIF2STR;
