gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
extern volatile XGIF2STR _XGIF2 @(REG_BASE + 0x0000038C);
#define XGIF2                           _XGIF2.Word
#define XGIF2_XGIF_50                   _XGIF2.Bits.XGIF_50
#define XGIF2_XGIF_51                   _XGIF2.Bits.XGIF_51
#define XGIF2_XGIF_52                   _XGIF2.Bits.XGIF_52
#define XGIF2_XGIF_53                   _XGIF2.Bits.XGIF_53
#define XGIF2_XGIF_54                   _XGIF2.Bits.XGIF_54
#define XGIF2_XGIF_55                   _XGIF2.Bits.XGIF_55
#define XGIF2_XGIF_56                   _XGIF2.Bits.XGIF_56
#define XGIF2_XGIF_57                   _XGIF2.Bits.XGIF_57
#define XGIF2_XGIF_58                   _XGIF2.Bits.XGIF_58
#define XGIF2_XGIF_59                   _XGIF2.Bits.XGIF_59
#define XGIF2_XGIF_5A                   _XGIF2.Bits.XGIF_5A
#define XGIF2_XGIF_5B                   _XGIF2.Bits.XGIF_5B
#define XGIF2_XGIF_5C                   _XGIF2.Bits.XGIF_5C
#define XGIF2_XGIF_5D                   _XGIF2.Bits.XGIF_5D
#define XGIF2_XGIF_5E                   _XGIF2.Bits.XGIF_5E
#define XGIF2_XGIF_5F                   _XGIF2.Bits.XGIF_5F
#define XGIF2_XGIF__50                  _XGIF2.MergedBits.grpXGIF__50
#define XGIF2_XGIF_                     XGIF2_XGIF__50

#define XGIF2_XGIF_50_MASK              1
#define XGIF2_XGIF_51_MASK              2
#define XGIF2_XGIF_52_MASK              4
#define XGIF2_XGIF_53_MASK              8
#define XGIF2_XGIF_54_MASK              16
#define XGIF2_XGIF_55_MASK              32
#define XGIF2_XGIF_56_MASK              64
#define XGIF2_XGIF_57_MASK              128
#define XGIF2_XGIF_58_MASK              256
#define XGIF2_XGIF_59_MASK              512
#define XGIF2_XGIF_5A_MASK              1024
#define XGIF2_XGIF_5B_MASK              2048
#define XGIF2_XGIF_5C_MASK              4096
#define XGIF2_XGIF_5D_MASK              8192
#define XGIF2_XGIF_5E_MASK              16384
#define XGIF2_XGIF_5F_MASK              32768
#define XGIF2_XGIF__50_MASK             1023
#define XGIF2_XGIF__50_BITNUM           0


 XGIF3 - XGATE Channel Interrupt Flag Vector 3; 0x0000038E 
typedef union {
  word Word;
  struct {
    word XGIF_40     1;                                        Channel Interrupt Flag 40 
    word XGIF_41     1;                                        Channel Interrupt Flag 41 
    word XGIF_42     1;                                        Channel Interrupt Flag 42 
    word XGIF_43     1;                                        Channel Interrupt Flag 43 
    word XGIF_44     1;                                        Channel Interrupt Flag 44 
    word XGIF_45     1;                                        Channel Interrupt Flag 45 
    word XGIF_46     1;                                        Channel Interrupt Flag 46 
    word XGIF_47     1;                                        Channel Interrupt Flag 47 
    word XGIF_48     1;                                        Channel Interrupt Flag 48 
    word XGIF_49     1;                                        Channel Interrupt Flag 49 
    word XGIF_4A     1;                                        Channel Interrupt Flag 4A 
    word XGIF_4B     1;                                        Channel Interrupt Flag 4B 
    word XGIF_4C     1;                                        Channel Interrupt Flag 4C 
    word XGIF_4D     1;                                        Channel Interrupt Flag 4D 
    word XGIF_4E     1;                                        Channel Interrupt Flag 4E 
    word XGIF_4F     1;                                        Channel Interrupt Flag 4F 
  } Bits;
  struct {
    word grpXGIF__40 10;
    word         1;
    word         1;
    word         1;
    word         1;
    word         1;
    word         1;
  } MergedBits;
} XGIF3STR;
extern volatile XGIF3STR _XGIF3 @(REG_BASE + 0x0000038E);
#define XGIF3                           _XGIF3.Word
#define XGIF3_XGIF_40                   _XGIF3.Bits.XGIF_40
#define XGIF3_XGIF_41                   _XGIF3.Bits.XGIF_41
#define XGIF3_XGIF_42                   _XGIF3.Bits.XGIF_42
#define XGIF3_XGIF_43                   _XGIF3.Bits.XGIF_43
#define XGIF3_XGIF_44                   _XGIF3.Bits.XGIF_44
#define XGIF3_XGIF_45                   _XGIF3.Bits.XGIF_45
#define XGIF3_XGIF_46                   _XGIF3.Bits.XGIF_46
#define XGIF3_XGIF_47                   _XGIF3.Bits.XGIF_47
#define XGIF3_XGIF_48                   _XGIF3.Bits.XGIF_48
#define XGIF3_XGIF_49                   _XGIF3.Bits.XGIF_49
#define XGIF3_XGIF_4A                   _XGIF3.Bits.XGIF_4A
#define XGIF3_XGIF_4B                   _XGIF3.Bits.XGIF_4B
#define XGIF3_XGIF_4C                   _XGIF3.Bits.XGIF_4C
#define XGIF3_XGIF_4D                   _XGIF3.Bits.XGIF_4D
#define XGIF3_XGIF_4E                   _XGIF3.Bits.XGIF_4E
#define XGIF3_XGIF_4F                   _XGIF3.Bits.XGIF_4F
#define XGIF3_XGIF__40                  _XGIF3.MergedBits.grpXGIF__40
#define XGIF3_XGIF_                     XGIF3_XGIF__40

#define XGIF3_XGIF_40_MASK              1
#define XGIF3_XGIF_41_MASK              2
#define XGIF3_XGIF_42_MASK              4
#define XGIF3_XGIF_43_MASK              8
#define XGIF3_XGIF_44_MASK              16
#define XGIF3_XGIF_45_MASK              32
#define XGIF3_XGIF_46_MASK              64
#define XGIF3_XGIF_47_MASK              128
#define XGIF3_XGIF_48_MASK              256
#define XGIF3_XGIF_49_MASK              512
#define XGIF3_XGIF_4A_MASK              1024
#define XGIF3_XGIF_4B_MASK              2048
#define XGIF3_XGIF_4C_MASK              4096
#define XGIF3_XGIF_4D_MASK              8192
#define XGIF3_XGIF_4E_MASK              16384
#define XGIF3_XGIF_4F_MASK              32768
#define XGIF3_XGIF__40_MASK             1023
#define XGIF3_XGIF__40_BITNUM           0


 XGIF4 - XGATE Channel Interrupt Flag Vector 4; 0x00000390 
typedef union {
  word Word;
  struct {
    word XGIF_30     1;                                        Channel Interrupt Flag 30 
    word XGIF_31     1;                                        Channel Interrupt Flag 31 
    word XGIF_32     1;                                        Channel Interrupt Flag 32 
    word XGIF_33     1;                                        Channel Interrupt Flag 33 
    word XGIF_34     1;                                        Channel Interrupt Flag 34 
    word XGIF_35     1;                                        Channel Interrupt Flag 35 
    word XGIF_36     1;                                        Channel Interrupt Flag 36 
    word XGIF_37     1;                                        Channel Interrupt Flag 37 
    word XGIF_38     1;                                        Channel Interrupt Flag 38 
    word XGIF_39     1;                                        Channel Interrupt Flag 39 
    word XGIF_3A     1;                                        Channel Interrupt Flag 3A 
    word XGIF_3B     1;                                        Channel Interrupt Flag 3B 
    word XGIF_3C     1;                                        Channel Interrupt Flag 3C 
    word XGIF_3D     1;                                        Channel Interrupt Flag 3D 
    word XGIF_3E     1;                                        Channel Interrupt Flag 3E 
    word XGIF_3F     1;                                        Channel Interrupt Flag 3F 
  } Bits;
  struct {
    word grpXGIF__30 10;
    word         1;
    word         1;
    word         1;
    word         1;
    word         1;
    word         1;
  } MergedBits;
} XGIF4STR;
extern volatile XGIF4STR _XGIF4 @(REG_BASE + 0x00000390);
#define XGIF4                           _XGIF4.Word
#define XGIF4_XGIF_30                   _XGIF4.Bits.XGIF_30
#define XGIF4_XGIF_31                   _XGIF4.Bits.XGIF_31
#define XGIF4_XGIF_32                   _XGIF4.Bits.XGIF_32
#define XGIF4_XGIF_33                   _XGIF4.Bits.XGIF_33
#define XGIF4_XGIF_34                   _XGIF4.Bits.XGIF_34
#define XGIF4_XGIF_35                   _XGIF4.Bits.XGIF_35
#define XGIF4_XGIF_36                   _XGIF4.Bits.XGIF_36
#define XGIF4_XGIF_37                   _XGIF4.Bits.XGIF_37
#define XGIF4_XGIF_38                   _XGIF4.Bits.XGIF_38
#define XGIF4_XGIF_39                   _XGIF4.Bits.XGIF_39
#define XGIF4_XGIF_3A                   _XGIF4.Bits.XGIF_3A
#define XGIF4_XGIF_3B                   _XGIF4.Bits.XGIF_3B
#define XGIF4_XGIF_3C                   _XGIF4.Bits.XGIF_3C
#define XGIF4_XGIF_3D                   _XGIF4.Bits.XGIF_3D
#define XGIF4_XGIF_3E                   _XGIF4.Bits.XGIF_3E
#define XGIF4_XGIF_3F                   _XGIF4.Bits.XGIF_3F
#define XGIF4_XGIF__30                  _XGIF4.MergedBits.grpXGIF__30
#define XGIF4_XGIF_                     XGIF4_XGIF__30

#define XGIF4_XGIF_30_MASK              1
#define XGIF4_XGIF_31_MASK              2
#define XGIF4_XGIF_32_MASK              4
#define XGIF4_XGIF_33_MASK              8
#define XGIF4_XGIF_34_MASK              16
#define XGIF4_XGIF_35_MASK              32
#define XGIF4_XGIF_36_MASK              64
#define XGIF4_XGIF_37_MASK              128
#define XGIF4_XGIF_38_MASK              256
#define XGIF4_XGIF_39_MASK              512
#define XGIF4_XGIF_3A_MASK              1024
#define XGIF4_XGIF_3B_MASK              2048
#define XGIF4_XGIF_3C_MASK              4096
#define XGIF4_XGIF_3D_MASK              8192
#define XGIF4_XGIF_3E_MASK              16384
#define XGIF4_XGIF_3F_MASK              32768
#define XGIF4_XGIF__30_MASK             1023
#define XGIF4_XGIF__30_BITNUM           0


 XGIF5 - XGATE Channel Interrupt Flag Vector 5; 0x00000392 
typedef union {
  word Word;
  struct {
    word XGIF_20     1;                                        Channel Interrupt Flag 20 
    word XGIF_21     1;                                        Channel Interrupt Flag 21 
    word XGIF_22     1;                                        Channel Interrupt Flag 22 
    word XGIF_23     1;                                        Channel Interrupt Flag 23 
    word XGIF_24     1;                                        Channel Interrupt Flag 24 
    word XGIF_25     1;                                        Channel Interrupt Flag 25 
    word XGIF_26     1;                                        Channel Interrupt Flag 26 
    word XGIF_27     1;                                        Channel Interrupt Flag 27 
    word XGIF_28     1;                                        Channel Interrupt Flag 28 
    word XGIF_29     1;                                        Channel Interrupt Flag 29 
    word XGIF_2A     1;                                        Channel Interrupt Flag 2A 
    word XGIF_2B     1;                                        Channel Interrupt Flag 2B 
    word XGIF_2C     1;                                        Channel Interrupt Flag 2C 
    word XGIF_2D     1;                                        Channel Interrupt Flag 2D 
    word XGIF_2E     1;                                        Channel Interrupt Flag 2E 
    word XGIF_2F     1;                                        Channel Interrupt Flag 2F 
  } Bits;
  struct {
    word grpXGIF__20 10;
    word         1;
    word         1;
    word         1;
    word         1;
    word         1;
    word         1;
  } MergedBits;
} XGIF5STR;
extern volatile XGIF5STR _XGIF5 @(REG_BASE + 0x00000392);
#define XGIF5                           _XGIF5.Word
#define XGIF5_XGIF_20                   _XGIF5.Bits.XGIF_20
#define XGIF5_XGIF_21                   _XGIF5.Bits.XGIF_21
#define XGIF5_XGIF_22                   _XGIF5.Bits.XGIF_22
#define XGIF5_XGIF_23                   _XGIF5.Bits.XGIF_23
#define XGIF5_XGIF_24                   _XGIF5.Bits.XGIF_24
#define XGIF5_XGIF_25                   _XGIF5.Bits.XGIF_25
#define XGIF5_XGIF_26                   _XGIF5.Bits.XGIF_26
#define XGIF5_XGIF_27                   _XGIF5.Bits.XGIF_27
#define XGIF5_XGIF_28                   _XGIF5.Bits.XGIF_28
#define XGIF5_XGIF_29                   _XGIF5.Bits.XGIF_29
#define XGIF5_XGIF_2A                   _XGIF5.Bits.XGIF_2A
#define XGIF5_XGIF_2B                   _XGIF5.Bits.XGIF_2B
#define XGIF5_XGIF_2C                   _XGIF5.Bits.XGIF_2C
#define XGIF5_XGIF_2D                   _XGIF5.Bits.XGIF_2D
#define XGIF5_XGIF_2E                   _XGIF5.Bits.XGIF_2E
#define XGIF5_XGIF_2F                   _XGIF5.Bits.XGIF_2F
#define XGIF5_XGIF__20                  _XGIF5.MergedBits.grpXGIF__20
#define XGIF5_XGIF_                     XGIF5_XGIF__20

#define XGIF5_XGIF_20_MASK              1
#define XGIF5_XGIF_21_MASK              2
#define XGIF5_XGIF_22_MASK              4
#define XGIF5_XGIF_23_MASK              8
#define XGIF5_XGIF_24_MASK              16
#define XGIF5_XGIF_25_MASK              32
#define XGIF5_XGIF_26_MASK              64
#define XGIF5_XGIF_27_MASK              128
#define XGIF5_XGIF_28_MASK              256
#define XGIF5_XGIF_29_MASK              512
#define XGIF5_XGIF_2A_MASK              1024
#define XGIF5_XGIF_2B_MASK              2048
#define XGIF5_XGIF_2C_MASK              4096
#define XGIF5_XGIF_2D_MASK              8192
#define XGIF5_XGIF_2E_MASK              16384
#define XGIF5_XGIF_2F_MASK              32768
#define XGIF5_XGIF__20_MASK             1023
#define XGIF5_XGIF__20_BITNUM           0


 XGIF6 - XGATE Channel Interrupt Flag Vector 6; 0x00000394 
typedef union {
  word Word;
  struct {
    word XGIF_10     1;                                        Channel Interrupt Flag 10 
    word XGIF_11     1;                                        Channel Interrupt Flag 11 
    word XGIF_12     1;                                        Channel Interrupt Flag 12 
    word XGIF_13     1;                                        Channel Interrupt Flag 13 
    word XGIF_14     1;                                        Channel Interrupt Flag 14 
    word XGIF_15     1;                                        Channel Interrupt Flag 15 
    word XGIF_16     1;                                        Channel Interrupt Flag 16 
    word XGIF_17     1;                                        Channel Interrupt Flag 17 
    word XGIF_18     1;                                        Channel Interrupt Flag 18 
    word XGIF_19     1;                                        Channel Interrupt Flag 19 
    word XGIF_1A     1;                                        Channel Interrupt Flag 1A 
    word XGIF_1B     1;                                        Channel Interrupt Flag 1B 
    word XGIF_1C     1;                                        Channel Interrupt Flag 1C 
    word XGIF_1D     1;                                        Channel Interrupt Flag 1D 
    word XGIF_1E     1;                                        Channel Interrupt Flag 1E 
    word XGIF_1F     1;                                        Channel Interrupt Flag 1F 
  } Bits;
  struct {
    word grpXGIF__10 10;
    word         1;
    word         1;
    word         1;
    word         1;
    word         1;
    word         1;
  } MergedBits;
} XGIF6STR;
extern volatile XGIF6STR _XGIF6 @(REG_BASE + 0x00000394);
#define XGIF6                           _XGIF6.Word
#define XGIF6_XGIF_10                   _XGIF6.Bits.XGIF_10
#define XGIF6_XGIF_11                   _XGIF6.Bits.XGIF_11
#define XGIF6_XGIF_12                   _XGIF6.Bits.XGIF_12
#define XGIF6_XGIF_13                   _XGIF6.Bits.XGIF_13
#define XGIF6_XGIF_14                   _XGIF6.Bits.XGIF_14
#define XGIF6_XGIF_15                   _XGIF6.Bits.XGIF_15
#define XGIF6_XGIF_16                   _XGIF6.Bits.XGIF_16
#define XGIF6_XGIF_17                   _XGIF6.Bits.XGIF_17
#define XGIF6_XGIF_18                   _XGIF6.Bits.XGIF_18
#define XGIF6_XGIF_19                   _XGIF6.Bits.XGIF_19
#define XGIF6_XGIF_1A                   _XGIF6.Bits.XGIF_1A
#define XGIF6_XGIF_1B                   _XGIF6.Bits.XGIF_1B
#define XGIF6_XGIF_1C                   _XGIF6.Bits.XGIF_1C
#define XGIF6_XGIF_1D                   _XGIF6.Bits.XGIF_1D
#define XGIF6_XGIF_1E                   _XGIF6.Bits.XGIF_1E
#define XGIF6_XGIF_1F                   _XGIF6.Bits.XGIF_1F
#define XGIF6_XGIF__10                  _XGIF6.MergedBits.grpXGIF__10
#define XGIF6_XGIF_                     XGIF6_XGIF__10

#define XGIF6_XGIF_10_MASK              1
#define XGIF6_XGIF_11_MASK              2
#define XGIF6_XGIF_12_MASK              4
#define XGIF6_XGIF_13_MASK              8
#define XGIF6_XGIF_14_MASK              16
#define XGIF6_XGIF_15_MASK              32
#define XGIF6_XGIF_16_MASK              64
#define XGIF6_XGIF_17_MASK              128
#define XGIF6_XGIF_18_MASK              256
#define XGIF6_XGIF_19_MASK              512
#define XGIF6_XGIF_1A_MASK              1024
#define XGIF6_XGIF_1B_MASK              2048
#define XGIF6_XGIF_1C_MASK              4096
#define XGIF6_XGIF_1D_MASK              8192
#define XGIF6_XGIF_1E_MASK              16384
#define XGIF6_XGIF_1F_MASK              32768
#define XGIF6_XGIF__10_MASK             1023
#define XGIF6_XGIF__10_BITNUM           0


 XGIF7 - XGATE Channel Interrupt Flag Vector 7; 0x00000396 
typedef union {
  word Word;
  struct {
    word             1; 
    word             1; 
    word             1; 
    word             1; 
    word             1; 
    word             1; 
    word             1; 
    word             1; 
    word             1; 
    word XGIF_09     1;                                        Channel Interrupt Flag 09 
    word XGIF_0A     1;                                        Channel Interrupt Flag 0A 
    word XGIF_0B     1;                                        Channel Interrupt Flag 0B 
    word XGIF_0C     1;                                        Channel Interrupt Flag 0C 
    word XGIF_0D     1;                                        Channel Interrupt Flag 0D 
    word XGIF_0E     1;                                        Channel Interrupt Flag 0E 
    word XGIF_0F     1;                                        Channel Interrupt Flag 0F 
  } Bits;
} XGIF7STR;
extern volatile XGIF7STR _XGIF7 @(REG_BASE + 0x00000396);
#define XGIF7                           _XGIF7.Word
#define XGIF7_XGIF_09                   _XGIF7.Bits.XGIF_09
#define XGIF7_XGIF_0A                   _XGIF7.Bits.XGIF_0A
#define XGIF7_XGIF_0B                   _XGIF7.Bits.XGIF_0B
#define XGIF7_XGIF_0C                   _XGIF7.Bits.XGIF_0C
#define XGIF7_XGIF_0D                   _XGIF7.Bits.XGIF_0D
#define XGIF7_XGIF_0E                   _XGIF7.Bits.XGIF_0E
#define XGIF7_XGIF_0F                   _XGIF7.Bits.XGIF_0F

#define XGIF7_XGIF_09_MASK              512
#define XGIF7_XGIF_0A_MASK              1024
#define XGIF7_XGIF_0B_MASK              2048
#define XGIF7_XGIF_0C_MASK              4096
#define XGIF7_XGIF_0D_MASK              8192
#define XGIF7_XGIF_0E_MASK              16384
#define XGIF7_XGIF_0F_MASK              32768


 XGSWT - XGATE Software Trigger Register; 0x00000398 
typedef union {
  word Word;
  struct {
    word XGSWTGrp    8;                                        Software Trigger Bits 
    word XGSWTM      8;                                        Software Trigger Mask 
  } Bits;
} XGSWTSTR;
extern volatile XGSWTSTR _XGSWT @(REG_BASE + 0x00000398);
#define XGSWT                           _XGSWT.Word
#define XGSWT_XGSWTGrp                  _XGSWT.Bits.XGSWTGrp
#define XGSWT_XGSWTM                    _XGSWT.Bits.XGSWTM

#define XGSWT_XGSWTGrp_MASK             255
#define XGSWT_XGSWTGrp_BITNUM           0
#define XGSWT_XGSWTM_MASK               65280
#define XGSWT_XGSWTM_BITNUM             8


 XGSEM - XGATE Semaphore Register; 0x0000039A 
typedef union {
  word Word;
  struct {
    word XGSEMGrp    8;                                        Semaphore Mask 
    word XGSEMM      8;                                        Semaphore Bits 
  } Bits;
} XGSEMSTR;
extern volatile XGSEMSTR _XGSEM @(REG_BASE + 0x0000039A);
#define XGSEM                           _XGSEM.Word
#define XGSEM_XGSEMGrp                  _XGSEM.Bits.XGSEMGrp
#define XGSEM_XGSEMM                    _XGSEM.Bits.XGSEMM

#define XGSEM_XGSEMGrp_MASK             255
#define XGSEM_XGSEMGrp_BITNUM           0
#define XGSEM_XGSEMM_MASK               65280
#define XGSEM_XGSEMM_BITNUM             8


 XGPC - XGATE Program Counter Register; 0x0000039E 
typedef union {
  word Word;
} XGPCSTR;
extern volatile XGPCSTR _XGPC @(REG_BASE + 0x0000039E);
#define XGPC                            _XGPC.Word



 XGR1 - XGATE Register 1; 0x000003A2 
typedef union {
  word Word;
} XGR1STR;
extern volatile XGR1STR _XGR1 @(REG_BASE + 0x000003A2);
#define XGR1                            _XGR1.Word



 XGR2 - XGATE Register 2; 0x000003A4 
typedef union {
  word Word;
} XGR2STR;
extern volatile XGR2STR _XGR2 @(REG_BASE + 0x000003A4);
#define XGR2                            _XGR2.Word



 XGR3 - XGATE Register 3; 0x000003A6 
typedef union {
  word Word;
} XGR3STR;
extern volatile XGR3STR _XGR3 @(REG_BASE + 0x000003A6);
#define XGR3                            _XGR3.Word



