gursimar/smartCarRace/Trash/mc9s12xd256/mc9s12xd256.h
 XGR4 - XGATE Register 4; 0x000003A8 
typedef union {
  word Word;
} XGR4STR;
extern volatile XGR4STR _XGR4 @(REG_BASE + 0x000003A8);
#define XGR4                            _XGR4.Word



 XGR5 - XGATE Register 5; 0x000003AA 
typedef union {
  word Word;
} XGR5STR;
extern volatile XGR5STR _XGR5 @(REG_BASE + 0x000003AA);
#define XGR5                            _XGR5.Word



 XGR6 - XGATE Register 6; 0x000003AC 
typedef union {
  word Word;
} XGR6STR;
extern volatile XGR6STR _XGR6 @(REG_BASE + 0x000003AC);
#define XGR6                            _XGR6.Word



 XGR7 - XGATE Register 7; 0x000003AE 
typedef union {
  word Word;
} XGR7STR;
extern volatile XGR7STR _XGR7 @(REG_BASE + 0x000003AE);
#define XGR7                            _XGR7.Word



 BAKEY0 - Backdoor Access Key 0; 0x0000FF00 
typedef union {
  word Word;
  struct {
    word KEY         16;                                       Backdoor Access Key bits 
  } Bits;
} BAKEY0STR;
extern volatile BAKEY0STR _BAKEY0 @(0x0000FF00);
#define BAKEY0                          _BAKEY0.Word
#define BAKEY0_KEY                      _BAKEY0.Bits.KEY
 BAKEY_ARR Access 4 BAKEYx registers in an array 
#define BAKEY_ARR                       ((volatile word ) &BAKEY0)

#define BAKEY0_KEY_MASK                 65535
#define BAKEY0_KEY_BITNUM               0


 BAKEY1 - Backdoor Access Key 1; 0x0000FF02 
typedef union {
  word Word;
  struct {
    word KEY         16;                                       Backdoor Access Key bits 
  } Bits;
} BAKEY1STR;
extern volatile BAKEY1STR _BAKEY1 @(0x0000FF02);
#define BAKEY1                          _BAKEY1.Word
#define BAKEY1_KEY                      _BAKEY1.Bits.KEY

#define BAKEY1_KEY_MASK                 65535
#define BAKEY1_KEY_BITNUM               0


 BAKEY2 - Backdoor Access Key 2; 0x0000FF04 
typedef union {
  word Word;
  struct {
    word KEY         16;                                       Backdoor Access Key bits 
  } Bits;
} BAKEY2STR;
extern volatile BAKEY2STR _BAKEY2 @(0x0000FF04);
#define BAKEY2                          _BAKEY2.Word
#define BAKEY2_KEY                      _BAKEY2.Bits.KEY

#define BAKEY2_KEY_MASK                 65535
#define BAKEY2_KEY_BITNUM               0


 BAKEY3 - Backdoor Access Key 3; 0x0000FF06 
typedef union {
  word Word;
  struct {
    word KEY         16;                                       Backdoor Access Key bits 
  } Bits;
} BAKEY3STR;
extern volatile BAKEY3STR _BAKEY3 @(0x0000FF06);
#define BAKEY3                          _BAKEY3.Word
#define BAKEY3_KEY                      _BAKEY3.Bits.KEY

#define BAKEY3_KEY_MASK                 65535
#define BAKEY3_KEY_BITNUM               0


 NVFPROT - Non volatile Flash Protection Register; 0x0000FF0D 
typedef union {
  byte Byte;
  struct {
    byte FPLS0       1;                                        Flash Protection Lower Address size 0 
    byte FPLS1       1;                                        Flash Protection Lower Address size 1 
    byte FPLDIS      1;                                        Flash Protection Lower address range disable 
    byte FPHS0       1;                                        Flash Protection Higher address size 0 
    byte FPHS1       1;                                        Flash Protection Higher address size 1 
    byte FPHDIS      1;                                        Flash Protection Higher address range disable 
    byte NV6         1;                                        Non Volatile Flag Bit 
    byte FPOPEN      1;                                        Opens the flash block or subsections of it for program or erase 
  } Bits;
  struct {
    byte grpFPLS 2;
    byte         1;
    byte grpFPHS 2;
    byte         1;
    byte grpNV_6 1;
    byte         1;
  } MergedBits;
} NVFPROTSTR;
extern volatile NVFPROTSTR _NVFPROT @(0x0000FF0D);
#define NVFPROT                         _NVFPROT.Byte
#define NVFPROT_FPLS0                   _NVFPROT.Bits.FPLS0
#define NVFPROT_FPLS1                   _NVFPROT.Bits.FPLS1
#define NVFPROT_FPLDIS                  _NVFPROT.Bits.FPLDIS
#define NVFPROT_FPHS0                   _NVFPROT.Bits.FPHS0
#define NVFPROT_FPHS1                   _NVFPROT.Bits.FPHS1
#define NVFPROT_FPHDIS                  _NVFPROT.Bits.FPHDIS
#define NVFPROT_NV6                     _NVFPROT.Bits.NV6
#define NVFPROT_FPOPEN                  _NVFPROT.Bits.FPOPEN
#define NVFPROT_FPLS                    _NVFPROT.MergedBits.grpFPLS
#define NVFPROT_FPHS                    _NVFPROT.MergedBits.grpFPHS

#define NVFPROT_FPLS0_MASK              1
#define NVFPROT_FPLS1_MASK              2
#define NVFPROT_FPLDIS_MASK             4
#define NVFPROT_FPHS0_MASK              8
#define NVFPROT_FPHS1_MASK              16
#define NVFPROT_FPHDIS_MASK             32
#define NVFPROT_NV6_MASK                64
#define NVFPROT_FPOPEN_MASK             128
#define NVFPROT_FPLS_MASK               3
#define NVFPROT_FPLS_BITNUM             0
#define NVFPROT_FPHS_MASK               24
#define NVFPROT_FPHS_BITNUM             3


 NVFSEC - Non volatile Flash Security Register; 0x0000FF0F 
typedef union {
  byte Byte;
  struct {
    byte SEC0        1;                                        Memory security bit 0 
    byte SEC1        1;                                        Memory security bit 1 
    byte NV2         1;                                        Non Volatile flag bit 2 
    byte NV3         1;                                        Non Volatile flag bit 3 
    byte NV4         1;                                        Non Volatile flag bit 4 
    byte NV5         1;                                        Non Volatile flag bit 5 
    byte NV6         1;                                        Non Volatile flag bit 6 
    byte KEYEN       1;                                        Backdoor Key Security Enable 
  } Bits;
  struct {
    byte grpSEC  2;
    byte grpNV_2 5;
    byte         1;
  } MergedBits;
} NVFSECSTR;
extern volatile NVFSECSTR _NVFSEC @(0x0000FF0F);
#define NVFSEC                          _NVFSEC.Byte
#define NVFSEC_SEC0                     _NVFSEC.Bits.SEC0
#define NVFSEC_SEC1                     _NVFSEC.Bits.SEC1
#define NVFSEC_NV2                      _NVFSEC.Bits.NV2
#define NVFSEC_NV3                      _NVFSEC.Bits.NV3
#define NVFSEC_NV4                      _NVFSEC.Bits.NV4
#define NVFSEC_NV5                      _NVFSEC.Bits.NV5
#define NVFSEC_NV6                      _NVFSEC.Bits.NV6
#define NVFSEC_KEYEN                    _NVFSEC.Bits.KEYEN
#define NVFSEC_SEC                      _NVFSEC.MergedBits.grpSEC
#define NVFSEC_NV_2                     _NVFSEC.MergedBits.grpNV_2
#define NVFSEC_NV                       NVFSEC_NV_2

#define NVFSEC_SEC0_MASK                1
#define NVFSEC_SEC1_MASK                2
#define NVFSEC_NV2_MASK                 4
#define NVFSEC_NV3_MASK                 8
#define NVFSEC_NV4_MASK                 16
#define NVFSEC_NV5_MASK                 32
#define NVFSEC_NV6_MASK                 64
#define NVFSEC_KEYEN_MASK               128
#define NVFSEC_SEC_MASK                 3
#define NVFSEC_SEC_BITNUM               0
#define NVFSEC_NV_2_MASK                124
#define NVFSEC_NV_2_BITNUM              2


   Watchdog reset macro 
#ifdef _lint
  #define __RESET_WATCHDOG()   empty 
#else
  #define __RESET_WATCHDOG() (void)(ARMCOP = 0x55, ARMCOP = 0xAA)   Just write a byte to feed the dog 
#endif



   D E P R E C I A T E D   S Y M B O L S   

 --------------------------------------------------------------------------- 
 The following symbols were removed, because they were invalid or irrelevant 
 --------------------------------------------------------------------------- 
#define MCCNTlo_BIT0                     This_symb_has_been_depreciated
#define MCCNTlo_BIT1                     This_symb_has_been_depreciated
#define MCCNTlo_BIT2                     This_symb_has_been_depreciated
#define MCCNTlo_BIT3                     This_symb_has_been_depreciated
#define MCCNTlo_BIT4                     This_symb_has_been_depreciated
#define MCCNTlo_BIT5                     This_symb_has_been_depreciated
#define MCCNTlo_BIT6                     This_symb_has_been_depreciated
#define MCCNTlo_BIT7                     This_symb_has_been_depreciated
#define MCCNThi_BIT8                     This_symb_has_been_depreciated
#define MCCNThi_BIT9                     This_symb_has_been_depreciated
#define MCCNThi_BIT10                    This_symb_has_been_depreciated
#define MCCNThi_BIT11                    This_symb_has_been_depreciated
#define MCCNThi_BIT12                    This_symb_has_been_depreciated
#define MCCNThi_BIT13                    This_symb_has_been_depreciated
#define MCCNThi_BIT14                    This_symb_has_been_depreciated
#define MCCNThi_BIT15                    This_symb_has_been_depreciated
#define MCCNTlo_BIT0_MASK                This_symb_has_been_depreciated
#define MCCNTlo_BIT1_MASK                This_symb_has_been_depreciated
#define MCCNTlo_BIT2_MASK                This_symb_has_been_depreciated
#define MCCNTlo_BIT3_MASK                This_symb_has_been_depreciated
#define MCCNTlo_BIT4_MASK                This_symb_has_been_depreciated
#define MCCNTlo_BIT5_MASK                This_symb_has_been_depreciated
#define MCCNTlo_BIT6_MASK                This_symb_has_been_depreciated
#define MCCNTlo_BIT7_MASK                This_symb_has_been_depreciated
#define MCCNThi_BIT8_MASK                This_symb_has_been_depreciated
#define MCCNThi_BIT9_MASK                This_symb_has_been_depreciated
#define MCCNThi_BIT10_MASK               This_symb_has_been_depreciated
#define MCCNThi_BIT11_MASK               This_symb_has_been_depreciated
#define MCCNThi_BIT12_MASK               This_symb_has_been_depreciated
#define MCCNThi_BIT13_MASK               This_symb_has_been_depreciated
#define MCCNThi_BIT14_MASK               This_symb_has_been_depreciated
#define MCCNThi_BIT15_MASK               This_symb_has_been_depreciated

#endif
